--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/marcoyel21/Desktop/STATA/MarcoRamos_142244_Tarea1RES.log
  log type:  text
 opened on:   2 Sep 2020, 15:11:36

. *Antes de empezar, asigno un directorio para poder trabajar y donde he descarg
> ado las bases de datos.
. cd /Users/marcoyel21/Desktop/STATA
/Users/marcoyel21/Desktop/STATA

. **I. Ejercicio 1*
. *Guardar la base Bonos.xlsx y guardarla como archivo DTA.
. 
. import excel Bonos.xlsx , firstrow
(233 vars, 1,487 obs)

. save Bonos
file Bonos.dta saved

. *(a)
. *Para poder analizar cuales variables son strings pero deberían ser númericas 
> lo más intuitivo es utilizar la función describe para identificar los strings.
>  Como dichas variabels tienen un color en el visor (en STATA 16 es amarillo) ,
>  simplemente analizo cuales tienen datos númericos.
. describe

Contains data from Bonos.dta
  obs:         1,487                          
 vars:           233                          2 Sep 2020 15:11
--------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------
obs             str4    %9s                   obs
issuer_1        str36   %36s                  issuer_1
issuer          str33   %33s                  issuer
issuedate       int     %td..                 issuedate
maturity        str41   %41s                  maturity
year            int     %10.0g                year
years           byte    %10.0g                years
rate            str39   %39s                  rate
curr            str17   %17s                  curr
bunddm          double  %10.0g                bunddm
spreaddm        double  %10.0g                spreaddm
var12           double  %10.0g                var12
treasury        double  %10.0g                treasury
spreaddol       double  %10.0g                spreaddol
spread          str18   %18s                  spread
amt             str17   %17s                  amt
lnamt           double  %10.0g                lnamt
sp              str4    %9s                   sp
highrate        byte    %10.0g                highrate
lowrate         byte    %10.0g                lowrate
aaa             byte    %10.0g                aaa
aa              byte    %10.0g                aa
a               byte    %10.0g                a
bb              byte    %10.0g                bb
b               byte    %10.0g                b
issuerc         str22   %22s                  issuerc
ibc             str19   %19s                  ibc
ibank           str30   %30s                  ibank
reg             byte    %10.0g                reg
shelf           byte    %10.0g                shelf
cac             byte    %10.0g                cac
v100100         byte    %10.0g                v100100
v10050          byte    %10.0g                v10050
v7550           byte    %10.0g                v7550
jur             str29   %29s                  jur
listing         str44   %44s                  listing
arbitration     str1    %9s                   arbitration
law             str17   %17s                  law
mandmeet        byte    %10.0g                mandmeet
sinkingfund     byte    %10.0g                sinkingfund
secured         str1    %9s                   secured
othernotes      str109  %109s                 othernotes
aggregation     byte    %10.0g                aggregation
quorum          str11   %11s                  quorum
qpost           double  %10.0g                qpost
paymentvote     str6    %9s                   paymentvote
lowervoteifme~g byte    %10.0g                lowervoteifmeeting
othervote       double  %10.0g                othervote
sovimm          byte    %10.0g                sovimm
siexcept        byte    %10.0g                siexcept
immexe          byte    %10.0g                immexe
secregexe       byte    %10.0g                secregexe
bank            int     %10.0g                bank
minmodvote      double  %10.0g                minmodvote
trustee         byte    %10.0g                trustee
agent           byte    %10.0g                agent
graceprinci     byte    %10.0g                graceprinci
graceinterest   byte    %10.0g                graceinterest
graceother      byte    %10.0g                graceother
imf             byte    %10.0g                imf
acceleration    str26   %26s                  acceleration
reverseacc      str10   %10s                  reverseacc
notecommittee   byte    %10.0g                notecommittee
newunanimit     byte    %10.0g                newunanimit
disenfranch     byte    %10.0g                disenfranch
disenfexcepti~s byte    %10.0g                disenfexceptions
npledge         byte    %10.0g                npledge
npnarrow        byte    %10.0g                npnarrow
npexcep         str2    %9s                   npexcep
pp              byte    %10.0g                pp
pp_mandatoryp~n byte    %10.0g                pp_mandatoryprovision
pp_dateofissue  byte    %10.0g                pp_dateofissue
pp_currencyof~t byte    %10.0g                pp_currencyofpayment
ppnote          str94   %94s                  ppnote
splitlaw        byte    %10.0g                splitlaw
pp5             byte    %10.0g                pp5
pp1             byte    %10.0g                pp1
pp10            byte    %10.0g                pp10
acc10           byte    %10.0g                acc10
acc25           byte    %10.0g                acc25
revacc50        byte    %10.0g                revacc50
revacc66        byte    %10.0g                revacc66
revacc75        byte    %10.0g                revacc75
pp_change       byte    %10.0g                pp_change
pp_mandatoryp~e byte    %10.0g                pp_mandatoryprovision_change
pp_dateofiss~ge byte    %10.0g                pp_dateofissue_change
pp_currencyof~e byte    %10.0g                pp_currencyofpayment_change
npnarrow_change byte    %10.0g                npnarrow_change
acceleration_~e byte    %10.0g                acceleration_change
reverseacc_ch~e byte    %10.0g                reverseacc_change
notecommittee~e byte    %10.0g                notecommittee_change
newunanimit_c~e byte    %10.0g                newunanimit_change
disenfranch_c~e byte    %10.0g                disenfranch_change
minmodvote_ch~e byte    %10.0g                minmodvote_change
trustee_change  byte    %10.0g                trustee_change
mandmeet_change byte    %10.0g                mandmeet_change
cac_change      byte    %10.0g                cac_change
missppcomp      byte    %10.0g                missppcomp
misscaccomp     byte    %10.0g                misscaccomp
pp_chagelangu~e byte    %10.0g                pp_chagelanguage
cac_changelan~e byte    %10.0g                cac_changelanguage
pp_chagelangu~t byte    %10.0g                pp_chagelanguage_preelliot
pp_chagelangu~1 byte    %10.0g                pp_chagelanguage_postelliot1
pp_chagelangu~2 byte    %10.0g                pp_chagelanguage_postelliot2
pp_chagelan~80s byte    %10.0g                pp_chagelanguage80s
pp_chagelan~90s byte    %10.0g                pp_chagelanguage90s
pp_chagelan~00s byte    %10.0g                pp_chagelanguage00s
cac_chagelang~o byte    %10.0g                cac_chagelanguage_premexico
cac_chagelang~1 byte    %10.0g                cac_chagelanguage_postmexico1
cac_chagelang~2 byte    %10.0g                cac_chagelanguage_postmexico2
cac_chagela~80s byte    %10.0g                cac_chagelanguage80s
cac_chagela~90s byte    %10.0g                cac_chagelanguage90s
cac_chagela~00s byte    %10.0g                cac_chagelanguage00s
timeindpp_cha~o byte    %10.0g                timeindpp_chagelanguage_preellio
timeindpp_cha~i byte    %10.0g                timeindpp_chagelanguage_postelli
var116          byte    %10.0g                var116
timeindpp_c~80s byte    %10.0g                timeindpp_chagelanguage80s
timeindpp_c~90s byte    %10.0g                timeindpp_chagelanguage90s
timeindpp_c~00s byte    %10.0g                timeindpp_chagelanguage00s
timeindcac_ch~i byte    %10.0g                timeindcac_chagelanguage_premexi
timeindcac_ch~x byte    %10.0g                timeindcac_chagelanguage_postmex
var122          byte    %10.0g                var122
timeindcac_~80s byte    %10.0g                timeindcac_chagelanguage80s
timeindcac_~90s byte    %10.0g                timeindcac_chagelanguage90s
timeindcac_~00s byte    %10.0g                timeindcac_chagelanguage00s
change_issuerc  byte    %10.0g                change_issuerc
change_ibc      byte    %10.0g                change_ibc
change_ibank    byte    %10.0g                change_ibank
voice_accon     double  %10.0g                voice_accon
political_sta~y double  %10.0g                political_stability
government_ef~c double  %10.0g                government_effec
regulatory      double  %10.0g                regulatory
rulelaw         double  %10.0g                rulelaw
control_corr    double  %10.0g                control_corr
debtgnp         double  %10.0g                debtgnp
debtserviceex~s double  %10.0g                debtserviceexports
gdpgrowth       double  %10.0g                gdpgrowth
standarddevia~h double  %10.0g                standarddeviationofexportgrowth
ratioofshortt~t double  %10.0g                ratioofshorttermdebttototaldebt
reservesshort~t double  %10.0g                reservesshorttermdebt
ratioofdomest~p double  %10.0g                ratioofdomesticcredittogdp
ratioofreserv~s double  %10.0g                ratioofreservesimports
debtreschedul~r byte    %10.0g                debtrescheduledinpreviousyear
ratioofreserv~p double  %10.0g                ratioofreservesgdp
standarddevia~2 double  %10.0g                standarddeviationofexportgrowth2
dummy_nylaw     byte    %10.0g                dummy_nylaw
dummy_englaw    byte    %10.0g                dummy_englaw
dummy_germanlaw byte    %10.0g                dummy_germanlaw
dummy_otherlaw  byte    %10.0g                dummy_otherlaw
dummy_post2003  byte    %10.0g                dummy_post2003
dummy_acc_cla~s byte    %10.0g                dummy_acc_clauses
dummy_revacc_~s byte    %10.0g                dummy_revacc_clauses
dummy_trust_n~e byte    %10.0g                dummy_trust_notecomitee
dummy_lawyers   byte    %10.0g                dummy_lawyers
dummy_euro      byte    %10.0g                dummy_euro
dummy_pound     byte    %10.0g                dummy_pound
bbb             byte    %10.0g                bbb
dummy_usdollar  byte    %10.0g                dummy_usdollar
chenge_ratingsp byte    %10.0g                chenge_ratingsp
ny_highrate     byte    %10.0g                ny_highrate
english_highr~e byte    %10.0g                english_highrate
dummy_acceler~s byte    %10.0g                dummy_acceleration_rev_clauses
highrate2       byte    %10.0g                highrate2
issuercchange   byte    %10.0g                issuercchange
ibcchange       byte    %10.0g                ibcchange
trend_icibc     byte    %10.0g                trend_icibc
num_lawyers2    byte    %10.0g                num_lawyers2
var168          byte    %10.0g                var168
ratingorder     str3    %9s                   ratingorder
ratingordernum  byte    %10.0g                ratingordernum
rep_ic_al       byte    %10.0g                rep_ic_al
rep_ibc_al      byte    %10.0g                rep_ibc_al
rep_ic_size     byte    %10.0g                rep_ic_size
rep_ic_size2    byte    %10.0g                rep_ic_size2
rep_ibc_size    byte    %10.0g                rep_ibc_size
rep_ibc_size2   byte    %10.0g                rep_ibc_size2
rep_ib_size     byte    %10.0g                rep_ib_size
rep_ib_size2    byte    %10.0g                rep_ib_size2
rep_ic_size_ny  byte    %10.0g                rep_ic_size_ny
rep_ic_size_ny2 byte    %10.0g                rep_ic_size_ny2
rep_ibc_size_ny byte    %10.0g                rep_ibc_size_ny
rep_ibc_size~y2 byte    %10.0g                rep_ibc_size_ny2
rep_ib_size_ny  byte    %10.0g                rep_ib_size_ny
rep_ib_size_ny2 byte    %10.0g                rep_ib_size_ny2
rep_ic_size_eng byte    %10.0g                rep_ic_size_eng
rep_ic_size_e~2 byte    %10.0g                rep_ic_size_eng2
rep_ibc_size_~g byte    %10.0g                rep_ibc_size_eng
rep_ibc_size~g2 byte    %10.0g                rep_ibc_size_eng2
rep_ib_size_eng byte    %10.0g                rep_ib_size_eng
rep_ib_size_e~2 byte    %10.0g                rep_ib_size_eng2
hh_index_ic     double  %10.0g                hh_index_ic
hh_index_ic_ny  double  %10.0g                hh_index_ic_ny
hh_index_ic_eng double  %10.0g                hh_index_ic_eng
hh_index_ibc    double  %10.0g                hh_index_ibc
hh_index_ibc_ny double  %10.0g                hh_index_ibc_ny
hh_index_ibc_~g double  %10.0g                hh_index_ibc_eng
hh_index_ib     double  %10.0g                hh_index_ib
hh_index_ib_ny  double  %10.0g                hh_index_ib_ny
hh_index_ib_eng double  %10.0g                hh_index_ib_eng
multilogit_la~s byte    %10.0g                multilogit_lawyers
spread1         double  %10.0g                spread1
spread2         double  %10.0g                spread2
spread3         double  %10.0g                spread3
spread4         double  %10.0g                spread4
changeibank2    byte    %10.0g                changeibank2
var206          byte    %10.0g                var206
var207          byte    %10.0g                var207
var208          byte    %10.0g                var208
var209          byte    %10.0g                var209
rep_ic_top2     byte    %10.0g                rep_ic_top2
rep_ic_top2_ny  byte    %10.0g                rep_ic_top2_ny
rep_ic_top2_eng byte    %10.0g                rep_ic_top2_eng
rep_ibc_top2    byte    %10.0g                rep_ibc_top2
rep_ibc_top2_ny byte    %10.0g                rep_ibc_top2_ny
rep_ibc_top2_~g byte    %10.0g                rep_ibc_top2_eng
rep_ic_top5     byte    %10.0g                rep_ic_top5
rep_ic_top5_ny  byte    %10.0g                rep_ic_top5_ny
rep_ic_top5_eng byte    %10.0g                rep_ic_top5_eng
rep_ibc_top5    byte    %10.0g                rep_ibc_top5
rep_ibc_top5_ny byte    %10.0g                rep_ibc_top5_ny
rep_ibc_top5_~g byte    %10.0g                rep_ibc_top5_eng
all_two_rep     byte    %10.0g                all_two_rep
all_one_zero    byte    %10.0g                all_one_zero
all_options_rep byte    %10.0g                all_options_rep
ny_two_rep      byte    %10.0g                ny_two_rep
ny_one_zero     byte    %10.0g                ny_one_zero
ny_options_rep  byte    %10.0g                ny_options_rep
eng_two_rep     byte    %10.0g                eng_two_rep
eng_one_zero    byte    %10.0g                eng_one_zero
eng_options_rep byte    %10.0g                eng_options_rep
cleary_sc_all   byte    %10.0g                cleary_sc_all
cleary_sc_ny    byte    %10.0g                cleary_sc_ny
cleary_sc_eng   byte    %10.0g                cleary_sc_eng
--------------------------------------------------------------------------------
Sorted by: 

. 
. *las siguientes variables son strings pero pueden convertirse a númericas [rat
> e spread amt arbitration secured quorum paymentvote acceleration reverseacc np
> excep]*
. 
. *(b)
. *En este sentido, uso la función destring para convertirlas a variables más la
>  opción force para coercionar para que los valores no numericos se conviertan 
> en NAs.
. 
. destring list rate spread amt arbitration secured quorum paymentvote accelerat
> ion reverseacc npexcep , replace force
listing: contains nonnumeric characters; replaced as byte
(1487 missing values generated)
rate: contains nonnumeric characters; replaced as double
(232 missing values generated)
spread: contains nonnumeric characters; replaced as double
(412 missing values generated)
amt: contains nonnumeric characters; replaced as double
(46 missing values generated)
arbitration: contains nonnumeric characters; replaced as byte
(149 missing values generated)
secured: contains nonnumeric characters; replaced as byte
(477 missing values generated)
quorum: contains nonnumeric characters; replaced as double
(1197 missing values generated)
paymentvote: contains nonnumeric characters; replaced as double
(1030 missing values generated)
acceleration: contains nonnumeric characters; replaced as double
(947 missing values generated)
reverseacc: contains nonnumeric characters; replaced as double
(1098 missing values generated)
npexcep: contains nonnumeric characters; replaced as byte
(526 missing values generated)

. 
. *(c)
. * Uso la función Keep para mantener la lista de variables [ year spread aaa aa
>  a bb b num_lawyers2 rep_ic_size curr law rep_ic_top2 rep_ic_top2_ny rep_ic_to
> p2_eng lnamt years highrate2 hh_index_ib hh_index_ib_eng hh_index_ib_ny ].
. 
. keep year spread aaa aa a bb b num_lawyers2 rep_ic_size curr law rep_ic_top2 r
> ep_ic_top2_ny rep_ic_top2_eng lnamt years highrate2 hh_index_ib hh_index_ib_en
> g hh_index_ib_ny

. 
. *(d) Mantengo las observaciones que son posteriores al año 1947. Para ello uso
>  la función Keep pero ahora con un argumento lógico.
. *Uso el año 1946 para que la condición incluya desde 1947.
. 
. keep if year > 1946
(5 observations deleted)

. 
. *(d)
. *Exploro la base de datos.
. 
. describe

Contains data from Bonos.dta
  obs:         1,482                          
 vars:            20                          2 Sep 2020 15:11
--------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------------------
year            int     %10.0g                year
years           byte    %10.0g                years
curr            str17   %17s                  curr
spread          double  %10.0g                spread
lnamt           double  %10.0g                lnamt
aaa             byte    %10.0g                aaa
aa              byte    %10.0g                aa
a               byte    %10.0g                a
bb              byte    %10.0g                bb
b               byte    %10.0g                b
law             str17   %17s                  law
highrate2       byte    %10.0g                highrate2
num_lawyers2    byte    %10.0g                num_lawyers2
rep_ic_size     byte    %10.0g                rep_ic_size
hh_index_ib     double  %10.0g                hh_index_ib
hh_index_ib_ny  double  %10.0g                hh_index_ib_ny
hh_index_ib_eng double  %10.0g                hh_index_ib_eng
rep_ic_top2     byte    %10.0g                rep_ic_top2
rep_ic_top2_ny  byte    %10.0g                rep_ic_top2_ny
rep_ic_top2_eng byte    %10.0g                rep_ic_top2_eng
--------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. tabstat aaa aa a bb b ,s(sum)

   stats |       aaa        aa         a        bb         b
---------+--------------------------------------------------
     sum |       164       232       189       316       156
------------------------------------------------------------

. tab law 

              law |      Freq.     Percent        Cum.
------------------+-----------------------------------
          Austria |          1        0.08        0.08
          English |        542       40.66       40.74
English and Wales |          1        0.08       40.81
           France |         11        0.83       41.64
 France & Germany |          1        0.08       41.71
           German |        113        8.48       50.19
            Japan |          9        0.68       50.86
            Local |         60        4.50       55.36
              Lux |          8        0.60       55.96
        Mongolian |          1        0.08       56.04
               NY |        556       41.71       97.75
      Netherlands |          9        0.68       98.42
         Portugal |          1        0.08       98.50
            Spain |          2        0.15       98.65
            Swiss |         18        1.35      100.00
------------------+-----------------------------------
            Total |      1,333      100.00

. tab num_lawyers2

num_lawyers |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        192       12.98       12.98
          1 |        670       45.30       58.28
          2 |        617       41.72      100.00
------------+-----------------------------------
      Total |      1,479      100.00

. tab highrate2

  highrate2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        472       38.59       38.59
          1 |        751       61.41      100.00
------------+-----------------------------------
      Total |      1,223      100.00

. tab curr

             curr |      Freq.     Percent        Cum.
------------------+-----------------------------------
              ATS |          1        0.07        0.07
         AUDollar |          2        0.14        0.20
Austrian Shilling |          2        0.14        0.34
              CAD |          2        0.14        0.47
              CHF |          3        0.20        0.68
              CZK |          1        0.07        0.74
   CanadianDollar |          6        0.41        1.15
              DKK |          2        0.14        1.29
               DM |        112        7.58        8.87
              DRC |          1        0.07        8.94
             Dfls |          8        0.54        9.48
           Dinars |          1        0.07        9.55
    DutchGuilders |          1        0.07        9.61
              ECU |         15        1.02       10.63
             Euro |        231       15.64       26.27
        EuroFranc |          1        0.07       26.34
      FrenchFranc |         13        0.88       27.22
           GreekD |          1        0.07       27.29
        HK Dollar |          2        0.14       27.42
             Kuna |          1        0.07       27.49
               LE |          1        0.07       27.56
              LTL |          1        0.07       27.62
             Lire |          5        0.34       27.96
         LuxFranc |          4        0.27       28.23
              NLG |          4        0.27       28.50
              NOK |          2        0.14       28.64
  NorwegianKroner |          3        0.20       28.84
              PTE |          1        0.07       28.91
          Pesetas |          2        0.14       29.05
  Philippine Peso |          1        0.07       29.11
            Pound |         24        1.62       30.74
               Ps |          4        0.27       31.01
                R |          1        0.07       31.08
             Real |          1        0.07       31.14
           Rubles |          1        0.07       31.21
              SEK |          1        0.07       31.28
              SFR |          1        0.07       31.35
 SouthAfricanRand |          1        0.07       31.42
     SwedishKrona |          3        0.20       31.62
       SwissFranc |         17        1.15       32.77
              TRY |          1        0.07       32.84
         USdollar |        949       64.25       97.09
  Usdollar & Euro |          1        0.07       97.16
              Yen |         42        2.84      100.00
------------------+-----------------------------------
            Total |      1,477      100.00

. * En cuanto a la base de datos, filtrada cuenta con 1,482 observaciones y 20 v
> ariables. Asimismo, se identifico de los ejercicios anteriores que existían al
> gunos casos en los que una variable contenía valores string cuando deberían se
> r númericos. Por ellos se optó por transformar esos valores a NA(.).
. *La información es acerca de bonos que se emitieron desde 1947 hasta el 2012(c
> on un año promedio de emision en 1995) cuya  duración promedio fue de 10.8 año
> s. El spread promedio es de 1.96 sin embargo este va desde -7.23 a 50.93. Los 
> logaritmos del monto de la emisión van desde .47 a 13.8 con una media en 6.25.
>  Los indice de aglomeración general tienen un promedio de .06 y un valor máxic
> mo de .14
. *En cuanto a la procedencia, la gran mayoría son en dólares estadounidenses (9
> 49). Asimismo, en caso de default la gran mayoría (1099) se encuentran protegi
> dos bajo las leyes de Estados Unidos o de Reino Unido (NY + English+ English a
> nd Wales). Relacionado con esto tan solo 192 bonos no cuentan con una firma de
>  abogados en el contrato.
. 
. * En cuanto a la calidad, 751 bonos son de alta calidad. Asimismo, la mayoría 
> cuentan con un rating bb (316), seguido de aa(232), a(189), aaa(164) y finalme
> nte b (156).
. *Guardo los datos que trabajé en la sección.
. save bonos_ej1
file bonos_ej1.dta saved

. 
. *II
. 
. 
. *Asimismo, reviso los datos para diseñar un merge óptimo. 
. clear

. import excel Bonos2.xlsx , firstrow
(17 vars, 1,487 obs)

. save Bonos2
file Bonos2.dta saved

. use Bonos2

. 
. *En este sentido se descubrió que ambas bases cuentan con el mismo número de f
> ilas y que además comparten las variables obs issuer_1 issuer issuedate maturi
> ty year years.
. *Ahora uso la funicón merge junto con la opción replace y update para que las 
> variables compartidas no se dupliquen, más la opción force para coeccionar a q
> ue en caso de que la misma variable tenga diferente tipo, elija uno.
. 
. merge 1:1 _n using Bonos, replace update force
(note: variable standarddeviationofexportgrowth was double in the using data,
       but will be str17 now)
(note: variable reservesshorttermdebt was double in the using data, but will
       be str17 now)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0

    matched                             1,487
        not updated                     1,487  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. *(a) En cuanto a las variables nuevas, se encontró gracias a la función descri
> be y a la clasficación por colores de STATA, que standarddeviationofexportgrow
> th y reservesshorttermdebt deberían ser númericas.
. 
. *(b)
. *En este sentido podemos corregir tanto las viejas(otra vez debido a que use B
> onos.dta) como las nuevas variables.
. destring list rate spread amt arbitration secured quorum paymentvote accelerat
> ion reverseacc npexcep , replace force
listing: contains nonnumeric characters; replaced as byte
(1487 missing values generated)
rate: contains nonnumeric characters; replaced as double
(232 missing values generated)
spread: contains nonnumeric characters; replaced as double
(412 missing values generated)
amt: contains nonnumeric characters; replaced as double
(46 missing values generated)
arbitration: contains nonnumeric characters; replaced as byte
(149 missing values generated)
secured: contains nonnumeric characters; replaced as byte
(477 missing values generated)
quorum: contains nonnumeric characters; replaced as double
(1197 missing values generated)
paymentvote: contains nonnumeric characters; replaced as double
(1030 missing values generated)
acceleration: contains nonnumeric characters; replaced as double
(947 missing values generated)
reverseacc: contains nonnumeric characters; replaced as double
(1098 missing values generated)
npexcep: contains nonnumeric characters; replaced as byte
(526 missing values generated)

. 
. destring standarddeviationofexportgrowth reservesshorttermdebt , replace force
standarddeviationofexportgrowth: contains nonnumeric characters; replaced as dou
> ble
(404 missing values generated)
reservesshorttermdebt: contains nonnumeric characters; replaced as double
(280 missing values generated)

. 
. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         obs |          0
    issuer_1 |          0
      issuer |          0
   issuedate |      1,484    13096.59    5126.586      -6524      19043
    maturity |          0
-------------+---------------------------------------------------------
        year |      1,484    1995.394    14.05058       1942       2012
       years |      1,427    10.92782    8.233512          0        100
debtservic~s |      1,177    11.05489    16.58627          0    120.186
   gdpgrowth |      1,229    .0070874    .0094286   -.039871    .041981
standardde~h |      1,083    15.04338    8.283888    2.56595    102.685
-------------+---------------------------------------------------------
ratioofsho~t |      1,177    7.830423    11.07384          0    63.1578
reservessh~t |      1,207    46.93405    484.7642          0    16584.6
ratioofdom~p |      1,235    68.42651    53.39112      -1.49        313
ratioofres~s |      1,230    27.73291    23.17948          0    148.246
debtresche~r |      1,078    .0640074    .2448798          0          1
-------------+---------------------------------------------------------
ratioofres~p |      1,156    10.91103    9.103049          0    82.2126
standardde~2 |      1,083    294.8625    589.5089    6.58409    10544.2
        rate |      1,255    .0713378     .031638       .005        .55
        curr |          0
      bunddm |        226     .047331    .0172039      .0138      .0876
-------------+---------------------------------------------------------
    spreaddm |        201    .0181582    .0196889     -.0207      .0738
       var12 |        207    1.951014    2.116048      -2.07        7.5
    treasury |      1,238    .0539813    .0221889      .0012      .1467
   spreaddol |      1,075    .0196847    .0321019     -.0723      .5093
      spread |      1,075    1.968465    3.210185      -7.23      50.93
-------------+---------------------------------------------------------
         amt |      1,441    4047.344    36295.34        1.1    1000000
       lnamt |      1,261    6.252097    1.571821        .47    13.8155
          sp |          0
    highrate |      1,223     .478332    .4997346          0          1
     lowrate |      1,223    .3859362    .4870148          0          1
-------------+---------------------------------------------------------
         aaa |      1,223    .1340965    .3408953          0          1
          aa |      1,223    .1896975     .392222          0          1
           a |      1,223     .154538    .3616116          0          1
          bb |      1,223     .258381    .4379236          0          1
           b |      1,223    .1275552    .3337303          0          1
-------------+---------------------------------------------------------
     issuerc |          0
         ibc |          0
       ibank |          0
         reg |      1,076     .510223     .593678          0         11
       shelf |      1,076     .320632    .4669365          0          1
-------------+---------------------------------------------------------
         cac |        976    .7336066     .442299          0          1
     v100100 |      1,334    .2848576    .4515158          0          1
      v10050 |      1,201    .2181515    .4131629          0          1
       v7550 |      1,191    .5843829    .4930351          0          1
         jur |          0
-------------+---------------------------------------------------------
     listing |          0
 arbitration |      1,338    .0635277    .2470471          0          2
         law |          0
    mandmeet |      1,465    .2750853    .4467097          0          1
 sinkingfund |        806    .2369727    .4254894          0          1
-------------+---------------------------------------------------------
     secured |      1,010    .0168317    .1287042          0          1
  othernotes |          0
 aggregation |        876    .0079909    .0890846          0          1
      quorum |        290    .7276959    .4245817          0       7.55
       qpost |        185    .3579076    .1760996          0        .85
-------------+---------------------------------------------------------
 paymentvote |        457    .8177974    .1644194          0          1
lowervotei~g |        235    .2978723    .7195349          0          9
   othervote |        588    .8108697    2.728976          0      66.67
      sovimm |        622    .7508039    .4365997          0          2
    siexcept |        575    .6591304    1.154592          0          9
-------------+---------------------------------------------------------
      immexe |        618     .605178    .4892084          0          1
   secregexe |        600        .235    .4243526          0          1
        bank |      1,204    7.641196    8.681058          1        106
  minmodvote |      1,282    .7065878    .3368888      .1875          1
     trustee |      1,048    .0887405    .2845045          0          1
-------------+---------------------------------------------------------
       agent |      1,029    .8551992     .352071          0          1
 graceprinci |      1,029    26.80758    18.88275          0         90
graceinter~t |      1,090    27.39174    17.86038          0         90
  graceother |      1,068    48.51498    25.89795          0         90
         imf |      1,118    .2728086    .4456026          0          1
-------------+---------------------------------------------------------
acceleration |        540    .2447593     .057841          0         .5
  reverseacc |        389    .5647815    .1010245          0        .75
notecommi~ee |      1,338    .1023916     .303276          0          1
 newunanimit |      1,217    .0262942    .1600745          0          1
 disenfranch |        989    .2679474    .4431141          0          1
-------------+---------------------------------------------------------
disenfexce~s |        345    1.211594    1.247735          0          3
     npledge |      1,134    .8941799     .307743          0          1
    npnarrow |        951    .4058885    .4913216          0          1
     npexcep |        961    2.935484    3.134153          0         11
          pp |      1,335    2.626217    2.494143          0         10
-------------+---------------------------------------------------------
pp_mandato~n |      1,239    .1662631     .372467          0          1
pp_dateof~ue |      1,239    .1743341    .3795498          0          1
pp_currenc~t |      1,238    .1066236    .3087588          0          1
      ppnote |          0
    splitlaw |      1,046    .3451243    .4756362          0          1
-------------+---------------------------------------------------------
         pp5 |      1,335    .3513109    .6387272          0          5
         pp1 |      1,165     .560515    .4965376          0          1
        pp10 |      1,165    .0532189    .2245661          0          1
       acc10 |      1,145    .0279476    .1648947          0          1
       acc25 |      1,145    .4087336    .4918147          0          1
-------------+---------------------------------------------------------
    revacc50 |        437    .5652174    .4962966          0          1
    revacc66 |        437    .0915332    .2886963          0          1
    revacc75 |        437    .0732265    .2608066          0          1
   pp_change |      1,125    .1173333    .3219602          0          1
pp_mandato~e |        971     .053553    .2252496          0          1
-------------+---------------------------------------------------------
pp_dateof~ge |        971    .0525232    .2231945          0          1
pp_currenc~e |        971    .0226571    .1488843          0          1
npnarrow_c~e |        659    .0561457    .2303777          0          1
accelerati~e |        885    .1468927     .354199          0          1
reverseacc~e |        308    .0519481    .2222833          0          1
-------------+---------------------------------------------------------
notecommi~ge |      1,106    .0289331    .1676943          0          1
newunanimi~e |        960    .0052083    .0720181          0          1
disenfranc~e |        691    .0549928    .2281313          0          1
minmodvote~e |      1,070    .2242991    .4173149          0          1
trustee_ch~e |        769    .0559168    .2299105          0          1
-------------+---------------------------------------------------------
mandmeet_c~e |      1,282    .1794072    .3838426          0          1
  cac_change |        753    .0849934    .2790572          0          1
  missppcomp |        624           1           0          1          1
 misscaccomp |        175           1           0          1          1
pp_chagela~e |      1,335     .164794    .3711336          0          1
-------------+---------------------------------------------------------
cac_change~e |        675    .2725926    .4456232          0          1
pp_chagela~t |        708    .1920904    .3942223          0          1
pp_chagela~1 |        588    .1343537    .3413223          0          1
pp_chagela~2 |         39    .1282051    .3386884          0          1
pp_chage~80s |        120    .3333333    .4733811          0          1
-------------+---------------------------------------------------------
pp_chage~90s |        342    .1842105    .3882238          0          1
pp_chage~00s |        686    .1355685    .3425796          0          1
cac_chagel~o |        261    .3448276    .4762252          0          1
cac_chagel~1 |        380    .2289474    .4207092          0          1
cac_chagel~2 |         34    .2058824    .4104256          0          1
-------------+---------------------------------------------------------
cac_chag~80s |         39    .5128205    .5063697          0          1
cac_chag~90s |        141    .3900709    .4895048          0          1
cac_chag~00s |        492    .2174797    .4129514          0          1
timeindpp_~o |        708           1           0          1          1
timeindpp_~i |        588           1           0          1          1
-------------+---------------------------------------------------------
      var116 |         39           1           0          1          1
timeindp~80s |        120           1           0          1          1
timeindp~90s |        342           1           0          1          1
timeindp~00s |        686           1           0          1          1
timeindcac~i |        274           1           0          1          1
-------------+---------------------------------------------------------
timeindcac~x |        407           1           0          1          1
      var122 |         35           1           0          1          1
timeindc~80s |         40           1           0          1          1
timeindc~90s |        147           1           0          1          1
timeindc~00s |        526           1           0          1          1
-------------+---------------------------------------------------------
change_iss~c |      1,036    .8706564     .335742          0          1
  change_ibc |        985    .7634518    .4251784          0          1
change_ibank |      1,256    .3152866     .464815          0          1
 voice_accon |        630     62.6877    27.15116   -1.22055        100
political_~y |        629    53.58601    29.39279   -2.03211        100
-------------+---------------------------------------------------------
government~c |        630    64.21364    24.50781   -.559854    99.5146
  regulatory |        629    62.15471    26.61328   -.893113        100
     rulelaw |        626    57.96947    28.20231     -.9365        100
control_corr |        357     55.5839    28.74069   -1.08914        100
     debtgnp |      1,230    18.01436    24.88246          0    205.545
-------------+---------------------------------------------------------
 dummy_nylaw |      1,333    .4171043    .4932655          0          1
dummy_englaw |      1,333    .4066017    .4913836          0          1
dummy_germ~w |      1,333    .0847712    .2786454          0          1
dummy_othe~w |      1,333    .0915229    .2884595          0          1
dummy_p~2003 |      1,487    .3739072    .4840022          0          1
-------------+---------------------------------------------------------
dummy_acc_~s |      1,145    .5606987    .4965189          0          1
dummy_reva~s |        437    .8855835    .3186813          0          1
dummy_trus~e |        997    .1975928    .3983831          0          1
dummy_lawy~s |      1,290    .4860465    .4999991          0          1
  dummy_euro |      1,482    .1558704    .3628549          0          1
-------------+---------------------------------------------------------
 dummy_pound |      1,482    .0161943    .1262649          0          1
         bbb |      1,223    .1357318    .3426437          0          1
dummy_usdo~r |      1,482    .6437247    .4790596          0          1
chenge_rat~p |      1,098    .1830601     .386892          0          1
 ny_highrate |      1,223    .7031889    .4570395          0          1
-------------+---------------------------------------------------------
english_hi~e |      1,223    .3843009    .4866286          0          1
dummy_acce~s |      1,146     .582897    .4932955          0          1
   highrate2 |      1,223    .6140638    .4870148          0          1
issuerccha~e |      1,084    .1383764     .345454          0          1
   ibcchange |      1,031    .2560621    .4366683          0          1
-------------+---------------------------------------------------------
 trend_icibc |      1,028    .2266537    .4188705          0          1
num_lawyers2 |      1,484    1.286388     .680766          0          2
      var168 |      1,484    .4548518    .4981253          0          1
 ratingorder |          0
ratingorde~m |      1,223    3.422731    1.646911          1          6
-------------+---------------------------------------------------------
   rep_ic_al |      1,475    .3152542    .4647746          0          1
  rep_ibc_al |      1,248    .3253205    .4686823          0          1
 rep_ic_size |      1,487     .135844    .3427381          0          1
rep_ic_size2 |      1,487    .2279758     .419668          0          1
rep_ibc_size |      1,487    .1533289    .3604254          0          1
-------------+---------------------------------------------------------
rep_ibc_s~e2 |      1,487    .4263618    .4947141          0          1
 rep_ib_size |      1,487    .1008742    .3012634          0          1
rep_ib_size2 |      1,487    .2508406    .4336428          0          1
rep_ic_siz~y |      1,487     .135844    .3427381          0          1
rep_ic_si~y2 |      1,487    .2279758     .419668          0          1
-------------+---------------------------------------------------------
rep_ibc_si~y |      1,487    .1533289    .3604254          0          1
rep_ibc_s~y2 |      1,487    .1533289    .3604254          0          1
rep_ib_siz~y |      1,487    .0840619    .2775739          0          1
rep_ib_si~y2 |      1,487    .1849361    .3883763          0          1
rep_ic_siz~g |      1,487     .135844    .3427381          0          1
-------------+---------------------------------------------------------
rep_ic_si~g2 |      1,487    .2205783    .4147761          0          1
rep_ibc_si~g |      1,487     .138534    .3455758          0          1
rep_ibc_s~g2 |      1,487     .273033    .4456675          0          1
rep_ib_siz~g |      1,487    .1008742    .3012634          0          1
rep_ib_si~g2 |      1,487    .2441157    .4297062          0          1
-------------+---------------------------------------------------------
 hh_index_ic |      1,487    .2088245    .1857226          0       .421
hh_ind~ic_ny |        742    .1406065    .1190531          0       .286
hh_in~ic_eng |        730    .3039159    .3053386          0      .6292
hh_index_ibc |      1,487    .0759352    .0611311          0      .1533
hh_ind~bc_ny |        766    .1001756    .1210895          0      .3129
-------------+---------------------------------------------------------
hh_in~bc_eng |        768    .1622112    .1407885          0      .3303
 hh_index_ib |      1,485    .0409204    .0322552          0      .1009
hh_inde~b_ny |        593    .0674417    .0457237          0      .1457
hh_ind~b_eng |        589    .0365338    .0318177          0      .0923
multilogit~s |      1,238    1.868336    1.124267          1          4
-------------+---------------------------------------------------------
     spread1 |        509     1.10183     3.93756      -7.23      50.93
     spread2 |        117    2.036115    2.058739      -4.69      6.365
     spread3 |        115    3.135913    2.362179      -4.66       7.89
     spread4 |        160    2.857497    1.674989      -.975      10.15
changeibank2 |      1,245    .3437751     .475158          0          1
-------------+---------------------------------------------------------
      var206 |      1,487     .137189    .3441625          0          1
      var207 |      1,487    .0302623    .1713657          0          1
      var208 |      1,487    .4169469    .4932198          0          1
      var209 |      1,487    .4149294    .4928756          0          1
 rep_ic_top2 |      1,290    .2627907    .4403204          0          1
-------------+---------------------------------------------------------
rep_ic_~2_ny |      1,290    .2627907    .4403204          0          1
rep_ic~2_eng |      1,290    .1790698    .3835594          0          1
rep_ibc_top2 |      1,243    .3443282      .47534          0          1
rep_ibc~2_ny |      1,243    .2365245    .4251189          0          1
rep_ib~2_eng |      1,243    .3266291    .4691691          0          1
-------------+---------------------------------------------------------
 rep_ic_top5 |      1,290    .3767442    .4847578          0          1
rep_ic_~5_ny |      1,290    .3689922     .482719          0          1
rep_ic~5_eng |      1,290    .3325581    .4713124          0          1
rep_ibc_top5 |      1,243    .6572808    .4748096          0          1
rep_ibc~5_ny |      1,243     .383749    .4864937          0          1
-------------+---------------------------------------------------------
rep_ib~5_eng |      1,243     .460177    .4986122          0          1
 all_two_rep |        617    4.797407    1.019036          4          7
all_one_zero |        867    1.893887    .5708848          1          3
all_option~p |      1,484    3.101078    1.634267          1          7
  ny_two_rep |        617    4.797407    1.019036          4          7
-------------+---------------------------------------------------------
 ny_one_zero |        867    1.893887    .5708848          1          3
ny_options~p |      1,484    3.101078    1.634267          1          7
 eng_two_rep |        617    4.705024    .9937421          4          7
eng_one_zero |        867    1.934256     .610959          1          3
eng_option~p |      1,484    3.086253    1.579317          1          7
-------------+---------------------------------------------------------
cleary_sc_~l |      1,487    .0295898    .1695097          0          1
cleary_sc_ny |      1,487    .0295898    .1695097          0          1
cleary_sc_~g |      1,487    .0195024    .1383289          0          1
      _merge |      1,487           3           0          3          3

. 
. *(c)
. *Este segundo grupo de variables se refieren a características del país de emi
> sión más que a cualidades individuales del bono.
. * En la sigueinte tabla podemos ver los valores de las nuevas variables para c
> ada país emisor.
. 
. tabstat debtserviceexports gdpgrowth ratioofshorttermdebttototaldebt reservess
> horttermdebt ratioofdomesticcredittogdp ratioofreservesimports debtrescheduled
> inpreviousyear ratioofreservesgdp standarddeviationofexportgrowth2, s(mean cou
> nt) by(issuer)

Summary statistics: mean, N
  by categories of: issuer (issuer)

          issuer |  debtse~s  gdpgro~h  ratioo~t  reserv~t  rat~ogdp  ratioo~s
-----------------+------------------------------------------------------------
       Abu Dhabi |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
         Albania |   1.38661  .0149575    6.8287   11.7481     19.95   15.3179
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
       Argentina |  36.69844  .0061344  17.75355  101.9345  28.32885  47.71438
                 |        52        52        52        52        52        52
-----------------+------------------------------------------------------------
           Aruba |         0         .         0         0         0   7.35053
                 |         2         0         2         2         2         2
-----------------+------------------------------------------------------------
       Australia |         0  .0076002         0         0  50.31333  27.52561
                 |        15        15        15        15        15        15
-----------------+------------------------------------------------------------
         Austria |         0  .0062788         0         0   122.444  17.03686
                 |        20        25        20        25        25        25
-----------------+------------------------------------------------------------
         Bahamas |         0  -.001287         0         0     41.55   13.8507
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
         Bahrain |         0   .013721         0         0     22.35   11.5578
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
        Barbados |         0  .0027313         0         0  85.08571  25.09277
                 |         6         7         6         7         7         7
-----------------+------------------------------------------------------------
         Belarus |         0   .017694         0         0         0         0
                 |         2         3         2         2         3         3
-----------------+------------------------------------------------------------
   Belgian Congo |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
         Belgium |         0  .0043703         0         0   90.9069  .8604488
                 |        58        58        58        58        58        58
-----------------+------------------------------------------------------------
          Belize |  40.00478   .012296    3.8612  36.99121     57.76  13.59482
                 |         5         5         5         5         5         5
-----------------+------------------------------------------------------------
          Bosnia |         0         .         0         0      62.3         0
                 |         2         0         2         2         2         2
-----------------+------------------------------------------------------------
        Botswana |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
          Brazil |  41.36221  .0093058  10.80667  41.60361   61.2225  47.68604
                 |        40        40        40        40        40        40
-----------------+------------------------------------------------------------
        Bulgaria |  16.61572  .0111234  15.13842  37.04074     22.44  49.36374
                 |         5         5         5         5         5         5
-----------------+------------------------------------------------------------
          Canada |         0  -.001974         0         0  30.93333  8.530333
                 |         3         3         3         3         3         3
-----------------+------------------------------------------------------------
           Chile |  25.12121  .0069786  13.07464  34.34128     77.26  52.20108
                 |        10        10        10        10        10        10
-----------------+------------------------------------------------------------
           China |  7.366654  .0232906  29.69285  22.24189  112.2857  76.62771
                 |        14        14        14        14        14        14
-----------------+------------------------------------------------------------
        Colombia |  35.23637  .0074744  12.63066   39.6558     34.32   47.1673
                 |        25        25        25        25        25        25
-----------------+------------------------------------------------------------
           Congo |   13.3399  -.036165   18.8867   16584.6      21.1   .328324
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
      Costa Rica |  12.61245  .0108294  22.88348  78.82427  35.43333  19.00452
                 |         9         9         9         9         9         9
-----------------+------------------------------------------------------------
         Croatia |         0  .0058486         0         0  43.93333  31.91367
                 |        15        18        15        16        18        18
-----------------+------------------------------------------------------------
            Cuba |         0         .         0         0         .         0
                 |         3         0         3         3         0         3
-----------------+------------------------------------------------------------
          Cyprus |         0  .0049862         0         0    104.25  15.99784
                 |         9        12         9        10        12        12
-----------------+------------------------------------------------------------
           Czech |         0  2.60e-19         0         0     51.13  25.72451
                 |        10        10        10        10        10        10
-----------------+------------------------------------------------------------
         Denmark |         0 -.0026095         0         0  136.1783  30.84054
                 |        23        23        23        23        23        23
-----------------+------------------------------------------------------------
Dominican Republ |  7.612784  .0140014  14.23286  129.8306     28.84  7.736496
                 |         5         5         5         5         5         5
-----------------+------------------------------------------------------------
           Dubai |         0  .0106753         0         0  8.466667         0
                 |         2         6         2         5         6         5
-----------------+------------------------------------------------------------
         Ecuador |  33.05113   .011444    7.3177  71.74457  29.16667  17.44753
                 |         3         3         3         3         3         3
-----------------+------------------------------------------------------------
           Egypt |  5.756164  .0119068    4.4479   7.88023     54.66  36.42294
                 |         5         5         5         5         5         5
-----------------+------------------------------------------------------------
     El Salvador |   15.3587  .0048305  23.34294  76.19003  40.64545  25.75204
                 |        10        11        10        10        11        11
-----------------+------------------------------------------------------------
         Estonia |         0   .019102         0         0      43.8   15.9744
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
European Coal an |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
European Economi |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
European Investm |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
            Fiji |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
         Finland |         0  .0011304         0         0  64.32034  17.22413
                 |        57        59        57        57        59        59
-----------------+------------------------------------------------------------
          France |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
           Gabon |   36.7966   .013527    7.7629   17.8407      2.89         0
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
         Georgia |   4.93415  .0212255   10.3636   17.2934      15.8   10.6918
                 |         1         2         1         1         2         2
-----------------+------------------------------------------------------------
         Germany |         0  -.004842         0         0       134  10.75183
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
           Ghana |    2.8729   .015645   28.3302         0      22.9         0
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
          Greece |         0  .0055504         0         0   92.6875  19.33376
                 |        48        48        48        48        48        48
-----------------+------------------------------------------------------------
         Grenada |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
       Guatemala |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
       Hong Kong |         0   .020318         0         0       147   35.4286
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
         Hungary |         0  .0078159         0         0  37.46154  16.32929
                 |         8        13         8         9        13        13
-----------------+------------------------------------------------------------
         Iceland |         0  .0059282         0         0      78.1  14.86128
                 |        27        30        27        29        30        30
-----------------+------------------------------------------------------------
       Indonesia |  20.94651  .0133427  14.46786  69.71062     34.65  29.23012
                 |        10        10        10        10        10        10
-----------------+------------------------------------------------------------
            Iran |         0   .017976   23.8759         0      34.5         0
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
            Iraq |         0  -.001828         0         0     -1.49   38.9776
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
         Ireland |         0  .0095148         0         0  80.47917   12.6033
                 |        17        24        17        24        24        24
-----------------+------------------------------------------------------------
          Israel |         0  .0113426         0         0  82.55556  38.69877
                 |         9         9         9         9         9         9
-----------------+------------------------------------------------------------
           Italy |         0  .0029012         0         0  104.8867  14.40876
                 |        45        45        45        45        45        45
-----------------+------------------------------------------------------------
         Jamaica |  20.44167  .0024218  15.23176  63.00963  50.91053  24.60284
                 |        18        19        18        18        19        19
-----------------+------------------------------------------------------------
           Japan |         0  .0065594         0         0    249.25  68.07057
                 |        15        16        15        15        16        16
-----------------+------------------------------------------------------------
          Jordan |         0   .007634         0         0         0         0
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
      Kazakhstan |  14.31089  .0095527  7.952967  24.25757       8.9  23.59027
                 |         3         3         3         3         3         3
-----------------+------------------------------------------------------------
           Korea |         0  .0048763         0         0  66.47273  44.41093
                 |        11        11        11        11        11        11
-----------------+------------------------------------------------------------
          Latvia |         0  .0090514         0         0  29.57143  17.71484
                 |         3         7         3         5         7         7
-----------------+------------------------------------------------------------
         Lebanon |  2.264938  .0102608  23.05824  19.69239  107.3048  8.175462
                 |        21        21        21        19        21        21
-----------------+------------------------------------------------------------
       Lithuania |  18.48522 -.0002546  20.17126   79.6762      31.2  20.15386
                 |        20        19        20        18        20        20
-----------------+------------------------------------------------------------
      Luxembourg |         0  .0059615         0         0        92   .069097
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
       Macedonia |   12.5659  .0041935  30.45725  71.34425        32   36.4919
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
        Malaysia |   13.8925  .0120377  13.26455  29.37087  126.1333  30.68362
                 |        15        15        15        15        15        15
-----------------+------------------------------------------------------------
       Mauritius |   8.73671   .010874     .0816   .130188      66.1   35.1984
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
          Mexico |  25.57735  .0077734   14.4119  137.5342  35.89615  17.67557
                 |        51        52        51        51        52        52
-----------------+------------------------------------------------------------
      Micronesia |         0         .         0         0         0         0
                 |         1         0         1         1         1         1
-----------------+------------------------------------------------------------
         Moldova |  15.08988  .0018285   15.1528  95.17634     26.25   21.9105
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
        Mongolia |   2.65752   .021316    5.8925   16.4464      33.8   16.5909
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
      Montenegro |         0   .003794         0         0         0         0
                 |         1         2         1         1         2         2
-----------------+------------------------------------------------------------
         Morocco |  18.19505  .0077655   6.26545  12.75242    58.775  48.95975
                 |         4         4         4         4         4         4
-----------------+------------------------------------------------------------
     Netherlands |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
     New Zealand |         0  .0072098         0         0  59.34118   23.7241
                 |        17        17        17        17        17        17
-----------------+------------------------------------------------------------
         Nigeria |         .   .016613         .         .         0         0
                 |         0         1         0         0         1         1
-----------------+------------------------------------------------------------
          Norway |         0  .0072754         0         0  60.78571  27.57691
                 |         7         7         7         7         7         7
-----------------+------------------------------------------------------------
            Oman |         0   .014973         0         0      33.3   30.8023
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
        Pakistan |  25.40157  .0107951  5.699314  53.55933  48.31429  28.04204
                 |         7         7         7         7         7         7
-----------------+------------------------------------------------------------
          Panama |  11.03526  .0143452  3.912475  31.38215     70.05  9.203427
                 |        20        20        20        20        20        20
-----------------+------------------------------------------------------------
            Peru |  24.16582  .0118652   12.8548   23.2686  19.11111  79.03858
                 |         9         9         9         9         9         9
-----------------+------------------------------------------------------------
     Philippines |  16.83094  .0120508  8.452613  33.52178  43.24333   29.6765
                 |        30        30        30        30        30        30
-----------------+------------------------------------------------------------
          Poland |         0  .0082649         0         0  33.76429    32.772
                 |        18        28        18        26        28        28
-----------------+------------------------------------------------------------
        Portugal |         0  .0058842         0         0  94.50667  46.37781
                 |        45        45        45        45        45        45
-----------------+------------------------------------------------------------
           Qatar |         0  .0204286         0         0  69.35714         .
                 |         7         7         7         7         7         0
-----------------+------------------------------------------------------------
        Rhodesia |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
         Romania |  17.00138   .010115  10.25457  26.56075     17.35   27.4775
                 |         6         6         6         6         6         6
-----------------+------------------------------------------------------------
          Russia |  9.108476   .001389  8.261019  61.01123  28.34706  31.53491
                 |        16        17        16        16        17        17
-----------------+------------------------------------------------------------
         Senegal |         0  .0081565     .2571   .848283      13.3         0
                 |         2         2         2         1         2         2
-----------------+------------------------------------------------------------
          Serbia |         0   .013648   14.0603   38.3742      29.1         0
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
      Seychelles |  13.55567   .013304  56.39403  984.1773  73.46667  10.11479
                 |         3         3         3         3         3         3
-----------------+------------------------------------------------------------
        Slovakia |         0  .0062135         0         0      38.2  25.07318
                 |         7         8         7         8         8         8
-----------------+------------------------------------------------------------
        Slovenia |         0  .0118613         0         0  32.03525  23.53174
                 |         4         4         4         4         4         4
-----------------+------------------------------------------------------------
    South Africa |  7.824588  .0059105  29.07282  138.2508     133.6  17.27219
                 |        19        19        19        19        19        19
-----------------+------------------------------------------------------------
           Spain |         0  .0034912         0         0  128.7429  22.47826
                 |        14        14        14        14        14        14
-----------------+------------------------------------------------------------
       Sri Lanka |  8.867345   .015854   8.62535   34.8891      40.9  27.57535
                 |         2         2         2         2         2         2
-----------------+------------------------------------------------------------
          Sweden |         0  .0050297         0         0  113.6689  17.93741
                 |        45        45        45        45        45        45
-----------------+------------------------------------------------------------
        Thailand |  14.30429  .0176357  31.53298  68.71857  118.9667  38.15755
                 |         6         6         6         6         6         6
-----------------+------------------------------------------------------------
Trinidad &Tobago |         0  .0065352         0         0   49.0625  29.89033
                 |         5         8         5         8         8         8
-----------------+------------------------------------------------------------
         Tunisie |         .         .         .         .         .         .
                 |         0         0         0         0         0         0
-----------------+------------------------------------------------------------
          Turkey |  31.63439  .0101179  16.93916  75.94734    35.786  32.50856
                 |        49        50        49        49        50        50
-----------------+------------------------------------------------------------
         Ukraine |  14.62337  .0205597  35.69139  131.4137   39.7625  29.25271
                 |         8         8         8         8         8         8
-----------------+------------------------------------------------------------
  United Kingdom |         0  .0054864         0         0  124.1286  8.498173
                 |         7         7         7         7         7         7
-----------------+------------------------------------------------------------
         Uruguay |  34.11689  .0057958  19.37089  65.50591  44.26538   51.2081
                 |        26        26        26        26        26        26
-----------------+------------------------------------------------------------
       Venezuela |  17.61224  .0090695  18.83936  36.18912  20.65333  72.68585
                 |        30        30        30        30        30        30
-----------------+------------------------------------------------------------
         Vietnam |   2.64157   .020261   13.5246   28.4449      71.2   22.1271
                 |         1         1         1         1         1         1
-----------------+------------------------------------------------------------
           Total |  11.05489  .0070874  7.830423  46.93405  68.42651  27.73291
                 |      1177      1229      1177      1207      1235      1230
------------------------------------------------------------------------------

          issuer |  debtre~r  rat~sgdp  standa~2
-----------------+------------------------------
       Abu Dhabi |         .         .         .
                 |         0         0         0
-----------------+------------------------------
         Albania |         0         0  632.9635
                 |         2         1         2
-----------------+------------------------------
       Argentina |  .2692308  6.866737  352.1867
                 |        52        51        52
-----------------+------------------------------
           Aruba |         0         .  1226.275
                 |         2         0         2
-----------------+------------------------------
       Australia |         0   5.41439  109.4373
                 |         2        15        15
-----------------+------------------------------
         Austria |         0   7.46968  187.6217
                 |        16        22        25
-----------------+------------------------------
         Bahamas |         0  8.043115         .
                 |         2         2         0
-----------------+------------------------------
         Bahrain |         0   9.44075         .
                 |         2         2         0
-----------------+------------------------------
        Barbados |         0  15.26302  2025.067
                 |         6         6         7
-----------------+------------------------------
         Belarus |         0         0   132.931
                 |         2         3         2
-----------------+------------------------------
   Belgian Congo |         .         .         .
                 |         0         0         0
-----------------+------------------------------
         Belgium |         0  9.738844  192.0391
                 |        48        58        30
-----------------+------------------------------
          Belize |         0  10.23166  1998.828
                 |         5         5         5
-----------------+------------------------------
          Bosnia |         .         .         .
                 |         0         0         0
-----------------+------------------------------
        Botswana |         .         .         .
                 |         0         0         0
-----------------+------------------------------
          Brazil |        .4  6.829836  175.8426
                 |        40        39        40
-----------------+------------------------------
        Bulgaria |         0  29.54538  100.6059
                 |         5         5         5
-----------------+------------------------------
          Canada |         0  2.688847  63.96247
                 |         3         3         3
-----------------+------------------------------
           Chile |         0  18.97931  186.9901
                 |        10        10        10
-----------------+------------------------------
           China |         0  18.48678         .
                 |        13        14         0
-----------------+------------------------------
        Colombia |       .04  9.284618  171.3032
                 |        25        22        25
-----------------+------------------------------
           Congo |         0   .053074         .
                 |         1         1         0
-----------------+------------------------------
      Costa Rica |         0   9.90611  189.1756
                 |         8         8         9
-----------------+------------------------------
         Croatia |         0  17.59403  401.1481
                 |        16        16        16
-----------------+------------------------------
            Cuba |         0         .         .
                 |         3         0         0
-----------------+------------------------------
          Cyprus |         0  11.46472  484.5016
                 |        10        10        10
-----------------+------------------------------
           Czech |         0   19.6299         .
                 |        10        10         0
-----------------+------------------------------
         Denmark |         0  15.01645  130.5192
                 |        27        23        23
-----------------+------------------------------
Dominican Republ |        .2   3.45009  245.1408
                 |         5         5         5
-----------------+------------------------------
           Dubai |         .         0         .
                 |         0         2         0
-----------------+------------------------------
         Ecuador |         0   6.77119  50.94067
                 |         3         3         3
-----------------+------------------------------
           Egypt |         0  10.64306   130.255
                 |         5         5         5
-----------------+------------------------------
     El Salvador |         0  11.59701  117.2611
                 |        10        11        10
-----------------+------------------------------
         Estonia |         .   13.6537   111.802
                 |         0         1         1
-----------------+------------------------------
European Coal an |         .         .         .
                 |         0         0         0
-----------------+------------------------------
European Economi |         .         .         .
                 |         0         0         0
-----------------+------------------------------
European Investm |         .         .         .
                 |         0         0         0
-----------------+------------------------------
            Fiji |         .         .         .
                 |         0         0         0
-----------------+------------------------------
         Finland |         0  5.477003  175.2245
                 |        45        59        57
-----------------+------------------------------
          France |         .         .         .
                 |         0         0         0
-----------------+------------------------------
           Gabon |         0   10.7183         .
                 |         1         1         0
-----------------+------------------------------
         Georgia |         1     6.651   463.496
                 |         1         2         1
-----------------+------------------------------
         Germany |         0  4.506545  68.95035
                 |         2         2         2
-----------------+------------------------------
           Ghana |         0         0         .
                 |         1         1         0
-----------------+------------------------------
          Greece |         0  5.302892  528.1214
                 |        42        48        48
-----------------+------------------------------
         Grenada |         .         .         .
                 |         0         0         0
-----------------+------------------------------
       Guatemala |         .         .         .
                 |         0         0         0
-----------------+------------------------------
       Hong Kong |         .   74.7501         .
                 |         0         2         0
-----------------+------------------------------
         Hungary |         0    12.697  372.8634
                 |         7        12         9
-----------------+------------------------------
         Iceland |         0  6.358136  547.9493
                 |        22        27        29
-----------------+------------------------------
       Indonesia |         0  8.916457  212.9272
                 |         7        10        10
-----------------+------------------------------
            Iran |         0         0         .
                 |         2         2         0
-----------------+------------------------------
            Iraq |         .   38.8708         .
                 |         0         1         0
-----------------+------------------------------
         Ireland |         0  8.699993  176.9182
                 |        12        20        24
-----------------+------------------------------
          Israel |         0  18.08401  246.8108
                 |         9         9         9
-----------------+------------------------------
           Italy |         0  4.251682  389.9217
                 |        45        45        45
-----------------+------------------------------
         Jamaica |         0  15.19028  297.0218
                 |        18        19        18
-----------------+------------------------------
           Japan |         0  7.726111  137.2643
                 |        15        16        15
-----------------+------------------------------
          Jordan |         0         0   156.423
                 |         1         1         1
-----------------+------------------------------
      Kazakhstan |  .3333333  10.30144  293.9073
                 |         3         3         3
-----------------+------------------------------
           Korea |         0  17.78175  94.62114
                 |        11        11        11
-----------------+------------------------------
          Latvia |         0   14.9422  82.12988
                 |         3         3         5
-----------------+------------------------------
         Lebanon |         0  42.93808  371.2382
                 |        21        13        19
-----------------+------------------------------
       Lithuania |         0  13.47027  105.5733
                 |        20        18        18
-----------------+------------------------------
      Luxembourg |         0  .3411155   199.719
                 |         2         2         2
-----------------+------------------------------
       Macedonia |         0   23.4799         .
                 |         2         1         0
-----------------+------------------------------
        Malaysia |         0  25.87087   111.864
                 |         9        15        15
-----------------+------------------------------
       Mauritius |         0   20.7195         .
                 |         1         1         0
-----------------+------------------------------
          Mexico |       .22  5.494653  101.7123
                 |        50        39        51
-----------------+------------------------------
      Micronesia |         .         .         .
                 |         0         0         0
-----------------+------------------------------
         Moldova |         0   17.3016         .
                 |         2         2         0
-----------------+------------------------------
        Mongolia |         0   11.7175   643.865
                 |         1         1         1
-----------------+------------------------------
      Montenegro |         0         0         .
                 |         1         2         0
-----------------+------------------------------
         Morocco |         0  18.98988   206.719
                 |         4         4         4
-----------------+------------------------------
     Netherlands |         .         .         .
                 |         0         0         0
-----------------+------------------------------
     New Zealand |         0  9.196386  203.5473
                 |         8        17        17
-----------------+------------------------------
         Nigeria |         .         0         .
                 |         0         1         0
-----------------+------------------------------
          Norway |         0  9.995407  149.2733
                 |         6         7         7
-----------------+------------------------------
            Oman |         0   13.5749   114.743
                 |         1         1         1
-----------------+------------------------------
        Pakistan |  .1428571  8.450915   186.791
                 |         7         2         7
-----------------+------------------------------
          Panama |        .2  7.976021  401.5398
                 |        20        19        20
-----------------+------------------------------
            Peru |  .1111111  20.38736  140.1771
                 |         9         9         9
-----------------+------------------------------
     Philippines |  .0333333  16.36614  880.1077
                 |        30        30        30
-----------------+------------------------------
          Poland |         0  12.22575  97.31955
                 |        18        24        26
-----------------+------------------------------
        Portugal |         0  17.34809  501.1333
                 |        38        45        45
-----------------+------------------------------
           Qatar |         0  16.10215         .
                 |         7         7         0
-----------------+------------------------------
        Rhodesia |         .         .         .
                 |         0         0         0
-----------------+------------------------------
         Romania |         0  12.05151  123.4521
                 |         6         6         6
-----------------+------------------------------
          Russia |      .375   8.69465  131.2896
                 |        16        17        16
-----------------+------------------------------
         Senegal |         0   16.5767         .
                 |         2         1         0
-----------------+------------------------------
          Serbia |         1   23.1434         .
                 |         2         2         0
-----------------+------------------------------
      Seychelles |  .3333333  13.10602         .
                 |         3         3         0
-----------------+------------------------------
        Slovakia |         0   20.3366  105.9387
                 |         7         8         8
-----------------+------------------------------
        Slovenia |         0  13.52251  238.2117
                 |         4         4         4
-----------------+------------------------------
    South Africa |         0  5.110823   246.526
                 |        18        19        19
-----------------+------------------------------
           Spain |         0  5.532678  351.1706
                 |        11        14        14
-----------------+------------------------------
       Sri Lanka |         0   11.9762   365.916
                 |         2         2         2
-----------------+------------------------------
          Sweden |         0  7.809087  162.6344
                 |        41        45        45
-----------------+------------------------------
        Thailand |         0  19.44796  127.1586
                 |         5         5         6
-----------------+------------------------------
Trinidad &Tobago |         0  14.99368  1654.208
                 |         5         5         8
-----------------+------------------------------
         Tunisie |         .         .         .
                 |         0         0         0
-----------------+------------------------------
          Turkey |         0  8.245301  210.0628
                 |        49        50        49
-----------------+------------------------------
         Ukraine |      .625  16.99651  83.08373
                 |         8         5         8
-----------------+------------------------------
  United Kingdom |         0  3.189687  25.62916
                 |         6         7         7
-----------------+------------------------------
         Uruguay |  .0384615  13.26349  164.5756
                 |        26        26        26
-----------------+------------------------------
       Venezuela |  .0689655  18.76689         .
                 |        29        29         0
-----------------+------------------------------
         Vietnam |         0   17.0977    289.66
                 |         1         1         1
-----------------+------------------------------
           Total |  .0640074  10.91103  294.8625
                 |      1078      1156      1083
------------------------------------------------

. 
. *La observación principal es que Argentina, Finlandia, Grecia, Portugal, Sueci
> aia, Turquía han emitido más de 45 bonos. Asimismo, a primera vista no se pudo
>  encontrar características en común de este grupo de países. Esperemos que con
>  un análisis gráfico las características séan más evidentes.
. save bonos_ej2
file bonos_ej2.dta saved

. 
. *III
. *Parece que existen dos grupos. Los bonos con madurez menor a 10 años presenta
> n una menor varianza en el spread. Por el contrario, la varianza aumenta a par
> tir de mayor años de madurez.
. 
. *En cuanto a lo legal, podemos observaro que existe una correlación entre el s
> pread promedio y la cantidad de firmas de abogados.
. graph bar (mean) spread, over(num_lawyers2) ytitle("Spread ") title("Spread pr
> omedio por cantidad de firmas de abogados")

. 
. * En cambio si analisamos por la ley aplicable en caso de default, podemos obs
> ervar que el spread promedio en España y en Gales es muy alto (aunque recordem
> os que son pocos Bonos. Por el contrario, el spread promedio en los casos de N
> Y y English (las leyes que contemplán la mayoría de los bonos) está alrededor 
> del 2.
. 
. graph hbar (mean) spread, over(law, sort(1) descending) ytitle("Spread promedi
> o") title( "Spread promedio por ley aplicable en caso de default", span pos(11
> ))

. 
. *Finalmente, solo para dimensionar si hay un efecto temporal, puedo analizar e
> l impacto de los años de madurez del bono en el spread.
. *Para eso descargo el paquete xtgraph y defino a la variable years en el eje x
>  y al spread en el eje y.
. ssc install xtgraph
checking xtgraph consistency and verifying not already installed...
all files already exist and are up to date.

. tis years

. iis spread

. xtgraph spread

. 
. *En conclusión, el spread tiene una correlación positiva entre el número de fi
> rmas de abogados así como con el tiempo de madurez. Asimismo, la mayoría de lo
> s bonos, que están sujetos a la jurisdicción estadounidense y de Inglaterra en
>  promedio cuentan con un spread alrededor del 2, el cual es un nivel medio.
. 
. *IV
. 
. *(a)
. *Agregamos las variables num_lawyers_2 y num_lawyers_0. Sin embargo hay que te
> ner cuidado con los missing values pues de estos no tenemos certeza del valor 
> real de su variable num_lawyers2. Aunque solo son 3 de acuerdo a la informació
> n que muestra el comando tabulate, vale la pena clasificarlos con cuidado.
. tabulate num_lawyers2

num_lawyers |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        192       12.94       12.94
          1 |        675       45.49       58.42
          2 |        617       41.58      100.00
------------+-----------------------------------
      Total |      1,484      100.00

. *Por ello, definimos num_lawyers_2 como una variable que obtiene valor 1, 0 o 
> . de acuerdo a si cumple las condiciones necesarias. En este sentido es una co
> ndición de 3 niveles, el primero para determinar si tiene valor 1, el segundo 
> para determinar si tiene valor 0 y el tercero para indicar que es un missing v
> alue.
. 
. gen num_lawyers_2 = cond(num_lawyers2 == 2, 1, cond(num_lawyers2 == 1,0,cond(n
> um_lawyers2 == 0,0,.)))
(3 missing values generated)

. *Realizamos un ejercicio similar para la variable num_lawyers_0.
. 
. gen num_lawyers_0 = cond(num_lawyers2 == 0, 1,cond(num_lawyers2 == 1,0,cond(nu
> m_lawyers2 == 2,0,.)))
(3 missing values generated)

. 
. *Asimismo, remmplazamos los valores en rep_ic_size que cumplan la condición. A
> unque en realidad 0 valores cambiaron.
. replace rep_ic_size=0 if num_lawyers2 == 0
(0 real changes made)

. *Guardamos nuestros cambios
. save ej4
file ej4.dta saved

. 
. *(b)
. *Corremos las siguientes regresiones
. ssc install estout, replace
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. 
. *De esta manera, en ambas sabemos que el modelo base es aquel con num_lawyers2
> =1.
. regress spread aaa aa a bb b num_lawyers_2 num_lawyers_0

      Source |       SS           df       MS      Number of obs   =       986
-------------+----------------------------------   F(7, 978)       =     50.60
       Model |  2748.83497         7   392.69071   Prob > F        =    0.0000
    Residual |  7589.32321       978  7.76004418   R-squared       =    0.2659
-------------+----------------------------------   Adj R-squared   =    0.2606
       Total |  10338.1582       985  10.4955921   Root MSE        =    2.7857

-------------------------------------------------------------------------------
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
          aaa |  -1.551512   .3646972    -4.25   0.000    -2.267191   -.8358334
           aa |  -1.748382   .3376684    -5.18   0.000     -2.41102   -1.085744
            a |  -.9075333   .3371812    -2.69   0.007    -1.569215   -.2458515
           bb |     1.6477   .2928458     5.63   0.000     1.073021    2.222378
            b |   2.156469   .3420882     6.30   0.000     1.485158    2.827781
num_lawyers_2 |   .1111305   .2448905     0.45   0.650    -.3694407    .5917017
num_lawyers_0 |  -1.174545   .2912751    -4.03   0.000    -1.746141   -.6029493
        _cons |   2.027494   .2882679     7.03   0.000     1.461799    2.593189
-------------------------------------------------------------------------------

. eststo MODEL4A

. regress spread num_lawyers_2 num_lawyers_0

      Source |       SS           df       MS      Number of obs   =     1,072
-------------+----------------------------------   F(2, 1069)      =     76.61
       Model |  1386.34387         2  693.171936   Prob > F        =    0.0000
    Residual |  9672.86156     1,069  9.04851408   R-squared       =    0.1254
-------------+----------------------------------   Adj R-squared   =    0.1237
       Total |  11059.2054     1,071  10.3260555   Root MSE        =    3.0081

-------------------------------------------------------------------------------
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
num_lawyers_2 |   1.923156   .2007283     9.58   0.000      1.52929    2.317023
num_lawyers_0 |  -.9624497   .2901207    -3.32   0.001     -1.53172    -.393179
        _cons |      1.135    .153107     7.41   0.000     .8345757    1.435424
-------------------------------------------------------------------------------

. eststo MODEL4B

. esttab

--------------------------------------------
                      (1)             (2)   
                   spread          spread   
--------------------------------------------
aaa                -1.552***                
                  (-4.25)                   

aa                 -1.748***                
                  (-5.18)                   

a                  -0.908**                 
                  (-2.69)                   

bb                  1.648***                
                   (5.63)                   

b                   2.156***                
                   (6.30)                   

num_lawye~_2        0.111           1.923***
                   (0.45)          (9.58)   

num_lawyer~0       -1.175***       -0.962***
                  (-4.03)         (-3.32)   

_cons               2.027***        1.135***
                   (7.03)          (7.41)   
--------------------------------------------
N                     986            1072   
--------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. *(c y d)
. *En esta sección analizaremos los modelos, mostraremos los resultados y haremo
> s conclusiones pero de uno por uno.
. *En primer lugar, aplicamos las pruebas de linealidad para la primera regresió
> n, el MODEL4A.
. regress spread aaa aa a bb b num_lawyers_2 num_lawyers_0

      Source |       SS           df       MS      Number of obs   =       986
-------------+----------------------------------   F(7, 978)       =     50.60
       Model |  2748.83497         7   392.69071   Prob > F        =    0.0000
    Residual |  7589.32321       978  7.76004418   R-squared       =    0.2659
-------------+----------------------------------   Adj R-squared   =    0.2606
       Total |  10338.1582       985  10.4955921   Root MSE        =    2.7857

-------------------------------------------------------------------------------
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
          aaa |  -1.551512   .3646972    -4.25   0.000    -2.267191   -.8358334
           aa |  -1.748382   .3376684    -5.18   0.000     -2.41102   -1.085744
            a |  -.9075333   .3371812    -2.69   0.007    -1.569215   -.2458515
           bb |     1.6477   .2928458     5.63   0.000     1.073021    2.222378
            b |   2.156469   .3420882     6.30   0.000     1.485158    2.827781
num_lawyers_2 |   .1111305   .2448905     0.45   0.650    -.3694407    .5917017
num_lawyers_0 |  -1.174545   .2912751    -4.03   0.000    -1.746141   -.6029493
        _cons |   2.027494   .2882679     7.03   0.000     1.461799    2.593189
-------------------------------------------------------------------------------

. graph matrix spread aaa aa a bb b num_lawyers_2 num_lawyers_0

. acprplot aaa, lowess
aaa^2 is collinear with aaa

. acprplot aa, lowess
aa^2 is collinear with aa

. acprplot aa, lowess
aa^2 is collinear with aa

. acprplot bb, lowess
bb^2 is collinear with bb

. acprplot b, lowess
b^2 is collinear with b

. acprplot num_lawyers_2, lowess
num_lawyers_2^2 is collinear with num_lawyers_2

. acprplot num_lawyers_0, lowess
num_lawyers_0^2 is collinear with num_lawyers_0

. *Parece que las relaciones son lineales.
. *En segundo lugar, realizamos la prueba Breusch-Pagan de heterocedasticidad y 
> observamos los errores en una gráfica
. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of spread

         chi2(1)      =   158.96
         Prob > chi2  =   0.0000

. rvfplot

. *De acuerdo a la prueba rechazo h0, es decir rechazo que los errores sean homo
> cedasticos con más de un 99% de confianza. Sin embargo de acuerdo a la gráfica
> , en realidad se debe a que tenemos outliers que está aumentando la varianza d
> el error en una sección específica. Más adelante controlaremos por eso.
. 
. *En tercer lugar, realizó las pruebas de variable omitida.
. ovtest

Ramsey RESET test using powers of the fitted values of spread
       Ho:  model has no omitted variables
                 F(3, 975) =      4.24
                  Prob > F =      0.0055

. *De acuerdo al test Ramsey Reset, el p value es muy pequeño por lo que rechazo
>  H0 con más del 99% de confianza, es decir rechazo que no hayamos omitido una 
> variable.
. *En cuarto lugar, realizamos una prueba para detectar error de especificación.
>  Para eso usamos el comando linktest y vemos si el valor de p de _hatsq es est
> adísticamente significativo. 
. linktest

      Source |       SS           df       MS      Number of obs   =       986
-------------+----------------------------------   F(2, 983)       =    178.08
       Model |  2749.51347         2  1374.75673   Prob > F        =    0.0000
    Residual |  7588.64471       983  7.71988272   R-squared       =    0.2660
-------------+----------------------------------   Adj R-squared   =    0.2645
       Total |  10338.1582       985  10.4955921   Root MSE        =    2.7785

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |   .9505274   .1750893     5.43   0.000     .6069357    1.294119
      _hatsq |    .012432   .0419346     0.30   0.767    -.0698596    .0947236
       _cons |   .0145529   .1470443     0.10   0.921    -.2740039    .3031096
------------------------------------------------------------------------------

. *Como el p value es de .767 (relativamente alto) rechazamos h0, es decir recha
> zamos que no exista un error de especificación.
. 
. *En quinto lugar, realizamos una prueba de multicolinealidad.
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
          aa |      2.22    0.450980
          bb |      2.16    0.462585
num_lawye~_2 |      1.90    0.525713
         aaa |      1.88    0.530893
           a |      1.71    0.585802
           b |      1.69    0.591418
num_lawyer~0 |      1.21    0.826680
-------------+----------------------
    Mean VIF |      1.82

. *Como podemos observar, ninguna variable tienen un VIF mayor a 10, no hay prob
> lema de multicolinealidad.
. *En sexto lugar, realizamos una prueba gráfica para detectar outliers.
. avplot aaa 

. avplot aa 

. avplot a  

. *Con respecto al rating si podemos notar que existen al menos un outlier con r
> ating ajeno a aaa,aa o a.
. avplot bb

. avplot b

. *Ahora pudimos detectar  que un outlier  tiene un rating bb.
. avplot num_lawyers_2

. avplot num_lawyers_0

. *Finalmente detectamos que los outliers definitivamente no tienen dos ni cero 
> firmas de abogados relacionadas. Por lo que puede tener una firma o pertenecer
>  a el Bono con un missing value en la variable num_lawyers2.
. *Después de buscar por las características encontradas, se descubrió que los o
> utlier tiene un valor mayor o igual 50.9. Esto es muy útil para poder realziar
>  las pruebas otra vez, omitiendo a los outliers.
. *En septimo lugar, realizamos unas pruebas de normalidad. Para ello, hay que d
> eclarar una variable de residuos e.
. predict e, resid
(501 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |        986    0.54223    285.028    13.990    0.00000

. *A pesar de que la grafica emula una distribución centrada en una media, se ap
> recia una distribución leptocúrtica, un poco alejada de una normal. Sin embarg
> o, de la prueba Shaprio-Wilk W obtuvimos un valor p de 0, lo cual indica que  
> rechazamos la hipotesis nula, es decir  rechazamos que los errores se distribu
> yan de manera norma.
. 
. *En conclusión, el model1 aprobó las pruebas de linealidad y resultó no tener 
> multicolinealidad; sin embargo resultó que tiene problemas de variables omitid
> as y de especificación. Asimismo, se encontró que existe un outlier muy extrem
> o que hace que el modelo entero no sea homocedastico. 
. 
. *Sin embargo, si se controla esa variable, no se rechaza  la homocedasticidad,
>  como se muestra a continuación. Asimismo, también no se acepta el error en la
>  especificación pues el _hatsq pasa a ser estadísticamente no significante. Fi
> nalmente, la grafica de distribución de los errores se asemejaría muchísimo má
> s a una normal, aunque seguimos rechazano H0 del test Shapiro-Wilk.
. 
. drop if spread == 50.93
(1 observation deleted)

. drop if spread == 50.9
(1 observation deleted)

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of spread

         chi2(1)      =     0.14
         Prob > chi2  =   0.7105

. linktest

      Source |       SS           df       MS      Number of obs   =       984
-------------+----------------------------------   F(2, 981)       =    384.86
       Model |  2438.20354         2  1219.10177   Prob > F        =    0.0000
    Residual |  3107.46794       981  3.16765336   R-squared       =    0.4397
-------------+----------------------------------   Adj R-squared   =    0.4385
       Total |  5545.67148       983  5.64157831   Root MSE        =    1.7798

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |    .897678   .1121649     8.00   0.000     .6775673    1.117789
      _hatsq |   .0113001   .0268619     0.42   0.674    -.0414132    .0640134
       _cons |    .032486   .0941927     0.34   0.730    -.1523564    .2173283
------------------------------------------------------------------------------

. drop e 

. predict e, resid
(501 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |        984    0.97809     13.618     6.463    0.00000

. *Ahora procedemos a analizar el MODEL4B
. clear

. use ej4

. regress spread num_lawyers_2 num_lawyers_0

      Source |       SS           df       MS      Number of obs   =     1,072
-------------+----------------------------------   F(2, 1069)      =     76.61
       Model |  1386.34387         2  693.171936   Prob > F        =    0.0000
    Residual |  9672.86156     1,069  9.04851408   R-squared       =    0.1254
-------------+----------------------------------   Adj R-squared   =    0.1237
       Total |  11059.2054     1,071  10.3260555   Root MSE        =    3.0081

-------------------------------------------------------------------------------
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
num_lawyers_2 |   1.923156   .2007283     9.58   0.000      1.52929    2.317023
num_lawyers_0 |  -.9624497   .2901207    -3.32   0.001     -1.53172    -.393179
        _cons |      1.135    .153107     7.41   0.000     .8345757    1.435424
-------------------------------------------------------------------------------

. 
. *En primer lugar, aplicamos las pruebas de linealidad.
. graph matrix num_lawyers_2 num_lawyers_0

. acprplot num_lawyers_2, lowess
num_lawyers_2^2 is collinear with num_lawyers_2

. acprplot num_lawyers_0, lowess
num_lawyers_0^2 is collinear with num_lawyers_0

. *Parece que las relaciones son lineales.
. 
. *En segundo lugar, realizamos la prueba Breusch-Pagan de heterocedasticidad y 
> observamos los errores en una gráfica
. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of spread

         chi2(1)      =   115.03
         Prob > chi2  =   0.0000

. rvfplot

. *De acuerdo a la prueba rechazo h0, es decir rechazo que los errores sean homo
> cedasticos con más de un 99% de confianza. Sin embargo de acuerdo a la gráfica
> , en realidad se debe a que tenemos outliers que están aumentando la varianza 
> del error en una sección específica. Por lo que si se omite, el modelo puede s
> er homocedastico con certeza.
. 
. *En tercer lugar, realizó las pruebas de variable omitida.
. *Sin embargo, el comando ovtest no se puede ejecutar debido a que las variable
> s son variables indicadoras (las potencias de y gorro son colineares con las v
> ariables dependientes, lo cuál tiene mucho snetido pues son solo 2 variables d
> ummies.
. 
. *En cuarto lugar, realizamos una prueba para detectar error de especificación.
>  Para eso usamos el comando linktest y vemos si el valor de p de hatsq es esta
> dísticamente significativo. 
. linktest

      Source |       SS           df       MS      Number of obs   =     1,072
-------------+----------------------------------   F(2, 1069)      =     76.61
       Model |  1386.34387         2  693.171936   Prob > F        =    0.0000
    Residual |  9672.86156     1,069  9.04851408   R-squared       =    0.1254
-------------+----------------------------------   Adj R-squared   =    0.1237
       Total |  11059.2054     1,071  10.3260555   Root MSE        =    3.0081

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |          1   .4591146     2.18   0.030      .099132    1.900868
      _hatsq |  -1.70e-08   .1235429    -0.00   1.000    -.2424142    .2424142
       _cons |  -4.98e-09    .311101    -0.00   1.000    -.6104379    .6104379
------------------------------------------------------------------------------

. *Como el p value es de 1 rechazamos h0, es decir rechazamos que no exista un e
> rror de especificación.
. 
. *En quinto lugar, realizamos una prueba de multicolinealidad.
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
num_lawyer~0 |      1.19    0.837966
num_lawye~_2 |      1.19    0.837966
-------------+----------------------
    Mean VIF |      1.19

. *Como podemos observar, ninguna variable tienen un VIF mayor a 10.
. 
. *En sexto lugar, realizamos una prueba gráfica para detectar outliers.
. avplot num_lawyers_2

. avplot num_lawyers_0

. *Detectamos los mismos outliers que en la regresión pasada.  Definitivamente n
> o tienen dos ni cero firmas de abogados relacionadas. Por lo que pueden tener 
> una firma o pertenecer a alguno de los bono con missing value en la variable n
> um_lawyers2.
. *Después de buscar por las características encontradas, se descubrió que los o
> utliers tienen un valor mayor o igual a 50.9 
. *En septimo lugar, realizamos unas pruebas de normalidad. Para ello, hay que d
> eclarar una variable de residuos e.
. predict e, resid
(415 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |      1,072    0.61351    259.692    13.807    0.00000

. *De manera similar al model 1, a pesar de que la grafica emula una distribució
> n centrada en una media, se aprecia una distribución leptocúrtica, un poco ale
> jada de una normal. Asimismo, de la prueba Shaprio-Wilk W obtuvimos un valor p
>  de 0, lo cual indica que rechazamos la hipotesis nula, es decir rechazamos qu
> e los errores se distribuyan de manera norma.
. 
. *En conclusión, esta regresión pasó las pruebas de linealidad sin embargo conc
> luímos que está mal especificado; que no cuenta con homocedasticidad y que los
>  errores no se distribuyen de manera normal. Sin embargo, no presenta multicol
> inealidad y presenta dos outliers con la capacidad de modificar todos los resu
> ltados.
. 
. 
. *Por ejemplo si omitimos a los dos outliers, seguimos rechazando H0 en la prue
> ba de Bresuch Pagan de homocedasticidad aunque ahora con solo el 96% de confia
> nza; además, el p value de _hatsq del comando linktest tendría un valor de .10
> 5 (en lugar de 1) por lo que deja de ser significante y esto indicaría que no 
> hay problema de especifícación. FInalmente, gracias a la omisión de variable, 
> la distribución de errores se asemeja más a una normal.
. drop if spread == 50.93
(1 observation deleted)

. drop if spread == 50.9
(1 observation deleted)

. estat hettest

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of spread

         chi2(1)      =     4.36
         Prob > chi2  =   0.0368

. 
. *En conclusión, la primera regresión parece más completa porque contempla no s
> olo la cantidad de firmas de abogados sino el rating, esto permite al modelo e
> xplicar más la varianza en el spread. De todas maneras,los modelos tienen much
> as deficiencias en cuanto a especificación y omisión de variables. Sin embargo
>  ambos podrían mejorar sustancialmente si omitimos los outliers, pues tendrían
>  errores más homocedasticos y dichos errores tendrían una distribución más par
> ecida a una normal.
. 
. *V 
. *(a,b y c)
. *En esta sección primero se prepararán los datos (a y b) para posteriormente r
> ealizar el análisis similar al del ejercicio anterior para finalmente hacer la
> s conclusiones relevantes (c).
. 
. 
. *Primero adecuo la base de datos.
. clear

. eststo clear

. use ej4

. tabulate year, generate(y)

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1942 |          1        0.07        0.07
       1946 |          4        0.27        0.34
       1947 |          3        0.20        0.54
       1948 |          1        0.07        0.61
       1949 |          6        0.40        1.01
       1950 |          1        0.07        1.08
       1954 |          1        0.07        1.15
       1955 |          8        0.54        1.68
       1956 |          3        0.20        1.89
       1957 |          6        0.40        2.29
       1958 |         13        0.88        3.17
       1959 |          8        0.54        3.71
       1961 |          7        0.47        4.18
       1962 |         10        0.67        4.85
       1963 |         16        1.08        5.93
       1964 |          6        0.40        6.33
       1965 |          9        0.61        6.94
       1966 |          9        0.61        7.55
       1967 |          8        0.54        8.09
       1968 |          2        0.13        8.22
       1970 |          5        0.34        8.56
       1971 |          3        0.20        8.76
       1972 |          9        0.61        9.37
       1973 |          4        0.27        9.64
       1975 |          6        0.40       10.04
       1976 |         16        1.08       11.12
       1977 |         23        1.55       12.67
       1978 |          9        0.61       13.27
       1979 |          4        0.27       13.54
       1980 |          7        0.47       14.02
       1981 |          8        0.54       14.56
       1982 |          8        0.54       15.09
       1983 |          7        0.47       15.57
       1984 |         15        1.01       16.58
       1985 |         24        1.62       18.19
       1986 |         21        1.42       19.61
       1987 |         13        0.88       20.49
       1988 |         12        0.81       21.29
       1989 |         13        0.88       22.17
       1990 |         26        1.75       23.92
       1991 |         25        1.68       25.61
       1992 |         37        2.49       28.10
       1993 |         42        2.83       30.93
       1994 |         46        3.10       34.03
       1995 |         50        3.37       37.40
       1996 |         51        3.44       40.84
       1997 |         51        3.44       44.27
       1998 |         33        2.22       46.50
       1999 |         54        3.64       50.13
       2000 |         68        4.58       54.72
       2001 |         59        3.98       58.69
       2002 |         60        4.04       62.74
       2003 |         67        4.51       67.25
       2004 |         74        4.99       72.24
       2005 |         62        4.18       76.42
       2006 |         47        3.17       79.58
       2007 |         50        3.37       82.95
       2008 |         45        3.03       85.98
       2009 |         83        5.59       91.58
       2010 |         92        6.20       97.78
       2011 |         31        2.09       99.87
       2012 |          2        0.13      100.00
------------+-----------------------------------
      Total |      1,484      100.00

. tabulate curr, generate(c)

             curr |      Freq.     Percent        Cum.
------------------+-----------------------------------
              ATS |          1        0.07        0.07
         AUDollar |          2        0.13        0.20
Austrian Shilling |          2        0.13        0.34
              CAD |          2        0.13        0.47
              CHF |          3        0.20        0.67
              CZK |          1        0.07        0.74
   CanadianDollar |          6        0.40        1.15
              DKK |          2        0.13        1.28
               DM |        112        7.56        8.84
              DRC |          1        0.07        8.91
             Dfls |          8        0.54        9.45
           Dinars |          1        0.07        9.51
    DutchGuilders |          1        0.07        9.58
              ECU |         15        1.01       10.59
             Euro |        231       15.59       26.18
        EuroFranc |          1        0.07       26.25
      FrenchFranc |         13        0.88       27.13
           GreekD |          1        0.07       27.19
        HK Dollar |          2        0.13       27.33
             Kuna |          1        0.07       27.40
               LE |          1        0.07       27.46
              LTL |          1        0.07       27.53
             Lire |          5        0.34       27.87
         LuxFranc |          4        0.27       28.14
              NLG |          4        0.27       28.41
              NOK |          2        0.13       28.54
  NorwegianKroner |          3        0.20       28.74
              PTE |          1        0.07       28.81
          Pesetas |          2        0.13       28.95
  Philippine Peso |          1        0.07       29.01
            Pound |         24        1.62       30.63
               Ps |          4        0.27       30.90
                R |          1        0.07       30.97
             Real |          1        0.07       31.04
           Rubles |          1        0.07       31.11
              SEK |          1        0.07       31.17
              SFR |          1        0.07       31.24
 SouthAfricanRand |          1        0.07       31.31
     SwedishKrona |          3        0.20       31.51
       SwissFranc |         17        1.15       32.66
              TRY |          1        0.07       32.73
         USdollar |        954       64.37       97.10
  Usdollar & Euro |          1        0.07       97.17
              Yen |         42        2.83      100.00
------------------+-----------------------------------
            Total |      1,482      100.00

. save ej5
file ej5.dta saved

. *Ahora puedo correr las regresiones adecuadas.
. 
. *Primero analizaremos el caso para la submuestra con jurisdicción en NY.
. keep if law == "NY"
(931 observations deleted)

. 
. *MODELONYA (con los ratings)
. regress spread aaa aa a bb b num_lawyers_2 num_lawyers_0 c2-c44 y2-y62, robust
note: num_lawyers_0 omitted because of collinearity
note: c2 omitted because of collinearity
note: c3 omitted because of collinearity
note: c4 omitted because of collinearity
note: c5 omitted because of collinearity
note: c6 omitted because of collinearity
note: c7 omitted because of collinearity
note: c8 omitted because of collinearity
note: c9 omitted because of collinearity
note: c10 omitted because of collinearity
note: c11 omitted because of collinearity
note: c12 omitted because of collinearity
note: c13 omitted because of collinearity
note: c14 omitted because of collinearity
note: c16 omitted because of collinearity
note: c17 omitted because of collinearity
note: c18 omitted because of collinearity
note: c19 omitted because of collinearity
note: c20 omitted because of collinearity
note: c22 omitted because of collinearity
note: c23 omitted because of collinearity
note: c24 omitted because of collinearity
note: c25 omitted because of collinearity
note: c26 omitted because of collinearity
note: c27 omitted because of collinearity
note: c28 omitted because of collinearity
note: c29 omitted because of collinearity
note: c31 omitted because of collinearity
note: c35 omitted because of collinearity
note: c36 omitted because of collinearity
note: c37 omitted because of collinearity
note: c38 omitted because of collinearity
note: c39 omitted because of collinearity
note: c41 omitted because of collinearity
note: c43 omitted because of collinearity
note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y16 omitted because of collinearity
note: y18 omitted because of collinearity
note: y19 omitted because of collinearity
note: y20 omitted because of collinearity
note: y21 omitted because of collinearity
note: y22 omitted because of collinearity
note: y23 omitted because of collinearity
note: y24 omitted because of collinearity
note: y25 omitted because of collinearity
note: y27 omitted because of collinearity
note: y29 omitted because of collinearity
note: y30 omitted because of collinearity
note: y31 omitted because of collinearity
note: y32 omitted because of collinearity
note: y33 omitted because of collinearity
note: y34 omitted because of collinearity
note: y37 omitted because of collinearity
note: y62 omitted because of collinearity

Linear regression                               Number of obs     =        422
                                                F(32, 377)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6145
                                                Root MSE          =     1.3243

-------------------------------------------------------------------------------
              |               Robust
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
          aaa |  -1.745589   .4271002    -4.09   0.000    -2.585386   -.9057918
           aa |  -1.589683   .4047582    -3.93   0.000     -2.38555   -.7938165
            a |  -.3965244   .2314921    -1.71   0.088    -.8517018    .0586531
           bb |   1.417126   .1997795     7.09   0.000     1.024305    1.809948
            b |   2.469187   .2367676    10.43   0.000     2.003637    2.934738
num_lawyers_2 |    .388885   .2470649     1.57   0.116    -.0969129    .8746829
num_lawyers_0 |          0  (omitted)
           c2 |          0  (omitted)
           c3 |          0  (omitted)
           c4 |          0  (omitted)
           c5 |          0  (omitted)
           c6 |          0  (omitted)
           c7 |          0  (omitted)
           c8 |          0  (omitted)
           c9 |          0  (omitted)
          c10 |          0  (omitted)
          c11 |          0  (omitted)
          c12 |          0  (omitted)
          c13 |          0  (omitted)
          c14 |          0  (omitted)
          c15 |  -1.403842   .7754075    -1.81   0.071    -2.928508    .1208235
          c16 |          0  (omitted)
          c17 |          0  (omitted)
          c18 |          0  (omitted)
          c19 |          0  (omitted)
          c20 |          0  (omitted)
          c21 |   .6033492   .7848621     0.77   0.443    -.9399066    2.146605
          c22 |          0  (omitted)
          c23 |          0  (omitted)
          c24 |          0  (omitted)
          c25 |          0  (omitted)
          c26 |          0  (omitted)
          c27 |          0  (omitted)
          c28 |          0  (omitted)
          c29 |          0  (omitted)
          c30 |  -1.613709   .8207828    -1.97   0.050    -3.227595    .0001764
          c31 |          0  (omitted)
          c32 |   1.293305   1.171403     1.10   0.270    -1.009997    3.596608
          c33 |    4.65431   .7593621     6.13   0.000     3.161195    6.147426
          c34 |   4.343417   .7667799     5.66   0.000     2.835716    5.851118
          c35 |          0  (omitted)
          c36 |          0  (omitted)
          c37 |          0  (omitted)
          c38 |          0  (omitted)
          c39 |          0  (omitted)
          c40 |  -3.105031   .7291697    -4.26   0.000     -4.53878   -1.671282
          c41 |          0  (omitted)
          c42 |  -.4611224   .7038216    -0.66   0.513     -1.84503    .9227853
          c43 |          0  (omitted)
          c44 |  -3.282575   1.083923    -3.03   0.003    -5.413867   -1.151284
           y2 |          0  (omitted)
           y3 |          0  (omitted)
           y4 |          0  (omitted)
           y5 |          0  (omitted)
           y6 |          0  (omitted)
           y7 |          0  (omitted)
           y8 |          0  (omitted)
           y9 |          0  (omitted)
          y10 |          0  (omitted)
          y11 |          0  (omitted)
          y12 |          0  (omitted)
          y13 |          0  (omitted)
          y14 |          0  (omitted)
          y15 |          0  (omitted)
          y16 |          0  (omitted)
          y17 |  -.2645322    .724501    -0.37   0.715    -1.689101    1.160037
          y18 |          0  (omitted)
          y19 |          0  (omitted)
          y20 |          0  (omitted)
          y21 |          0  (omitted)
          y22 |          0  (omitted)
          y23 |          0  (omitted)
          y24 |          0  (omitted)
          y25 |          0  (omitted)
          y26 |  -3.573661   .4568805    -7.82   0.000    -4.472014   -2.675308
          y27 |          0  (omitted)
          y28 |  -1.143333   .0899588   -12.71   0.000    -1.320217   -.9664495
          y29 |          0  (omitted)
          y30 |          0  (omitted)
          y31 |          0  (omitted)
          y32 |          0  (omitted)
          y33 |          0  (omitted)
          y34 |          0  (omitted)
          y35 |  -1.338885   .2470649    -5.42   0.000    -1.824683   -.8530871
          y36 |  -1.464895   .3283829    -4.46   0.000    -2.110587   -.8192039
          y37 |          0  (omitted)
          y38 |       -.74          .        .       .            .           .
          y39 |  -2.554474   .4558539    -5.60   0.000    -3.450809   -1.658139
          y40 |  -2.117949   .4371643    -4.84   0.000    -2.977535   -1.258364
          y41 |  -1.718753   .7067656    -2.43   0.015    -3.108449   -.3290566
          y42 |    -2.6766   .4386979    -6.10   0.000    -3.539202   -1.813999
          y43 |  -2.117527   .6284247    -3.37   0.001    -3.353183     -.88187
          y44 |  -1.767028   .7399506    -2.39   0.017    -3.221976   -.3120808
          y45 |  -3.313188   1.957628    -1.69   0.091    -7.162426    .5360496
          y46 |  -1.774964   .5038388    -3.52   0.000     -2.76565   -.7842778
          y47 |  -2.623682   .4561299    -5.75   0.000    -3.520559   -1.726804
          y48 |  -.7076208   .5463338    -1.30   0.196    -1.781864    .3666226
          y49 |  -.2179698   .4847484    -0.45   0.653    -1.171119    .7351795
          y50 |  -1.107431   .5441907    -2.04   0.043    -2.177461    -.037402
          y51 |  -.8432472   .4558669    -1.85   0.065    -1.739607    .0531131
          y52 |   -.513447   .4194076    -1.22   0.222    -1.338118    .3112242
          y53 |  -1.091471   .4642118    -2.35   0.019     -2.00424   -.1787024
          y54 |  -1.548467   .4980797    -3.11   0.002     -2.52783   -.5691048
          y55 |  -1.690565   .4440403    -3.81   0.000    -2.563671    -.817459
          y56 |  -2.467033    .488241    -5.05   0.000     -3.42705   -1.507016
          y57 |  -2.196072   .5033441    -4.36   0.000    -3.185785   -1.206358
          y58 |  -1.666522   .4977224    -3.35   0.001    -2.645182   -.6878622
          y59 |   -.603339   .4764613    -1.27   0.206    -1.540194    .3335156
          y60 |  -1.599013   .5244721    -3.05   0.002    -2.630271   -.5677561
          y61 |  -1.245392   .5988951    -2.08   0.038    -2.422985   -.0677984
          y62 |          0  (omitted)
        _cons |   3.586711   .8557927     4.19   0.000     1.903986    5.269436
-------------------------------------------------------------------------------

. eststo MODELNYA

. 
. *(Test set)
. *1-linealidad: Se consideró que debido a los hallazgos anteriores y al ser tod
> as las nuevas variables dummies, está prueba es incesesaria, se asume linealid
> ad.
. *2-homocedasticidad: No hay homocedasticidad, la opción robust controla por es
> o (al menos por ahora).
. rvfplot

. *3-variable omitida: Puedo rechazar H0 (no hay sesgo por variables omitidas) a
>  partir del 97% de confianza.
. ovtest

Ramsey RESET test using powers of the fitted values of spread
       Ho:  model has no omitted variables
                 F(3, 374) =      3.03
                  Prob > F =      0.0295

. *4-error de especificación: _hatsq es significatica con un p value de .342, po
> r lo que no rechazamos H0 (no rechazamos que no tengamos error de especifícaci
> ón)
. linktest

      Source |       SS           df       MS      Number of obs   =       422
-------------+----------------------------------   F(2, 419)       =    335.16
       Model |  1055.51415         2  527.757073   Prob > F        =    0.0000
    Residual |  659.772222       419  1.57463537   R-squared       =    0.6154
-------------+----------------------------------   Adj R-squared   =    0.6135
       Total |  1715.28637       421  4.07431441   Root MSE        =    1.2548

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |   .9202585   .0922608     9.97   0.000     .7389069     1.10161
      _hatsq |   .0160752   .0168883     0.95   0.342    -.0171211    .0492714
       _cons |   .0557928   .1407181     0.40   0.692    -.2208085    .3323941
------------------------------------------------------------------------------

. *5-multicolinealidad: Definitivamente tenemos un problema de multicolinealidad
>  con las variables que agregamos, 20 de ellas presentan una VIF mayor a 10
. vif 

    Variable |       VIF       1/VIF  
-------------+----------------------
         y51 |     47.94    0.020860
         y60 |     44.46    0.022494
         y54 |     43.08    0.023214
         y55 |     41.88    0.023877
         y53 |     41.83    0.023909
         y52 |     39.90    0.025062
         y50 |     38.12    0.026236
         y59 |     33.22    0.030098
         y56 |     31.96    0.031287
         y47 |     30.70    0.032578
         y49 |     29.49    0.033913
         y57 |     26.79    0.037333
         c42 |     26.48    0.037771
         y48 |     25.52    0.039184
         y58 |     22.92    0.043624
         y46 |     20.19    0.049518
         c15 |     12.95    0.077229
         y61 |     12.22    0.081844
         y44 |     10.89    0.091864
         y43 |     10.79    0.092707
         c44 |      5.70    0.175381
         y36 |      5.47    0.182711
         c32 |      4.69    0.213174
         aaa |      4.22    0.236944
         y28 |      3.97    0.251790
         y26 |      3.86    0.258833
         y42 |      3.84    0.260087
         y41 |      3.83    0.261373
         y45 |      3.82    0.262083
         y17 |      3.20    0.312575
          aa |      2.70    0.370719
num_lawye~_2 |      2.51    0.398524
          bb |      2.45    0.408358
         y39 |      2.45    0.408635
         y40 |      2.44    0.410025
         c21 |      2.27    0.440903
         c40 |      2.27    0.441243
         c33 |      2.26    0.441778
         c30 |      2.26    0.442875
         c34 |      2.25    0.443900
           b |      2.08    0.481285
         y35 |      2.04    0.490984
         y38 |      2.00    0.501188
           a |      1.67    0.599008
-------------+----------------------
    Mean VIF |     15.13

. *6-outliers: en el caso de outliers, estos están controlados debido a la opció
> n robust.
. avplot aaa 

. avplot aa 

. avplot a  

. avplot bb

. avplot b

. avplot num_lawyers_2

. *7-normalidad: En cuanto a normalidad, la distribución no se asemeja a una nor
> mal.
. predict e, resid
(134 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |        422    0.97673      6.721     4.545    0.00000

. 
. *Conclusión: Gracias a la opción robust, se realizó una regresión ponderadora 
> que  ha corregido para el peso desproporcional de los outliers y esto ha favor
> ecido a que el término estocástico sea homocedastico y se distribuya de forma 
> normal. Asimismo, existe un riesgo de que tengamos un sesgo por variable omiti
> da aunque en menor medida que en el modelo anterio (modelNY1); finalmente, def
> initivamente el modelo presenta un problema de multicolinealidad, que aunque e
> n menos variables (17), recordemos que en principio este modelo cuenta con 5 r
> egresoras menos.
. 
. *MODELONYB (sin los ratings)
. regress spread num_lawyers_2 num_lawyers_0 c2-c44 y2-y62, robust
note: c2 omitted because of collinearity
note: c3 omitted because of collinearity
note: c4 omitted because of collinearity
note: c5 omitted because of collinearity
note: c6 omitted because of collinearity
note: c7 omitted because of collinearity
note: c8 omitted because of collinearity
note: c9 omitted because of collinearity
note: c10 omitted because of collinearity
note: c11 omitted because of collinearity
note: c12 omitted because of collinearity
note: c13 omitted because of collinearity
note: c16 omitted because of collinearity
note: c17 omitted because of collinearity
note: c18 omitted because of collinearity
note: c19 omitted because of collinearity
note: c20 omitted because of collinearity
note: c22 omitted because of collinearity
note: c23 omitted because of collinearity
note: c24 omitted because of collinearity
note: c25 omitted because of collinearity
note: c26 omitted because of collinearity
note: c27 omitted because of collinearity
note: c28 omitted because of collinearity
note: c29 omitted because of collinearity
note: c31 omitted because of collinearity
note: c35 omitted because of collinearity
note: c36 omitted because of collinearity
note: c37 omitted because of collinearity
note: c38 omitted because of collinearity
note: c39 omitted because of collinearity
note: c41 omitted because of collinearity
note: c43 omitted because of collinearity
note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y16 omitted because of collinearity
note: y20 omitted because of collinearity
note: y22 omitted because of collinearity
note: y24 omitted because of collinearity
note: y27 omitted because of collinearity
note: y29 omitted because of collinearity
note: y30 omitted because of collinearity
note: y32 omitted because of collinearity
note: y33 omitted because of collinearity
note: y34 omitted because of collinearity
note: y38 omitted because of collinearity
note: y62 omitted because of collinearity

Linear regression                               Number of obs     =        445
                                                F(33, 397)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4463
                                                Root MSE          =     1.6323

-------------------------------------------------------------------------------
              |               Robust
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
num_lawyers_2 |   2.088808   .2656356     7.86   0.000      1.56658    2.611037
num_lawyers_0 |     -3.175   .2038053   -15.58   0.000    -3.575673   -2.774327
           c2 |          0  (omitted)
           c3 |          0  (omitted)
           c4 |          0  (omitted)
           c5 |          0  (omitted)
           c6 |          0  (omitted)
           c7 |          0  (omitted)
           c8 |          0  (omitted)
           c9 |          0  (omitted)
          c10 |          0  (omitted)
          c11 |          0  (omitted)
          c12 |          0  (omitted)
          c13 |          0  (omitted)
          c14 |  -4.881826   .7556566    -6.46   0.000    -6.367415   -3.396238
          c15 |  -4.630237    .680729    -6.80   0.000    -5.968521   -3.291953
          c16 |          0  (omitted)
          c17 |          0  (omitted)
          c18 |          0  (omitted)
          c19 |          0  (omitted)
          c20 |          0  (omitted)
          c21 |  -2.969059   .5883708    -5.05   0.000    -4.125771   -1.812347
          c22 |          0  (omitted)
          c23 |          0  (omitted)
          c24 |          0  (omitted)
          c25 |          0  (omitted)
          c26 |          0  (omitted)
          c27 |          0  (omitted)
          c28 |          0  (omitted)
          c29 |          0  (omitted)
          c30 |  -4.292447   .5554696    -7.73   0.000    -5.384477   -3.200418
          c31 |          0  (omitted)
          c32 |  -1.775707   1.466006    -1.21   0.227    -4.657812    1.106397
          c33 |   .9101442   .5167644     1.76   0.079    -.1057926    1.926081
          c34 |   .2475529   .5554696     0.45   0.656    -.8444768    1.339582
          c35 |          0  (omitted)
          c36 |          0  (omitted)
          c37 |          0  (omitted)
          c38 |          0  (omitted)
          c39 |          0  (omitted)
          c40 |  -7.654594   .5049154   -15.16   0.000    -8.647236   -6.661952
          c41 |          0  (omitted)
          c42 |  -3.724564    .403679    -9.23   0.000    -4.518179   -2.930948
          c43 |          0  (omitted)
          c44 |  -7.495117   .6888119   -10.88   0.000    -8.849292   -6.140942
           y2 |          0  (omitted)
           y3 |          0  (omitted)
           y4 |          0  (omitted)
           y5 |          0  (omitted)
           y6 |          0  (omitted)
           y7 |          0  (omitted)
           y8 |          0  (omitted)
           y9 |          0  (omitted)
          y10 |          0  (omitted)
          y11 |          0  (omitted)
          y12 |          0  (omitted)
          y13 |          0  (omitted)
          y14 |          0  (omitted)
          y15 |          0  (omitted)
          y16 |          0  (omitted)
          y17 |       1.15   .1871586     6.14   0.000     .7820542    1.517946
          y18 |       -.07          .        .       .            .           .
          y19 |     1.1425   .1765006     6.47   0.000     .7955074    1.489493
          y20 |          0  (omitted)
          y21 |      1.785    .370574     4.82   0.000     1.056467    2.513533
          y22 |          0  (omitted)
          y23 |      .6575   .1765006     3.73   0.000     .3105074    1.004493
          y24 |          0  (omitted)
          y25 |         .3   .0823498     3.64   0.000     .1381038    .4618962
          y26 |  -.3188083   .2656356    -1.20   0.231    -.8410366      .20342
          y27 |          0  (omitted)
          y28 |  -.4033333   .0900208    -4.48   0.000    -.5803104   -.2263563
          y29 |          0  (omitted)
          y30 |          0  (omitted)
          y31 |  -1.468808   .2656356    -5.53   0.000    -1.991037     -.94658
          y32 |          0  (omitted)
          y33 |          0  (omitted)
          y34 |          0  (omitted)
          y35 |  -2.298808   .2656356    -8.65   0.000    -2.821037    -1.77658
          y36 |  -1.249523   .5812852    -2.15   0.032    -2.392305   -.1067413
          y37 |        .74          .        .       .            .           .
          y38 |          0  (omitted)
          y39 |  -1.768808   .2656356    -6.66   0.000    -2.291037    -1.24658
          y40 |  -2.264564    .403679    -5.61   0.000    -3.058179   -1.470948
          y41 |  -.1694041   .1643947    -1.03   0.303     -.492597    .1537888
          y42 |  -.4738083   .2898744    -1.63   0.103    -1.043689    .0960725
          y43 |  -.4905773   .3910997    -1.25   0.210    -1.259463     .278308
          y44 |   .7472625   .6689151     1.12   0.265    -.5677962    2.062321
          y45 |   .2655959   2.163445     0.12   0.902    -3.987645    4.518836
          y46 |  -.1048631   .4180674    -0.25   0.802    -.9267657    .7170396
          y47 |  -.6820984    .375435    -1.82   0.070    -1.420188    .0559909
          y48 |   1.272104   .4568619     2.78   0.006     .3739333    2.170275
          y49 |   1.657325   .4253357     3.90   0.000     .8211336    2.493517
          y50 |   .9600447   .5228617     1.84   0.067    -.0678792    1.987969
          y51 |   1.344986   .3850849     3.49   0.001     .5879251    2.102046
          y52 |   1.479574   .4166884     3.55   0.000      .660382    2.298765
          y53 |   .6917892   .3951599     1.75   0.081    -.0850784    1.468657
          y54 |   .4788559   .3950358     1.21   0.226    -.2977676    1.255479
          y55 |   .3812219   .3558525     1.07   0.285     -.318369    1.080813
          y56 |   .2164838   .3930131     0.55   0.582    -.5561632    .9891308
          y57 |   .3156865    .468111     0.67   0.500    -.6045998    1.235973
          y58 |   .3929922   .3664687     1.07   0.284    -.3274697    1.113454
          y59 |   .8155512   .3607997     2.26   0.024     .1062344    1.524868
          y60 |   .0190751   .4415494     0.04   0.966    -.8489922    .8871424
          y61 |   .0049417   .4931523     0.01   0.992    -.9645748    .9744582
          y62 |          0  (omitted)
        _cons |   4.364564    .403679    10.81   0.000     3.570948    5.158179
-------------------------------------------------------------------------------

. eststo MODELNYB

. 
. *(Test set)
. *1-linealidad: Se consideró que debido a los hallazgos anteriores y al ser tod
> as las nuevas variables dummies, está prueba es incesesaria, se asume linealid
> ad.
. 
. *2-homocedasticidad: No hay homocedasticidad, el robust controla por eso.
. rvfplot

. *3-variable omitida: Puedo rechazar H0 (no hay sesgo por variables omitidas) a
>  partir del 94% de confianza, un poco menos confianza que en modelNY1.
. ovtest

Ramsey RESET test using powers of the fitted values of spread
       Ho:  model has no omitted variables
                 F(3, 394) =      2.49
                  Prob > F =      0.0601

. 
. *4-error de especificación: _hatsq es significatica con un p value de .447, po
> r lo que no rechazamos H0 (no rechazamos que no tengamos error de especifícaci
> ón)
. linktest

      Source |       SS           df       MS      Number of obs   =       445
-------------+----------------------------------   F(2, 442)       =    178.60
       Model |  853.785108         2  426.892554   Prob > F        =    0.0000
    Residual |  1056.49544       442  2.39026117   R-squared       =    0.4469
-------------+----------------------------------   Adj R-squared   =    0.4444
       Total |  1910.28054       444  4.30243366   Root MSE        =     1.546

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |   .9516589   .0861245    11.05   0.000     .7823944    1.120923
      _hatsq |   .0132951   .0186813     0.71   0.477    -.0234201    .0500102
       _cons |   .0058222   .1652707     0.04   0.972    -.3189919    .3306363
------------------------------------------------------------------------------

. *5-multicolinealidad: Definitivamente tenemos un problema de multicolinealidad
>  con las variables que agregamos, pues 17 de ellas presentan una VIF mayor a 1
> 0.
. vif 

    Variable |       VIF       1/VIF  
-------------+----------------------
         y51 |     34.56    0.028937
         y60 |     32.09    0.031162
         y54 |     31.10    0.032158
         y55 |     30.25    0.033058
         y53 |     30.16    0.033157
         c42 |     29.91    0.033433
         y52 |     29.38    0.034040
         y59 |     28.49    0.035103
         y50 |     27.51    0.036347
         y56 |     23.13    0.043228
         y47 |     22.21    0.045017
         y49 |     21.33    0.046882
         y57 |     19.43    0.051458
         y48 |     18.48    0.054127
         y58 |     16.66    0.060009
         y46 |     14.67    0.068173
         c15 |     13.37    0.074774
         y61 |      9.00    0.111139
         y44 |      8.07    0.123867
         y43 |      7.95    0.125857
         c44 |      6.80    0.147036
         y40 |      6.27    0.159565
         y36 |      5.95    0.168105
         y18 |      4.96    0.201814
         c32 |      4.83    0.207147
         y28 |      3.97    0.251697
         y19 |      3.48    0.287004
         y23 |      3.48    0.287004
         y26 |      3.03    0.330366
         y42 |      3.03    0.330366
         y41 |      3.00    0.333709
         y45 |      3.00    0.333709
         y17 |      2.99    0.334838
         y21 |      2.99    0.334838
         y25 |      2.99    0.334838
         c14 |      2.43    0.412369
         c21 |      2.32    0.430493
         c33 |      2.31    0.432766
         c40 |      2.30    0.435071
         c30 |      2.30    0.435146
         c34 |      2.30    0.435146
         y31 |      2.02    0.496089
         y35 |      2.02    0.496089
         y39 |      2.02    0.496089
         y37 |      2.00    0.501126
num_lawyer~0 |      1.99    0.502257
num_lawye~_2 |      1.46    0.685894
-------------+----------------------
    Mean VIF |     11.36

. *6-outliers: en el caso de outliers, estos están controlados debido a la opció
> n robust.
. 
. avplot y40

. avplot num_lawyers_0

. *7-normalidad: En cuanto a normalidad, la distribución se asemeja a una normal
> .
. drop e

. predict e, resid
(111 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |        445    0.98628      4.156     3.406    0.00033

. 
. *Conclusión: Gracias a la opción robust se ha corregido para el peso despropor
> cional de los outliers y esto ha favorecido a que el término estocástico sea h
> omocedastico y se distribuya de forma normal. Asimismo, existe un riesgo de qu
> e tengamos un sesgo por variable omitida; finalmente, definitivamente el model
> o presenta un problema de multicolinealidad.
. 
. 
. *Ahora analizaremos el caso para la jurisdicción inglesa.
. clear

. use ej5 

. keep if law == "English"
(945 observations deleted)

. 
. *MODELENGA (con los ratings)
. regress spread aaa aa a bb b num_lawyers_2 num_lawyers_0 c2-c44 y2-y62, robust
note: c6 omitted because of collinearity
note: c11 omitted because of collinearity
note: c12 omitted because of collinearity
note: c16 omitted because of collinearity
note: c19 omitted because of collinearity
note: c21 omitted because of collinearity
note: c28 omitted because of collinearity
note: c29 omitted because of collinearity
note: c30 omitted because of collinearity
note: c32 omitted because of collinearity
note: c33 omitted because of collinearity
note: c34 omitted because of collinearity
note: c37 omitted because of collinearity
note: c40 omitted because of collinearity
note: c43 omitted because of collinearity
note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y17 omitted because of collinearity
note: y18 omitted because of collinearity
note: y19 omitted because of collinearity
note: y20 omitted because of collinearity
note: y21 omitted because of collinearity
note: y22 omitted because of collinearity
note: y23 omitted because of collinearity
note: y24 omitted because of collinearity
note: y25 omitted because of collinearity
note: y26 omitted because of collinearity
note: y27 omitted because of collinearity
note: y28 omitted because of collinearity
note: y29 omitted because of collinearity
note: y30 omitted because of collinearity
note: y31 omitted because of collinearity
note: y33 omitted because of collinearity
note: y34 omitted because of collinearity
note: y38 omitted because of collinearity

Linear regression                               Number of obs     =        376
                                                F(47, 311)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2594
                                                Root MSE          =     4.0082

-------------------------------------------------------------------------------
              |               Robust
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
          aaa |  -2.326617    .580207    -4.01   0.000    -3.468244    -1.18499
           aa |   -1.30918   .3923751    -3.34   0.001    -2.081226   -.5371347
            a |  -1.088017   .4461024    -2.44   0.015    -1.965778   -.2102568
           bb |    2.76711   1.452992     1.90   0.058    -.0918285    5.626048
            b |    2.62327   .6673579     3.93   0.000     1.310163    3.936378
num_lawyers_2 |  -.4270439   .7135325    -0.60   0.550    -1.831005    .9769177
num_lawyers_0 |   .4026046   .7490349     0.54   0.591    -1.071212    1.876421
           c2 |   2.226075   1.487329     1.50   0.135    -.7004257    5.152575
           c3 |  -2.223961    .563814    -3.94   0.000    -3.333333   -1.114589
           c4 |   .7734501   .9659063     0.80   0.424    -1.127088    2.673988
           c5 |  -1.630754   .7862697    -2.07   0.039    -3.177835    -.083673
           c6 |          0  (omitted)
           c7 |   1.924812   .7713968     2.50   0.013     .4069955    3.442629
           c8 |  -.3755149   1.543323    -0.24   0.808     -3.41219     2.66116
           c9 |   .4906572   1.023726     0.48   0.632    -1.523648    2.504963
          c10 |   2.421847   1.067486     2.27   0.024     .3214395    4.522255
          c11 |          0  (omitted)
          c12 |          0  (omitted)
          c13 |   1.199246   .7862697     1.53   0.128    -.3478348    2.746327
          c14 |   1.397474   .5849756     2.39   0.017     .2464634    2.548484
          c15 |   .3434552    1.05447     0.33   0.745    -1.731342    2.418252
          c16 |          0  (omitted)
          c17 |   1.569439   .8696362     1.80   0.072    -.1416752    3.280554
          c18 |   1.791847   1.067486     1.68   0.094    -.3085605    3.892255
          c19 |          0  (omitted)
          c20 |   6.133118   1.620036     3.79   0.000     2.945501    9.320735
          c21 |          0  (omitted)
          c22 |   3.217058   .8605129     3.74   0.000     1.523895    4.910222
          c23 |    2.46966   1.040247     2.37   0.018     .4228471    4.516473
          c24 |   .8466415    1.04238     0.81   0.417    -1.204368    2.897651
          c25 |  -.1019693   1.130803    -0.09   0.928    -2.326962    2.123023
          c26 |   1.547805   1.981385     0.78   0.435    -2.350809    5.446419
          c27 |   1.247409   1.076876     1.16   0.248    -.8714745    3.366292
          c28 |          0  (omitted)
          c29 |          0  (omitted)
          c30 |          0  (omitted)
          c31 |   1.539186   .7274604     2.12   0.035     .1078198    2.970552
          c32 |          0  (omitted)
          c33 |          0  (omitted)
          c34 |          0  (omitted)
          c35 |    3.02622   1.098135     2.76   0.006      .865506    5.186934
          c36 |   .1894664   .9145617     0.21   0.836    -1.610044    1.988977
          c37 |          0  (omitted)
          c38 |  -1.550754   .7862697    -1.97   0.049    -3.097835    -.003673
          c39 |   .1218415   1.113416     0.11   0.913     -2.06894    2.312623
          c40 |          0  (omitted)
          c41 |   13.69854   1.042565    13.14   0.000     11.64717    15.74992
          c42 |    .233292   .6336345     0.37   0.713    -1.013461    1.480045
          c43 |          0  (omitted)
          c44 |  -2.408131   .7232817    -3.33   0.001    -3.831275   -.9849866
           y2 |          0  (omitted)
           y3 |          0  (omitted)
           y4 |          0  (omitted)
           y5 |          0  (omitted)
           y6 |          0  (omitted)
           y7 |          0  (omitted)
           y8 |          0  (omitted)
           y9 |          0  (omitted)
          y10 |          0  (omitted)
          y11 |          0  (omitted)
          y12 |          0  (omitted)
          y13 |          0  (omitted)
          y14 |          0  (omitted)
          y15 |          0  (omitted)
          y16 |   1.844481   1.169462     1.58   0.116    -.4565778    4.145539
          y17 |          0  (omitted)
          y18 |          0  (omitted)
          y19 |          0  (omitted)
          y20 |          0  (omitted)
          y21 |          0  (omitted)
          y22 |          0  (omitted)
          y23 |          0  (omitted)
          y24 |          0  (omitted)
          y25 |          0  (omitted)
          y26 |          0  (omitted)
          y27 |          0  (omitted)
          y28 |          0  (omitted)
          y29 |          0  (omitted)
          y30 |          0  (omitted)
          y31 |          0  (omitted)
          y32 |  -7.622563   .5413114   -14.08   0.000    -8.687659   -6.557468
          y33 |          0  (omitted)
          y34 |          0  (omitted)
          y35 |  -1.786221   1.160751    -1.54   0.125    -4.070139    .4976965
          y36 |   .4974367   .5413114     0.92   0.359     -.567659    1.562532
          y37 |   .6015677   .5229843     1.15   0.251    -.4274673    1.630603
          y38 |          0  (omitted)
          y39 |  -.2051716    .433737    -0.47   0.637    -1.058602    .6482584
          y40 |   .1063744   .6042403     0.18   0.860    -1.082542     1.29529
          y41 |   .0572122   .4286548     0.13   0.894     -.786218    .9006424
          y42 |   .1869112   .4357703     0.43   0.668    -.6705196    1.044342
          y43 |  -.8021925   .4350753    -1.84   0.066    -1.658256    .0538708
          y44 |  -1.871993   .4165941    -4.49   0.000    -2.691692   -1.052294
          y45 |  -1.665954   .5942023    -2.80   0.005    -2.835119   -.4967892
          y46 |  -1.581962   .5733401    -2.76   0.006    -2.710078   -.4538463
          y47 |  -1.915515   .4458337    -4.30   0.000    -2.792747   -1.038283
          y48 |  -1.008555   .6556762    -1.54   0.125    -2.298677    .2815672
          y49 |  -1.666126   .5168955    -3.22   0.001    -2.683181    -.649072
          y50 |  -.9929468   .3635776    -2.73   0.007     -1.70833   -.2775638
          y51 |   -.787442   .4689519    -1.68   0.094    -1.710162    .1352777
          y52 |  -.7791615   .4011585    -1.94   0.053    -1.568489    .0101664
          y53 |  -1.254407   .2609251    -4.81   0.000    -1.767809   -.7410057
          y54 |   .8618364    2.05353     0.42   0.675    -3.178732    4.902405
          y55 |   .1022723   2.699547     0.04   0.970    -5.209414    5.413959
          y56 |  -2.142964   .7317726    -2.93   0.004    -3.582816   -.7031131
          y57 |  -1.827815   .4041433    -4.52   0.000    -2.623016   -1.032614
          y58 |   .2498009   .5504893     0.45   0.650    -.8333534    1.332955
          y59 |   1.031262   .5221485     1.98   0.049     .0038719    2.058653
          y60 |  -.2011128   .5188379    -0.39   0.699    -1.221989    .8197637
          y61 |  -.1150643   .3752903    -0.31   0.759    -.8534933    .6233648
          y62 |   2.231872   .9297637     2.40   0.017     .4024496    4.061295
        _cons |   2.485888   .7587173     3.28   0.001     .9930201    3.978757
-------------------------------------------------------------------------------

. eststo MODELENGA 

. 
. 
. *(Test set)
. *1-linealidad: Se consideró que debido a los hallazgos anteriores y al ser tod
> as las nuevas variables dummies, está prueba es incesesaria, se asume linealid
> ad.
. 
. *2-homocedasticidad: En este caso si podemos ver que a pesar de que hay alguna
> s obervaciones outliers que si se omitieran harían que el modelo no tuviera he
> terocedasticidad.
. rvfplot

. *3-variable omitida: Puedo rechazar H0 (no hay sesgo por variables omitidas) c
> on más del 99% de confianza.
. ovtest

Ramsey RESET test using powers of the fitted values of spread
       Ho:  model has no omitted variables
                 F(3, 308) =      8.09
                  Prob > F =      0.0000

. *4-error de especificación: _hatsq es significatica con un p value de .182, po
> r lo que no rechazamos H0 (no rechazamos que no tengamos error de especifícaci
> ón)
. linktest

      Source |       SS           df       MS      Number of obs   =       376
-------------+----------------------------------   F(2, 373)       =     66.53
       Model |   1773.8529         2  886.926448   Prob > F        =    0.0000
    Residual |  4972.68361       373  13.3315915   R-squared       =    0.2629
-------------+----------------------------------   Adj R-squared   =    0.2590
       Total |  6746.53651       375   17.990764   Root MSE        =    3.6512

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |   .8877894   .1210665     7.33   0.000     .6497311    1.125848
      _hatsq |   .0289761   .0216652     1.34   0.182    -.0136252    .0715774
       _cons |   -.027538   .2418947    -0.11   0.909    -.5031863    .4481104
------------------------------------------------------------------------------

. *5-multicolinealidad: Definitivamente tenemos un problema de multicolinealidad
>  con las variables que agregamos, pues 25 de ellas presentan una VIF mayor a 1
> 0.
. vif 

    Variable |       VIF       1/VIF  
-------------+----------------------
         c42 |    102.60    0.009747
         c15 |     89.88    0.011126
         y60 |     31.02    0.032235
         y59 |     29.36    0.034058
         c44 |     25.57    0.039101
         y54 |     23.06    0.043365
         y45 |     21.89    0.045693
         y50 |     21.08    0.047433
         y57 |     20.39    0.049044
         y55 |     19.51    0.051245
         y53 |     19.31    0.051782
         y42 |     16.98    0.058889
         y61 |     16.73    0.059769
         y52 |     15.65    0.063905
         y44 |     15.06    0.066394
         y58 |     14.88    0.067190
         y41 |     14.86    0.067280
         y56 |     14.81    0.067519
         y49 |     13.85    0.072228
         y48 |     13.20    0.075766
         y43 |     12.90    0.077491
         y47 |     11.81    0.084658
         c31 |     11.60    0.086219
         y51 |     11.06    0.090390
         y46 |     10.95    0.091357
          c7 |      7.64    0.130934
         c14 |      7.46    0.134023
         y37 |      6.04    0.165510
          c9 |      5.44    0.183968
         y35 |      5.14    0.194484
         c23 |      5.07    0.197336
         y40 |      5.06    0.197630
         c27 |      4.40    0.227333
         c17 |      4.26    0.234607
         c25 |      4.17    0.239830
         aaa |      3.57    0.280294
          c8 |      3.35    0.298891
          aa |      3.33    0.300466
         c39 |      3.30    0.302605
          c2 |      3.29    0.304145
         c26 |      3.25    0.307487
          c4 |      3.22    0.310544
         y39 |      3.07    0.325903
         y62 |      3.07    0.326125
num_lawyer~0 |      2.49    0.401091
         c24 |      2.41    0.415209
         c20 |      2.32    0.431768
         c10 |      2.25    0.445390
         c18 |      2.25    0.445390
         c35 |      2.18    0.459523
         c22 |      2.17    0.460251
         c41 |      2.17    0.461730
          bb |      2.16    0.463156
          c3 |      2.16    0.463722
         c36 |      2.14    0.468075
         y16 |      2.06    0.485605
         c13 |      2.04    0.489481
         c38 |      2.04    0.489481
          c5 |      2.04    0.489481
         y32 |      2.04    0.490883
         y36 |      2.04    0.490883
num_lawye~_2 |      1.95    0.511528
           a |      1.91    0.523844
           b |      1.65    0.606717
-------------+----------------------
    Mean VIF |     11.32

. *6-outliers: en el caso de outliers, detectamos un grupo.
. 
. avplot y40

. avplot num_lawyers_0

. 
. *7-normalidad: En cuanto a normalidad, la distribución es muy leptocúrtica por
>  lo que no se asemeja a una normal.
. predict e, resid
(166 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |        376    0.36624    165.078    12.116    0.00000

. 
. *Conclusión: Para el caso de ley inglesa, tenemos algunos outliers que hacen q
> ue nuestro modelo falle las pruebas, por ejemplo la de heterocedasticidad. Asi
> mismo, el modelo tiene un sesgo por alguna variable omitida y un problema de m
> ulticolinealidad grave.
. 
. 
. *Ahora analizamos el último modelo.
. *MODELENGB (sin los ratings)
. regress spread num_lawyers_2 num_lawyers_0 c2-c44 y2-y62, robust
note: c6 omitted because of collinearity
note: c11 omitted because of collinearity
note: c12 omitted because of collinearity
note: c16 omitted because of collinearity
note: c19 omitted because of collinearity
note: c21 omitted because of collinearity
note: c28 omitted because of collinearity
note: c29 omitted because of collinearity
note: c30 omitted because of collinearity
note: c32 omitted because of collinearity
note: c33 omitted because of collinearity
note: c34 omitted because of collinearity
note: c37 omitted because of collinearity
note: c40 omitted because of collinearity
note: c43 omitted because of collinearity
note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y17 omitted because of collinearity
note: y18 omitted because of collinearity
note: y19 omitted because of collinearity
note: y20 omitted because of collinearity
note: y23 omitted because of collinearity
note: y25 omitted because of collinearity
note: y28 omitted because of collinearity
note: y29 omitted because of collinearity

Linear regression                               Number of obs     =        409
                                                F(46, 339)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1513
                                                Root MSE          =     4.1924

-------------------------------------------------------------------------------
              |               Robust
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
num_lawyers_2 |   1.144562   .3968007     2.88   0.004     .3640609    1.925064
num_lawyers_0 |    .564649   .7242214     0.78   0.436    -.8598846    1.989183
           c2 |  -.5646014    1.60502    -0.35   0.725    -3.721655    2.592452
           c3 |  -2.758166   .7803955    -3.53   0.000    -4.293194   -1.223139
           c4 |  -1.390548   .8210434    -1.69   0.091    -3.005529    .2244334
           c5 |  -4.135438   .3968007   -10.42   0.000    -4.915939   -3.354936
           c6 |          0  (omitted)
           c7 |  -.3169631    .581493    -0.55   0.586    -1.460752    .8268257
           c8 |  -4.014126   .6877676    -5.84   0.000    -5.366956   -2.661297
           c9 |  -1.968316   .6617057    -2.97   0.003    -3.269882   -.6667493
          c10 |  -.3901447   .9842612    -0.40   0.692    -2.326173    1.545884
          c11 |          0  (omitted)
          c12 |          0  (omitted)
          c13 |  -1.305438   .3968007    -3.29   0.001    -2.085939    -.524936
          c14 |  -.2006882   .9280545    -0.22   0.829    -2.026159    1.624782
          c15 |   .3908075    .752607     0.52   0.604     -1.08956    1.871175
          c16 |          0  (omitted)
          c17 |  -.7934496   .5857594    -1.35   0.176     -1.94563    .3587312
          c18 |  -1.020145   .9842612    -1.04   0.301    -2.956173    .9158838
          c19 |          0  (omitted)
          c20 |   3.508893   .5956821     5.89   0.000     2.337194    4.680592
          c21 |          0  (omitted)
          c22 |    3.54234   .6089993     5.82   0.000     2.344447    4.740233
          c23 |   2.259282   1.111689     2.03   0.043     .0726036     4.44596
          c24 |  -1.820087   .7355364    -2.47   0.014    -3.266877   -.3732963
          c25 |  -1.655325    .652343    -2.54   0.012    -2.938475    -.372175
          c26 |   .7252521   .8397075     0.86   0.388    -.9264412    2.376945
          c27 |  -.9289202   .6381859    -1.46   0.146    -2.184223    .3263829
          c28 |          0  (omitted)
          c29 |          0  (omitted)
          c30 |          0  (omitted)
          c31 |    .451303   .6742873     0.67   0.504     -.875011    1.777617
          c32 |          0  (omitted)
          c33 |          0  (omitted)
          c34 |          0  (omitted)
          c35 |   1.756772   .6294663     2.79   0.006     .5186199    2.994923
          c36 |  -.3936887   .7044218    -0.56   0.577    -1.779277    .9918994
          c37 |          0  (omitted)
          c38 |  -4.055438   .3968007   -10.22   0.000    -4.835939   -3.274936
          c39 |  -2.070161   .6526919    -3.17   0.002    -3.353997   -.7863244
          c40 |          0  (omitted)
          c41 |   11.55356   .6467919    17.86   0.000     10.28133    12.82579
          c42 |  -.4878248   .4592152    -1.06   0.289    -1.391095    .4154452
          c43 |          0  (omitted)
          c44 |  -4.043142   .5125204    -7.89   0.000    -5.051263   -3.035021
           y2 |          0  (omitted)
           y3 |          0  (omitted)
           y4 |          0  (omitted)
           y5 |          0  (omitted)
           y6 |          0  (omitted)
           y7 |          0  (omitted)
           y8 |          0  (omitted)
           y9 |          0  (omitted)
          y10 |          0  (omitted)
          y11 |          0  (omitted)
          y12 |          0  (omitted)
          y13 |          0  (omitted)
          y14 |          0  (omitted)
          y15 |          0  (omitted)
          y16 |   2.376012   .5112628     4.65   0.000     1.370365    3.381659
          y17 |          0  (omitted)
          y18 |          0  (omitted)
          y19 |          0  (omitted)
          y20 |          0  (omitted)
          y21 |   2.587825   .4592152     5.64   0.000     1.684555    3.491095
          y22 |   2.647825   .4592152     5.77   0.000     1.744555    3.551095
          y23 |          0  (omitted)
          y24 |   2.577738   .8053512     3.20   0.002     .9936233    4.161853
          y25 |          0  (omitted)
          y26 |   3.977387   .4705359     8.45   0.000      3.05185    4.902925
          y27 |   2.306012   .7487676     3.08   0.002     .8331966    3.778828
          y28 |          0  (omitted)
          y29 |          0  (omitted)
          y30 |    3.44326    .609847     5.65   0.000     2.243699     4.64282
          y31 |    3.10326    .609847     5.09   0.000     1.903699     4.30282
          y32 |   2.039887   2.535246     0.80   0.422    -2.946907    7.026682
          y33 |    4.31326    .609847     7.07   0.000     3.113699     5.51282
          y34 |   .5252506   .8887829     0.59   0.555    -1.222973    2.273475
          y35 |   1.010157   .8617755     1.17   0.242    -.6849437    2.705258
          y36 |   2.572387   .4705199     5.47   0.000     1.646881    3.497893
          y37 |   3.339625   .5868541     5.69   0.000     2.185291    4.493959
          y38 |   3.092387   .4705199     6.57   0.000     2.166881    4.017893
          y39 |   3.652387   .5358006     6.82   0.000     2.598475      4.7063
          y40 |   4.376023   .8257641     5.30   0.000     2.751757     6.00029
          y41 |   3.191786     .53367     5.98   0.000     2.142065    4.241508
          y42 |   3.762929   .5744475     6.55   0.000     2.632999     4.89286
          y43 |   3.254053   .5527874     5.89   0.000     2.166727    4.341378
          y44 |   3.538166   .7803955     4.53   0.000     2.003139    5.073194
          y45 |       3.21          .        .       .            .           .
          y46 |   3.151107   .5956821     5.29   0.000     1.979408    4.322806
          y47 |   2.076933   .5253575     3.95   0.000     1.043562    3.110304
          y48 |   4.174707    .845514     4.94   0.000     2.511593    5.837822
          y49 |   1.278295   .9008362     1.42   0.157    -.4936381    3.050227
          y50 |   2.362222   .6653546     3.55   0.000     1.053479    3.670966
          y51 |   1.711288   .8755428     1.95   0.051    -.0108932    3.433469
          y52 |   2.819958   .8760212     3.22   0.001     1.096836     4.54308
          y53 |   1.845807   .6659833     2.77   0.006      .535827    3.155787
          y54 |   4.121324    2.05828     2.00   0.046     .0727146    8.169933
          y55 |   3.717214   2.702057     1.38   0.170    -1.597695    9.032123
          y56 |   2.531114   .7738501     3.27   0.001     1.008961    4.053266
          y57 |   1.671002   .6407515     2.61   0.010     .4106524    2.931351
          y58 |   3.559712   .8276517     4.30   0.000     1.931732    5.187692
          y59 |   2.968251    .781878     3.80   0.000     1.430308    4.506195
          y60 |   3.344723   .6760204     4.95   0.000        2.015    4.674446
          y61 |   3.263228   .6294663     5.18   0.000     2.025077     4.50138
          y62 |   4.517825   .7601926     5.94   0.000     3.022536    6.013113
        _cons |  -1.194562   .3968007    -3.01   0.003    -1.975064   -.4140609
-------------------------------------------------------------------------------

. eststo MODELENGB

. 
. *(Test set)
. *1-linealidad: Se consideró que debido a los hallazgos anteriores y al ser tod
> as las nuevas variables dummies, está prueba es incesesaria, se asume linealid
> ad.
. 
. *2-homocedasticidad: En este caso podemos obervar que los errores pueden no es
> tan correlacionados con los valores ajusdatos.
. rvfplot

. *3-variable omitida: En este caso, no Puedo rechazar H0 con más del 95% de con
> fianza. Por lo que a ese nivel de significancia, no hay sesgo de omisión de va
> riables.
. ovtest

Ramsey RESET test using powers of the fitted values of spread
       Ho:  model has no omitted variables
                 F(3, 336) =      1.60
                  Prob > F =      0.1887

. *4-error de especificación: _hatsq es significatica con un p value de .477, po
> r lo que no rechazamos H0 (no rechazamos que no tengamos error de especifícaci
> ón)
. linktest

      Source |       SS           df       MS      Number of obs   =       409
-------------+----------------------------------   F(2, 406)       =     36.20
       Model |  1062.39348         2  531.196742   Prob > F        =    0.0000
    Residual |  5958.14485       406  14.6752336   R-squared       =    0.1513
-------------+----------------------------------   Adj R-squared   =    0.1471
       Total |  7020.53833       408  17.2072018   Root MSE        =    3.8308

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |   1.006321   .1511047     6.66   0.000     .7092754    1.303366
      _hatsq |  -.0018364   .0275909    -0.07   0.947    -.0560752    .0524024
       _cons |  -.0006483   .2865305    -0.00   0.998    -.5639168    .5626202
------------------------------------------------------------------------------

. *5-multicolinealidad: Definitivamente tenemos un problema de multicolinealidad
>  con las variables que agregamos, pues 17 de ellas presentan una VIF mayor a 1
> 0.
. vif 

    Variable |       VIF       1/VIF  
-------------+----------------------
         c42 |    110.38    0.009059
         c15 |     94.44    0.010589
         y60 |     64.22    0.015572
         y59 |     60.77    0.016455
         y54 |     48.05    0.020810
         y50 |     42.42    0.023573
         y45 |     41.63    0.024019
         y57 |     40.62    0.024619
         y55 |     38.76    0.025802
         y53 |     38.75    0.025805
         y61 |     34.95    0.028615
         y58 |     34.93    0.028631
         y42 |     34.81    0.028725
         y44 |     34.81    0.028730
         y52 |     31.09    0.032162
         y56 |     29.18    0.034269
         y41 |     29.10    0.034369
         y49 |     27.31    0.036616
         y43 |     27.16    0.036812
         y48 |     25.34    0.039470
         c44 |     25.33    0.039485
         y47 |     23.19    0.043118
         y51 |     21.37    0.046804
         y46 |     19.95    0.050118
         c31 |     14.81    0.067530
         y35 |     11.35    0.088101
         y40 |     11.27    0.088745
         y37 |     11.27    0.088767
         c14 |      9.63    0.103853
         y32 |      9.25    0.108074
          c7 |      7.50    0.133310
         y16 |      7.19    0.139123
         y27 |      7.19    0.139123
          c9 |      5.30    0.188816
         y26 |      5.15    0.194293
         y39 |      5.15    0.194293
         y62 |      5.14    0.194569
         c23 |      5.06    0.197606
         c27 |      4.32    0.231478
         c17 |      4.18    0.239147
         c25 |      4.13    0.241975
         y24 |      3.42    0.292789
         c39 |      3.24    0.308196
          c8 |      3.24    0.308651
          c2 |      3.23    0.309607
         y34 |      3.21    0.311248
         c26 |      3.20    0.312266
          c4 |      3.19    0.313550
         y30 |      3.17    0.315927
         y31 |      3.17    0.315927
         y33 |      3.17    0.315927
         y36 |      3.08    0.324829
         y38 |      3.08    0.324829
         y21 |      3.07    0.325217
         y22 |      3.07    0.325217
num_lawyer~0 |      2.74    0.364880
         c24 |      2.35    0.426345
         c20 |      2.26    0.442222
         c10 |      2.19    0.456242
         c18 |      2.19    0.456242
         c41 |      2.14    0.466664
         c35 |      2.14    0.467386
         c22 |      2.13    0.468819
          c3 |      2.13    0.469249
         c36 |      2.12    0.471271
         c13 |      2.01    0.497536
         c38 |      2.01    0.497536
          c5 |      2.01    0.497536
num_lawye~_2 |      1.42    0.702245
-------------+----------------------
    Mean VIF |     17.11

. *6-outliers: en el caso de outliers, detectamos algunos casos alejados pero no
>  son tan evidentes como en los ejercicios pasados.
. avplot y40

. avplot num_lawyers_2

. 
. *7-normalidad: En cuanto a normalidad, la distribución no se asemeja a una nor
> mal.
. drop e

. predict e, resid
(133 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |        409    0.40733    166.445    12.183    0.00000

. 
. *Conclusión: Para el caso de el modelo modelENG2 de la submuestra con ley ingl
> esa, tenemos algunos outliers pero poco relevantes o extremos.Asimismo, no ten
> emos sesgo de omisión ni error de especificación.
. 
. *Comparación final
. 
. esttab, b(a6) p(4) r2(4) nostar wide

--------------------------------------------------------------------------------
> ------------------------------------
                      (1)                       (2)                       (3)   
>                     (4)             
                   spread                    spread                    spread   
>                  spread             
--------------------------------------------------------------------------------
> ------------------------------------
aaa             -1.745589     (0.0001)                              -2.326617   
>   (0.0001)                          
aa              -1.589683     (0.0001)                              -1.309180   
>   (0.0010)                          
a               -0.396524     (0.0876)                              -1.088017   
>   (0.0153)                          
bb               1.417126     (0.0000)                               2.767110   
>   (0.0578)                          
b                2.469187     (0.0000)                               2.623270   
>   (0.0001)                          
num_lawye~_2     0.388885     (0.1163)     2.088808     (0.0000)    -0.427044   
>   (0.5499)     1.144562     (0.0042)
num_lawyer~0            0          (.)    -3.175000     (0.0000)     0.402605   
>   (0.5913)     0.564649     (0.4361)
c2                      0          (.)            0          (.)     2.226075   
>   (0.1355)    -0.564601     (0.7252)
c3                      0          (.)            0          (.)    -2.223961   
>   (0.0001)    -2.758166     (0.0005)
c4                      0          (.)            0          (.)     0.773450   
>   (0.4239)    -1.390548     (0.0913)
c5                      0          (.)            0          (.)    -1.630754   
>   (0.0389)    -4.135438     (0.0000)
c6                      0          (.)            0          (.)            0   
>        (.)            0          (.)
c7                      0          (.)            0          (.)     1.924812   
>   (0.0131)    -0.316963     (0.5861)
c8                      0          (.)            0          (.)    -0.375515   
>   (0.8079)    -4.014126     (0.0000)
c9                      0          (.)            0          (.)     0.490657   
>   (0.6321)    -1.968316     (0.0031)
c10                     0          (.)            0          (.)     2.421847   
>   (0.0240)    -0.390145     (0.6921)
c11                     0          (.)            0          (.)            0   
>        (.)            0          (.)
c12                     0          (.)            0          (.)            0   
>        (.)            0          (.)
c13                     0          (.)            0          (.)     1.199246   
>   (0.1282)    -1.305438     (0.0011)
c14                     0          (.)    -4.881826     (0.0000)     1.397474   
>   (0.0175)    -0.200688     (0.8289)
c15             -1.403842     (0.0710)    -4.630237     (0.0000)     0.343455   
>   (0.7449)     0.390807     (0.6039)
c16                     0          (.)            0          (.)            0   
>        (.)            0          (.)
c17                     0          (.)            0          (.)     1.569439   
>   (0.0721)    -0.793450     (0.1765)
c18                     0          (.)            0          (.)     1.791847   
>   (0.0942)    -1.020145     (0.3007)
c19                     0          (.)            0          (.)            0   
>        (.)            0          (.)
c20                     0          (.)            0          (.)     6.133118   
>   (0.0002)     3.508893     (0.0000)
c21              0.603349     (0.4425)    -2.969059     (0.0000)            0   
>        (.)            0          (.)
c22                     0          (.)            0          (.)     3.217058   
>   (0.0002)     3.542340     (0.0000)
c23                     0          (.)            0          (.)     2.469660   
>   (0.0182)     2.259282     (0.0429)
c24                     0          (.)            0          (.)     0.846641   
>   (0.4173)    -1.820087     (0.0138)
c25                     0          (.)            0          (.)    -0.101969   
>   (0.9282)    -1.655325     (0.0116)
c26                     0          (.)            0          (.)     1.547805   
>   (0.4353)     0.725252     (0.3884)
c27                     0          (.)            0          (.)     1.247409   
>   (0.2476)    -0.928920     (0.1464)
c28                     0          (.)            0          (.)            0   
>        (.)            0          (.)
c29                     0          (.)            0          (.)            0   
>        (.)            0          (.)
c30             -1.613709     (0.0500)    -4.292447     (0.0000)            0   
>        (.)            0          (.)
c31                     0          (.)            0          (.)     1.539186   
>   (0.0352)     0.451303     (0.5038)
c32              1.293305     (0.2703)    -1.775707     (0.2265)            0   
>        (.)            0          (.)
c33              4.654310     (0.0000)     0.910144     (0.0790)            0   
>        (.)            0          (.)
c34              4.343417     (0.0000)     0.247553     (0.6561)            0   
>        (.)            0          (.)
c35                     0          (.)            0          (.)     3.026220   
>   (0.0062)     1.756772     (0.0056)
c36                     0          (.)            0          (.)     0.189466   
>   (0.8360)    -0.393689     (0.5766)
c37                     0          (.)            0          (.)            0   
>        (.)            0          (.)
c38                     0          (.)            0          (.)    -1.550754   
>   (0.0495)    -4.055438     (0.0000)
c39                     0          (.)            0          (.)     0.121841   
>   (0.9129)    -2.070161     (0.0017)
c40             -3.105031     (0.0000)    -7.654594     (0.0000)            0   
>        (.)            0          (.)
c41                     0          (.)            0          (.)     13.69854   
>   (0.0000)     11.55356     (0.0000)
c42             -0.461122     (0.5128)    -3.724564     (0.0000)     0.233292   
>   (0.7130)    -0.487825     (0.2889)
c43                     0          (.)            0          (.)            0   
>        (.)            0          (.)
c44             -3.282575     (0.0026)    -7.495117     (0.0000)    -2.408131   
>   (0.0010)    -4.043142     (0.0000)
y2                      0          (.)            0          (.)            0   
>        (.)            0          (.)
y3                      0          (.)            0          (.)            0   
>        (.)            0          (.)
y4                      0          (.)            0          (.)            0   
>        (.)            0          (.)
y5                      0          (.)            0          (.)            0   
>        (.)            0          (.)
y6                      0          (.)            0          (.)            0   
>        (.)            0          (.)
y7                      0          (.)            0          (.)            0   
>        (.)            0          (.)
y8                      0          (.)            0          (.)            0   
>        (.)            0          (.)
y9                      0          (.)            0          (.)            0   
>        (.)            0          (.)
y10                     0          (.)            0          (.)            0   
>        (.)            0          (.)
y11                     0          (.)            0          (.)            0   
>        (.)            0          (.)
y12                     0          (.)            0          (.)            0   
>        (.)            0          (.)
y13                     0          (.)            0          (.)            0   
>        (.)            0          (.)
y14                     0          (.)            0          (.)            0   
>        (.)            0          (.)
y15                     0          (.)            0          (.)            0   
>        (.)            0          (.)
y16                     0          (.)            0          (.)     1.844481   
>   (0.1158)     2.376012     (0.0000)
y17             -0.264532     (0.7152)     1.150000     (0.0000)            0   
>        (.)            0          (.)
y18                     0          (.)   -0.0700000          (.)            0   
>        (.)            0          (.)
y19                     0          (.)     1.142500     (0.0000)            0   
>        (.)            0          (.)
y20                     0          (.)            0          (.)            0   
>        (.)            0          (.)
y21                     0          (.)     1.785000     (0.0000)            0   
>        (.)     2.587825     (0.0000)
y22                     0          (.)            0          (.)            0   
>        (.)     2.647825     (0.0000)
y23                     0          (.)     0.657500     (0.0002)            0   
>        (.)            0          (.)
y24                     0          (.)            0          (.)            0   
>        (.)     2.577738     (0.0015)
y25                     0          (.)     0.300000     (0.0003)            0   
>        (.)            0          (.)
y26             -3.573661     (0.0000)    -0.318808     (0.2308)            0   
>        (.)     3.977387     (0.0000)
y27                     0          (.)            0          (.)            0   
>        (.)     2.306012     (0.0022)
y28             -1.143333     (0.0000)    -0.403333     (0.0000)            0   
>        (.)            0          (.)
y29                     0          (.)            0          (.)            0   
>        (.)            0          (.)
y30                     0          (.)            0          (.)            0   
>        (.)     3.443260     (0.0000)
y31                     0          (.)    -1.468808     (0.0000)            0   
>        (.)     3.103260     (0.0000)
y32                     0          (.)            0          (.)    -7.622563   
>   (0.0000)     2.039887     (0.4216)
y33                     0          (.)            0          (.)            0   
>        (.)     4.313260     (0.0000)
y34                     0          (.)            0          (.)            0   
>        (.)     0.525251     (0.5549)
y35             -1.338885     (0.0000)    -2.298808     (0.0000)    -1.786221   
>   (0.1249)     1.010157     (0.2419)
y36             -1.464895     (0.0000)    -1.249523     (0.0322)     0.497437   
>   (0.3588)     2.572387     (0.0000)
y37                     0          (.)     0.740000          (.)     0.601568   
>   (0.2509)     3.339625     (0.0000)
y38             -0.740000          (.)            0          (.)            0   
>        (.)     3.092387     (0.0000)
y39             -2.554474     (0.0000)    -1.768808     (0.0000)    -0.205172   
>   (0.6365)     3.652387     (0.0000)
y40             -2.117949     (0.0000)    -2.264564     (0.0000)     0.106374   
>   (0.8604)     4.376023     (0.0000)
y41             -1.718753     (0.0155)    -0.169404     (0.3034)    0.0572122   
>   (0.8939)     3.191786     (0.0000)
y42             -2.676600     (0.0000)    -0.473808     (0.1029)     0.186911   
>   (0.6683)     3.762929     (0.0000)
y43             -2.117527     (0.0008)    -0.490577     (0.2105)    -0.802193   
>   (0.0662)     3.254053     (0.0000)
y44             -1.767028     (0.0174)     0.747263     (0.2646)    -1.871993   
>   (0.0000)     3.538166     (0.0000)
y45             -3.313188     (0.0914)     0.265596     (0.9024)    -1.665954   
>   (0.0054)     3.210000          (.)
y46             -1.774964     (0.0005)    -0.104863     (0.8021)    -1.581962   
>   (0.0061)     3.151107     (0.0000)
y47             -2.623682     (0.0000)    -0.682098     (0.0700)    -1.915515   
>   (0.0000)     2.076933     (0.0001)
y48             -0.707621     (0.1960)     1.272104     (0.0056)    -1.008555   
>   (0.1250)     4.174707     (0.0000)
y49             -0.217970     (0.6532)     1.657325     (0.0001)    -1.666126   
>   (0.0014)     1.278295     (0.1568)
y50             -1.107431     (0.0425)     0.960045     (0.0671)    -0.992947   
>   (0.0067)     2.362222     (0.0004)
y51             -0.843247     (0.0651)     1.344986     (0.0005)    -0.787442   
>   (0.0941)     1.711288     (0.0515)
y52             -0.513447     (0.2216)     1.479574     (0.0004)    -0.779161   
>   (0.0530)     2.819958     (0.0014)
y53             -1.091471     (0.0192)     0.691789     (0.0808)    -1.254407   
>   (0.0000)     1.845807     (0.0059)
y54             -1.548467     (0.0020)     0.478856     (0.2262)     0.861836   
>   (0.6750)     4.121324     (0.0460)
y55             -1.690565     (0.0002)     0.381222     (0.2847)     0.102272   
>   (0.9698)     3.717214     (0.1698)
y56             -2.467033     (0.0000)     0.216484     (0.5821)    -2.142964   
>   (0.0037)     2.531114     (0.0012)
y57             -2.196072     (0.0000)     0.315687     (0.5005)    -1.827815   
>   (0.0000)     1.671002     (0.0095)
y58             -1.666522     (0.0009)     0.392992     (0.2842)     0.249801   
>   (0.6503)     3.559712     (0.0000)
y59             -0.603339     (0.2062)     0.815551     (0.0243)     1.031262   
>   (0.0491)     2.968251     (0.0002)
y60             -1.599013     (0.0025)    0.0190751     (0.9656)    -0.201113   
>   (0.6986)     3.344723     (0.0000)
y61             -1.245392     (0.0382)   0.00494173     (0.9920)    -0.115064   
>   (0.7594)     3.263228     (0.0000)
y62                     0          (.)            0          (.)     2.231872   
>   (0.0170)     4.517825     (0.0000)
_cons            3.586711     (0.0000)     4.364564     (0.0000)     2.485888   
>   (0.0012)    -1.194562     (0.0028)
--------------------------------------------------------------------------------
> ------------------------------------
N                     422                       445                       376   
>                     409             
R-sq               0.6145                    0.4463                    0.2594   
>                  0.1513             
--------------------------------------------------------------------------------
> ------------------------------------
p-values in parentheses

. 
. *La diferencia más notoria fue el uso de la opción Robust que realiza una regr
> esión ponderada, donde el valor de los outliers tiene menor peso en la estimac
> ión de los parámetros. 
. 
. *Además, partir el modelo en submuestras fue muy util para controlar para los 
> casos outliers que eran tan extremos que han podido hacer que un modelo falle 
> el test Bresuch-Pagan, e icnluso alejaban más la distribución de los errores p
> ara que se pareciera a una normal. Asimismo, gracias a las nuevas variables, a
>  la división de la muestra y a la opción Robust, los nuevos modelos lograron a
> umentar su r^2, por ejemplo las r^2 para los modelos A y B de la juridicción e
> stadounidense alcanzaron un valor de .6145 y .4463 respectivamente.
. 
. *Sin embargo, muchas variables se omitieron debido a la estimación de la regre
> sión con la opción robust, además el agregar demasiadas variables dummies hizo
>  que estos modelos tuvieran problemas graves de multicolinealidad, así como de
>  especificación y de omisión de variables.
. 
. 
. 
. *VI
. 
. *Agregamos a las regresiones las variables exclusivas de Bonos2 [ debtservicee
> xports gdpgrowth standarddeviationofexportgrowth ratioofshorttermdebttototalde
> bt reservesshorttermdebt ratioofdomesticcredittogdp ratioofreservesimports deb
> trescheduledinpreviousyear ratioofreservesgdp standarddeviationofexportgrowth2
> ].
. *Comenzamos un análisis identico al anterior primero con la regresión que cont
> empla al rating.
. *MODEL5A
. 
. clear

. eststo clear

. use ej5 

. 
. regress spread aaa aa a bb b num_lawyers_2 num_lawyers_0 c2-c44 y2-y62 debtser
> viceexports gdpgrowth standarddeviationofexportgrowth ratioofshorttermdebttoto
> taldebt reservesshorttermdebt ratioofdomesticcredittogdp ratioofreservesimport
> s debtrescheduledinpreviousyear ratioofreservesgdp standarddeviationofexportgr
> owth2, robust
note: c11 omitted because of collinearity
note: c12 omitted because of collinearity
note: c19 omitted because of collinearity
note: c28 omitted because of collinearity
note: c35 omitted because of collinearity
note: c37 omitted because of collinearity
note: c43 omitted because of collinearity
note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y16 omitted because of collinearity
note: y17 omitted because of collinearity
note: y18 omitted because of collinearity
note: y19 omitted because of collinearity
note: y20 omitted because of collinearity
note: y21 omitted because of collinearity
note: y22 omitted because of collinearity
note: y23 omitted because of collinearity
note: y24 omitted because of collinearity
note: y25 omitted because of collinearity
note: y26 omitted because of collinearity
note: y27 omitted because of collinearity
note: y28 omitted because of collinearity
note: y29 omitted because of collinearity
note: y30 omitted because of collinearity
note: y31 omitted because of collinearity
note: y32 omitted because of collinearity
note: y34 omitted because of collinearity
note: y37 omitted because of collinearity
note: y61 omitted because of collinearity
note: y62 omitted because of collinearity

Linear regression                               Number of obs     =        766
                                                F(59, 686)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3602
                                                Root MSE          =     2.8401

-------------------------------------------------------------------------------
              |               Robust
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
          aaa |  -1.223249   .2876359    -4.25   0.000    -1.788002    -.658497
           aa |  -1.110918   .3071643    -3.62   0.000    -1.714013    -.507823
            a |  -.8449601   .2334097    -3.62   0.000    -1.303243   -.3866769
           bb |   1.339445    .411611     3.25   0.001     .5312768    2.147614
            b |   1.952108   .2752657     7.09   0.000     1.411644    2.492572
num_lawyers_2 |  -.2156972   .5342508    -0.40   0.687     -1.26466    .8332658
num_lawyers_0 |  -.7549344   .4930067    -1.53   0.126    -1.722917    .2130487
           c2 |    1.85004   .9922566     1.86   0.063    -.0981847    3.798264
           c3 |  -.0405632   1.285793    -0.03   0.975    -2.565126       2.484
           c4 |   .4668601   .4760727     0.98   0.327    -.4678744    1.401595
           c5 |  -2.104528   .3003954    -7.01   0.000    -2.694333   -1.514723
           c6 |   .9996492   .4703726     2.13   0.034     .0761064    1.923192
           c7 |   1.579828   .5043436     3.13   0.002      .589586    2.570071
           c8 |  -.0370434   .7843151    -0.05   0.962     -1.57699    1.502903
           c9 |   .4973044   .3788665     1.31   0.190    -.2465727    1.241182
          c10 |   1.678092    .802316     2.09   0.037     .1028019    3.253381
          c11 |          0  (omitted)
          c12 |          0  (omitted)
          c13 |   .8350155   .2783093     3.00   0.003     .2885752    1.381456
          c14 |    1.34907   .5483766     2.46   0.014      .272372    2.425768
          c15 |   .2329129   .5703717     0.41   0.683    -.8869708    1.352797
          c16 |   1.975939   .9164151     2.16   0.031     .1766238    3.775254
          c17 |   .9825684   .3826336     2.57   0.010     .2312948    1.733842
          c18 |   1.134986   .9095739     1.25   0.213    -.6508968    2.920869
          c19 |          0  (omitted)
          c20 |   5.818973   .6723984     8.65   0.000     4.498767    7.139179
          c21 |   2.195499   .4934712     4.45   0.000     1.226604    3.164394
          c22 |   2.447803    .626064     3.91   0.000     1.218572    3.677035
          c23 |   2.825962   .8394003     3.37   0.001      1.17786    4.474065
          c24 |   1.111925   .8936124     1.24   0.214    -.6426184    2.866469
          c25 |  -.0940288   .8108634    -0.12   0.908    -1.686101    1.498043
          c26 |   1.674807   1.212869     1.38   0.168    -.7065747    4.056188
          c27 |   .7549641     .53724     1.41   0.160     -.299868    1.809796
          c28 |          0  (omitted)
          c29 |   4.327485   .9314374     4.65   0.000     2.498674    6.156295
          c30 |  -.7313438   .5084766    -1.44   0.151    -1.729701    .2670136
          c31 |   1.531652   .5053251     3.03   0.003     .5394826    2.523822
          c32 |   1.879268   .6487926     2.90   0.004       .60541    3.153125
          c33 |   5.428882   .5568468     9.75   0.000     4.335553    6.522211
          c34 |   5.324043   .5059396    10.52   0.000     4.330668    6.317419
          c35 |          0  (omitted)
          c36 |   .4611674   .5144316     0.90   0.370     -.548882    1.471217
          c37 |          0  (omitted)
          c38 |   -1.78265   .2851393    -6.25   0.000    -2.342501     -1.2228
          c39 |  -.4129795   .5228922    -0.79   0.430    -1.439641    .6136817
          c40 |   -.783579   .5329532    -1.47   0.142    -1.829994    .2628362
          c41 |   13.35341   .5013715    26.63   0.000       12.369    14.33782
          c42 |   .1614591   .4044361     0.40   0.690    -.6326221    .9555404
          c43 |          0  (omitted)
          c44 |  -2.434931   .4818991    -5.05   0.000    -3.381106   -1.488757
           y2 |          0  (omitted)
           y3 |          0  (omitted)
           y4 |          0  (omitted)
           y5 |          0  (omitted)
           y6 |          0  (omitted)
           y7 |          0  (omitted)
           y8 |          0  (omitted)
           y9 |          0  (omitted)
          y10 |          0  (omitted)
          y11 |          0  (omitted)
          y12 |          0  (omitted)
          y13 |          0  (omitted)
          y14 |          0  (omitted)
          y15 |          0  (omitted)
          y16 |          0  (omitted)
          y17 |          0  (omitted)
          y18 |          0  (omitted)
          y19 |          0  (omitted)
          y20 |          0  (omitted)
          y21 |          0  (omitted)
          y22 |          0  (omitted)
          y23 |          0  (omitted)
          y24 |          0  (omitted)
          y25 |          0  (omitted)
          y26 |          0  (omitted)
          y27 |          0  (omitted)
          y28 |          0  (omitted)
          y29 |          0  (omitted)
          y30 |          0  (omitted)
          y31 |          0  (omitted)
          y32 |          0  (omitted)
          y33 |   5.495328   .6244605     8.80   0.000     4.269245    6.721411
          y34 |          0  (omitted)
          y35 |   5.229724   .7572137     6.91   0.000      3.74299    6.716459
          y36 |   5.204666   .7901874     6.59   0.000      3.65319    6.756142
          y37 |          0  (omitted)
          y38 |   3.238019   .8054978     4.02   0.000     1.656482    4.819556
          y39 |   4.182392   .9873344     4.24   0.000     2.243832    6.120952
          y40 |   5.187703   .7260126     7.15   0.000      3.76223    6.613177
          y41 |    6.11232   .3893945    15.70   0.000     5.347772    6.876869
          y42 |   6.024467   .4507613    13.37   0.000      5.13943    6.909505
          y43 |   5.378184   .6248041     8.61   0.000     4.151426    6.604942
          y44 |    4.03752   .8164264     4.95   0.000     2.434526    5.640515
          y45 |   4.453111    .755807     5.89   0.000     2.969138    5.937084
          y46 |   4.222877   .8133736     5.19   0.000     2.625877    5.819878
          y47 |   3.878802   .6586722     5.89   0.000     2.585547    5.172058
          y48 |    5.38449   .6418875     8.39   0.000      4.12419    6.644789
          y49 |   4.963124   .8241642     6.02   0.000     3.344936    6.581311
          y50 |   4.691543   .8358722     5.61   0.000     3.050368    6.332718
          y51 |   5.408024   .6207235     8.71   0.000     4.189278     6.62677
          y52 |   5.494554   .6940887     7.92   0.000     4.131761    6.857347
          y53 |   5.105413    .742792     6.87   0.000     3.646995    6.563832
          y54 |   5.774039    .798576     7.23   0.000     4.206093    7.341986
          y55 |   5.480935   .8990481     6.10   0.000     3.715719    7.246151
          y56 |   3.396388   1.002097     3.39   0.001     1.428841    5.363934
          y57 |   3.627327   .8482471     4.28   0.000     1.961855    5.292799
          y58 |   5.074985   .6412192     7.91   0.000     3.815997    6.333973
          y59 |   6.318105   .5101704    12.38   0.000     5.316423    7.319788
          y60 |    5.25179   .6004908     8.75   0.000     4.072769     6.43081
          y61 |          0  (omitted)
          y62 |          0  (omitted)
debtservice~s |   .0365881    .011336     3.23   0.001     .0143307    .0588455
    gdpgrowth |   14.45301   19.49592     0.74   0.459    -23.82582    52.73184
standarddev~h |   .0267652   .0156462     1.71   0.088     -.003955    .0574853
ratioofshor~t |   .0150557   .0181112     0.83   0.406    -.0205044    .0506157
reservessho~t |  -.0000146   .0029886    -0.00   0.996    -.0058825    .0058533
ratioofdome~p |  -.0012627   .0015813    -0.80   0.425    -.0043674    .0018421
ratioofrese~s |  -.0014401   .0039796    -0.36   0.718    -.0092538    .0063735
debtresched~r |  -.2364237   .3716018    -0.64   0.525    -.9660371    .4931898
ratioofrese~p |   .0045353   .0096868     0.47   0.640    -.0144841    .0235547
standarddev~2 |  -.0001488   .0001728    -0.86   0.390    -.0004881    .0001905
        _cons |  -3.994384   .7102531    -5.62   0.000    -5.388915   -2.599853
-------------------------------------------------------------------------------

. eststo MODEL6A

. 
. *(Test set)
. *1-linealidad: primero observamos en una matriz general (solo de los valores n
> uevos) y luego averiguamos por las scatterplots más sopechosas. Se concluye qu
> e las relaciones son lineales.
. graph matrix spread debtserviceexports gdpgrowth standarddeviationofexportgrow
> th ratioofshorttermdebttototaldebt reservesshorttermdebt ratioofdomesticcredit
> togdp ratioofreservesimports debtrescheduledinpreviousyear ratioofreservesgdp 
> standarddeviationofexportgrowth2

. 
. *2-homocedasticidad:Ténemos algunos casos outliers los cuales si omitimos, log
> raríamos que el modelo fuera homocedastico.
. rvfplot

. *3-variable omitida: En esto caso rechazamos H0 con más del 99% de confianza, 
> es decir rechazamos que el modelo no tenga variables omitidas.
.  ovtest

Ramsey RESET test using powers of the fitted values of spread
       Ho:  model has no omitted variables
                 F(3, 683) =      4.42
                  Prob > F =      0.0044

. *4-error de especificación: el valor p del hatsq es de .162, es decir signific
> ante, por lo que rechazamos H0, rechazamos que el modelo no tenga valores omit
> idos.
. linktest

      Source |       SS           df       MS      Number of obs   =       766
-------------+----------------------------------   F(2, 763)       =    216.29
       Model |   3128.9485         2  1564.47425   Prob > F        =    0.0000
    Residual |  5519.04486       763  7.23334844   R-squared       =    0.3618
-------------+----------------------------------   Adj R-squared   =    0.3601
       Total |  8647.99336       765  11.3045665   Root MSE        =    2.6895

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |   .9067194   .0822181    11.03   0.000     .7453189     1.06812
      _hatsq |   .0212685   .0151885     1.40   0.162    -.0085478    .0510847
       _cons |   .0157862   .1447524     0.11   0.913    -.2683739    .2999464
------------------------------------------------------------------------------

. *5-multicolinealidad:  El modelo tiene 27 parámetros con un VIF mayor a 10 lo 
> cuál indica que hay un problema grave de multicolinealidad.
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
         c42 |    193.94    0.005156
         c15 |    117.13    0.008537
         y60 |     66.65    0.015003
          c9 |     58.79    0.017010
         y59 |     53.69    0.018627
         y50 |     53.15    0.018815
         y54 |     52.97    0.018880
         y52 |     44.67    0.022384
         y55 |     44.61    0.022417
         y53 |     43.88    0.022787
         y51 |     41.89    0.023871
         y49 |     37.15    0.026919
         y57 |     36.30    0.027550
         y56 |     35.57    0.028117
         y46 |     34.79    0.028746
         y45 |     34.06    0.029361
         y47 |     32.22    0.031041
         y58 |     30.09    0.033233
         y42 |     29.48    0.033924
         y43 |     28.08    0.035608
         y44 |     25.61    0.039044
         y48 |     25.60    0.039066
         c44 |     20.68    0.048361
         c40 |     13.62    0.073419
         c17 |     13.43    0.074486
         c31 |     12.38    0.080770
         y41 |     12.04    0.083050
         c14 |      8.31    0.120322
         y40 |      8.23    0.121457
          c7 |      7.37    0.135618
         y39 |      6.22    0.160692
standardde~h |      5.84    0.171145
standardde~2 |      5.25    0.190561
         c23 |      5.06    0.197625
         y38 |      4.73    0.211450
ratioofsho~t |      4.45    0.224469
         c27 |      4.26    0.234891
         c24 |      4.22    0.236827
         c32 |      4.19    0.238851
         c25 |      4.13    0.242343
reservessh~t |      4.12    0.242480
num_lawyer~0 |      3.82    0.261701
          aa |      3.71    0.269887
         c29 |      3.21    0.311189
         c39 |      3.19    0.313229
          c2 |      3.17    0.314972
         c26 |      3.15    0.316999
          c3 |      3.15    0.317846
          c8 |      3.11    0.322016
          c5 |      3.07    0.325659
         aaa |      3.06    0.326559
num_lawye~_2 |      2.93    0.341301
debtservic~s |      2.80    0.357573
          bb |      2.71    0.369287
         c16 |      2.62    0.381749
ratioofdom~p |      2.28    0.438847
ratioofres~p |      2.24    0.447216
         y33 |      2.16    0.463614
         c18 |      2.16    0.463902
ratioofres~s |      2.15    0.465107
           b |      2.15    0.465845
         c10 |      2.14    0.467582
         c34 |      2.12    0.472089
         c33 |      2.11    0.472996
         c20 |      2.11    0.474061
         c22 |      2.11    0.474764
          c4 |      2.11    0.474808
         c41 |      2.11    0.474994
          c6 |      2.10    0.476028
         c36 |      2.10    0.477090
         c21 |      2.10    0.477225
         c30 |      2.08    0.481412
         y35 |      2.07    0.482255
         y36 |      2.07    0.482321
         c13 |      2.03    0.491966
         c38 |      2.03    0.492089
   gdpgrowth |      2.02    0.495967
           a |      1.94    0.514479
debtresche~r |      1.39    0.720165
-------------+----------------------
    Mean VIF |     17.25

. *6-outliers :Detectamos un grupo de outliers.
. avplot aaa 

. avplot b

. avplot ratioofdomesticcredittogdp

. 
. *7-normalidad: Asimismo, con el test Shapiro-Wilk concluímos que los errores n
> o se distribuyen de forma normal.
. predict e, resid
(721 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |        766    0.39468    299.561    13.966    0.00000

. 
. *Ahora haremos el análisis para el segundo modelo (aquel que no contempla los 
> ratings).
. *MODEL5B
. 
. regress spread num_lawyers_2 num_lawyers_0 c2-c44 y2-y62 debtserviceexports gd
> pgrowth standarddeviationofexportgrowth ratioofshorttermdebttototaldebt reserv
> esshorttermdebt ratioofdomesticcredittogdp ratioofreservesimports debtreschedu
> ledinpreviousyear ratioofreservesgdp standarddeviationofexportgrowth2, robust
note: c11 omitted because of collinearity
note: c12 omitted because of collinearity
note: c19 omitted because of collinearity
note: c28 omitted because of collinearity
note: c35 omitted because of collinearity
note: c37 omitted because of collinearity
note: c43 omitted because of collinearity
note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y16 omitted because of collinearity
note: y17 omitted because of collinearity
note: y18 omitted because of collinearity
note: y19 omitted because of collinearity
note: y20 omitted because of collinearity
note: y21 omitted because of collinearity
note: y22 omitted because of collinearity
note: y23 omitted because of collinearity
note: y24 omitted because of collinearity
note: y25 omitted because of collinearity
note: y26 omitted because of collinearity
note: y27 omitted because of collinearity
note: y28 omitted because of collinearity
note: y29 omitted because of collinearity
note: y31 omitted because of collinearity
note: y34 omitted because of collinearity
note: y37 omitted because of collinearity
note: y61 omitted because of collinearity
note: y62 omitted because of collinearity

Linear regression                               Number of obs     =        773
                                                F(54, 696)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3182
                                                Root MSE          =     2.9342

-------------------------------------------------------------------------------
              |               Robust
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
num_lawyers_2 |   .6189154   .4773041     1.30   0.195     -.318213    1.556044
num_lawyers_0 |  -.3109783   .4430508    -0.70   0.483    -1.180855    .5588979
           c2 |   1.578546    1.00593     1.57   0.117    -.3964738    3.553566
           c3 |  -.2181749   1.278587    -0.17   0.865    -2.728524    2.292175
           c4 |   .3000514   .5370198     0.56   0.577    -.7543216    1.354424
           c5 |  -2.970116   .5332987    -5.57   0.000    -4.017183   -1.923049
           c6 |   .8800227   .4983388     1.77   0.078    -.0984048     1.85845
           c7 |   1.398755   .4912232     2.85   0.005     .4342981    2.363212
           c8 |  -1.144997   .4694757    -2.44   0.015    -2.066756   -.2232388
           c9 |   .5278104   .3617519     1.46   0.145    -.1824454    1.238066
          c10 |   1.154872   .7925249     1.46   0.146    -.4011539    2.710898
          c11 |          0  (omitted)
          c12 |          0  (omitted)
          c13 |   .4648859   .2914595     1.60   0.111    -.1073593    1.037131
          c14 |   1.723811   .8894544     1.94   0.053    -.0225247    3.470146
          c15 |   .4298432   .5339937     0.80   0.421    -.6185883    1.478275
          c16 |   2.279755   .8170791     2.79   0.005     .6755197    3.883991
          c17 |   .9891698   .4365306     2.27   0.024      .132095    1.846245
          c18 |   .7517125   .9339346     0.80   0.421    -1.081954    2.585379
          c19 |          0  (omitted)
          c20 |   5.699504   .4951707    11.51   0.000     4.727297    6.671711
          c21 |   3.299393   .5434067     6.07   0.000      2.23248    4.366306
          c22 |   2.091996    .794533     2.63   0.009     .5320271    3.651965
          c23 |   2.887885   .7628399     3.79   0.000     1.390142    4.385628
          c24 |    .280997   .8507096     0.33   0.741    -1.389268    1.951262
          c25 |  -.3804683   .7755999    -0.49   0.624    -1.903264    1.142328
          c26 |   1.617413   .8197598     1.97   0.049     .0079147    3.226912
          c27 |   .2039438   .6702441     0.30   0.761    -1.111999    1.519886
          c28 |          0  (omitted)
          c29 |   4.297511   .7690922     5.59   0.000     2.787492     5.80753
          c30 |   .3044588   .4917496     0.62   0.536    -.6610317    1.269949
          c31 |   1.612693    .609849     2.64   0.008     .4153291    2.810058
          c32 |   2.121875   .9514615     2.23   0.026     .2537966    3.989954
          c33 |   5.559036   .5838161     9.52   0.000     4.412784    6.705288
          c34 |   4.817909   .5474861     8.80   0.000     3.742987    5.892831
          c35 |          0  (omitted)
          c36 |   .8848152   .5290088     1.67   0.095    -.1538293     1.92346
          c37 |          0  (omitted)
          c38 |  -1.941583   .3354052    -5.79   0.000    -2.600111   -1.283056
          c39 |   -1.12308   .6025279    -1.86   0.063     -2.30607    .0599105
          c40 |  -.9020938   .5958856    -1.51   0.131    -2.072043     .267855
          c41 |   13.21955   .5121132    25.81   0.000     12.21407    14.22502
          c42 |   .3674752   .4605424     0.80   0.425    -.5367437    1.271694
          c43 |          0  (omitted)
          c44 |  -2.235848   .5514924    -4.05   0.000    -3.318636    -1.15306
           y2 |          0  (omitted)
           y3 |          0  (omitted)
           y4 |          0  (omitted)
           y5 |          0  (omitted)
           y6 |          0  (omitted)
           y7 |          0  (omitted)
           y8 |          0  (omitted)
           y9 |          0  (omitted)
          y10 |          0  (omitted)
          y11 |          0  (omitted)
          y12 |          0  (omitted)
          y13 |          0  (omitted)
          y14 |          0  (omitted)
          y15 |          0  (omitted)
          y16 |          0  (omitted)
          y17 |          0  (omitted)
          y18 |          0  (omitted)
          y19 |          0  (omitted)
          y20 |          0  (omitted)
          y21 |          0  (omitted)
          y22 |          0  (omitted)
          y23 |          0  (omitted)
          y24 |          0  (omitted)
          y25 |          0  (omitted)
          y26 |          0  (omitted)
          y27 |          0  (omitted)
          y28 |          0  (omitted)
          y29 |          0  (omitted)
          y30 |   9.872355   1.547875     6.38   0.000     6.833291    12.91142
          y31 |          0  (omitted)
          y32 |   3.521632   1.655267     2.13   0.034     .2717172    6.771546
          y33 |   8.696895   1.600775     5.43   0.000     5.553969    11.83982
          y34 |          0  (omitted)
          y35 |   8.883205   1.382197     6.43   0.000      6.16943    11.59698
          y36 |   8.877848   1.353723     6.56   0.000     6.219977    11.53572
          y37 |          0  (omitted)
          y38 |   6.491674   1.541134     4.21   0.000     3.465845    9.517503
          y39 |   7.145487   1.453331     4.92   0.000     4.292049    9.998925
          y40 |   8.580082   1.370973     6.26   0.000     5.888344    11.27182
          y41 |   9.810321   1.566495     6.26   0.000     6.734699    12.88594
          y42 |   9.918861   1.539706     6.44   0.000     6.895835    12.94189
          y43 |   9.119073   1.396175     6.53   0.000     6.377852    11.86029
          y44 |   8.688178   1.343538     6.47   0.000     6.050305    11.32605
          y45 |   8.574417   1.312907     6.53   0.000     5.996684    11.15215
          y46 |   8.089865   1.256343     6.44   0.000     5.623188    10.55654
          y47 |   7.893766   1.411633     5.59   0.000     5.122197    10.66534
          y48 |   9.625262   1.548859     6.21   0.000     6.584265    12.66626
          y49 |   8.945463   1.352639     6.61   0.000     6.289722     11.6012
          y50 |   8.741044   1.327359     6.59   0.000     6.134937    11.34715
          y51 |   9.626319   1.468212     6.56   0.000     6.743663    12.50898
          y52 |   9.521976    1.41332     6.74   0.000     6.747095    12.29686
          y53 |   8.975583   1.349159     6.65   0.000     6.326673    11.62449
          y54 |   9.975893   1.978146     5.04   0.000     6.092044    13.85974
          y55 |   9.604426   1.838817     5.22   0.000     5.994132    13.21472
          y56 |   7.697543   1.314155     5.86   0.000     5.117358    10.27773
          y57 |   7.735873   1.323053     5.85   0.000      5.13822    10.33353
          y58 |   9.160864   1.442497     6.35   0.000     6.328696    11.99303
          y59 |   10.27094   1.651465     6.22   0.000      7.02849    13.51339
          y60 |   9.530608   1.454694     6.55   0.000     6.674493    12.38672
          y61 |          0  (omitted)
          y62 |          0  (omitted)
debtservice~s |   .0572551   .0118341     4.84   0.000     .0340202    .0804899
    gdpgrowth |   19.17874   22.04519     0.87   0.385    -24.10431    62.46178
standarddev~h |   .0431271   .0219387     1.97   0.050     .0000532    .0862011
ratioofshor~t |   .0366656   .0199005     1.84   0.066    -.0024065    .0757378
reservessho~t |   .0025212   .0030732     0.82   0.412    -.0035126     .008555
ratioofdome~p |  -.0041121    .001658    -2.48   0.013    -.0073674   -.0008568
ratioofrese~s |  -.0041035    .004332    -0.95   0.344     -.012609    .0044019
debtresched~r |  -.0841835    .368856    -0.23   0.820    -.8083874    .6400205
ratioofrese~p |   .0102547   .0112338     0.91   0.362    -.0118015     .032311
standarddev~2 |   .0000157   .0003994     0.04   0.969    -.0007685    .0007999
        _cons |  -9.086007   1.456836    -6.24   0.000    -11.94633   -6.225687
-------------------------------------------------------------------------------

. eststo model6b

. 
. *(Test set)
. *1-linealidad: De las gráficas se puede concluir que las relaciones son líneal
> es y además detectamos algunos outliers.
. graph matrix spread debtserviceexports gdpgrowth standarddeviationofexportgrow
> th ratioofshorttermdebttototaldebt reservesshorttermdebt ratioofdomesticcredit
> togdp ratioofreservesimports debtrescheduledinpreviousyear ratioofreservesgdp 
> standarddeviationofexportgrowth2

. 
. avplot ratioofreservesgdp 

. avplot standarddeviationofexportgrowth2

. 
. *2-homocedasticidad: Como en el modelo equivalente del ejercicio pasado, tenem
> os algunos casos outliers los cuales si omitimos, el modelo tendría homocedast
> icidad.
. rvfplot

. *3-variable omitida: No podemos rechazar la hipotesis nula del test de Ramsey,
>  es decir, el modelo no tiene variables omitidas.
.  ovtest

Ramsey RESET test using powers of the fitted values of spread
       Ho:  model has no omitted variables
                 F(3, 693) =      1.07
                  Prob > F =      0.3629

. *4-error de especificación. En este caso _hatsq resultó ser muy significativa 
> por lo rechazamos el nulo y concluimos que nuestro modelo no está correctament
> e especificado.
. linktest

      Source |       SS           df       MS      Number of obs   =       773
-------------+----------------------------------   F(2, 770)       =    179.74
       Model |  2797.23034         2  1398.61517   Prob > F        =    0.0000
    Residual |  5991.52961       770  7.78120728   R-squared       =    0.3183
-------------+----------------------------------   Adj R-squared   =    0.3165
       Total |  8788.75995       772  11.3844041   Root MSE        =    2.7895

------------------------------------------------------------------------------
      spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        _hat |   .9819578   .0850401    11.55   0.000       .81502    1.148896
      _hatsq |   .0040637   .0150242     0.27   0.787    -.0254295     .033557
       _cons |   .0053236   .1556131     0.03   0.973    -.3001527    .3107999
------------------------------------------------------------------------------

. *5-multicolinealidad: El modelo presenta un grave caso de multicolinealidad pu
> es 27 parámetros tienen un VIF mayor a 10.
. vif

    Variable |       VIF       1/VIF  
-------------+----------------------
         c42 |    195.66    0.005111
         c15 |    117.74    0.008493
         y60 |     85.59    0.011684
         y59 |     68.87    0.014520
         y54 |     65.55    0.015256
         y50 |     65.24    0.015328
          c9 |     60.55    0.016514
         y55 |     55.45    0.018034
         y52 |     55.40    0.018051
         y53 |     53.90    0.018551
         y51 |     52.33    0.019109
         y49 |     46.05    0.021714
         y57 |     45.04    0.022203
         y56 |     43.90    0.022779
         y46 |     41.13    0.024315
         y45 |     41.12    0.024318
         y47 |     39.75    0.025160
         y58 |     37.96    0.026340
         y42 |     37.35    0.026771
         y43 |     35.61    0.028080
         y44 |     33.64    0.029725
         y48 |     31.17    0.032086
         c44 |     20.65    0.048437
         y41 |     15.20    0.065786
         c40 |     13.55    0.073814
         c31 |     13.46    0.074286
         c17 |     13.38    0.074763
         y40 |      9.89    0.101069
         y39 |      8.70    0.114908
         c14 |      8.30    0.120466
          c7 |      7.35    0.136068
standardde~h |      6.32    0.158268
standardde~2 |      5.91    0.169136
         y38 |      5.50    0.181965
         c23 |      5.06    0.197649
reservessh~t |      4.45    0.224737
         c27 |      4.22    0.237056
         c24 |      4.20    0.238111
         c32 |      4.18    0.239441
ratioofsho~t |      4.12    0.242469
         c25 |      4.12    0.242936
num_lawyer~0 |      3.82    0.261508
         c29 |      3.21    0.311700
         c39 |      3.16    0.316354
          c2 |      3.15    0.317185
         c26 |      3.14    0.318077
          c3 |      3.14    0.318666
          c8 |      3.09    0.324018
          c5 |      3.05    0.328150
         c16 |      2.61    0.382444
num_lawye~_2 |      2.49    0.401877
         y30 |      2.43    0.411346
debtservic~s |      2.40    0.416876
         y33 |      2.39    0.417569
         y32 |      2.32    0.431783
         y36 |      2.31    0.432059
         y35 |      2.31    0.432245
         c18 |      2.15    0.466102
ratioofres~p |      2.14    0.467279
         c10 |      2.13    0.469770
         c33 |      2.11    0.473320
         c34 |      2.10    0.475162
          c4 |      2.10    0.475352
         c41 |      2.10    0.477026
         c22 |      2.09    0.477350
         c20 |      2.09    0.477612
ratioofdom~p |      2.09    0.478002
          c6 |      2.09    0.478107
         c21 |      2.09    0.478216
         c36 |      2.09    0.478292
         c30 |      2.07    0.482139
ratioofres~s |      2.06    0.485718
         c13 |      2.03    0.493702
         c38 |      2.03    0.493720
   gdpgrowth |      1.93    0.518864
debtresche~r |      1.35    0.738826
-------------+----------------------
    Mean VIF |     20.41

. *6-outliers: a pesar de haber usado una regresión robusta, detectamos la prese
> ncia de outliers. 
. 
. avplot num_lawyers_2

. avplot debtserviceexports

. *7-normalidad: finalmente debido a la prieva Shapiro-Wilk concluimos que los e
> rrores no se distribuyen de manera normal.
. drop e

. predict e, resid
(714 missing values generated)

. kdensity e, normal

. swilk e

                   Shapiro-Wilk W test for normal data

    Variable |        Obs       W           V         z       Prob>z
-------------+------------------------------------------------------
           e |        773    0.44062    279.120    13.798    0.00000

. 
. esttab, b(a6) p(4) r2(4) nostar wide

----------------------------------------------------------------
                      (1)                       (2)             
                   spread                    spread             
----------------------------------------------------------------
aaa             -1.223249     (0.0000)                          
aa              -1.110918     (0.0003)                          
a               -0.844960     (0.0003)                          
bb               1.339445     (0.0012)                          
b                1.952108     (0.0000)                          
num_lawye~_2    -0.215697     (0.6865)     0.618915     (0.1952)
num_lawyer~0    -0.754934     (0.1262)    -0.310978     (0.4830)
c2               1.850040     (0.0627)     1.578546     (0.1170)
c3             -0.0405632     (0.9748)    -0.218175     (0.8646)
c4               0.466860     (0.3271)     0.300051     (0.5765)
c5              -2.104528     (0.0000)    -2.970116     (0.0000)
c6               0.999649     (0.0339)     0.880023     (0.0778)
c7               1.579828     (0.0018)     1.398755     (0.0045)
c8             -0.0370434     (0.9623)    -1.144997     (0.0150)
c9               0.497304     (0.1898)     0.527810     (0.1450)
c10              1.678092     (0.0368)     1.154872     (0.1455)
c11                     0          (.)            0          (.)
c12                     0          (.)            0          (.)
c13              0.835015     (0.0028)     0.464886     (0.1112)
c14              1.349070     (0.0141)     1.723811     (0.0530)
c15              0.232913     (0.6831)     0.429843     (0.4211)
c16              1.975939     (0.0314)     2.279755     (0.0054)
c17              0.982568     (0.0104)     0.989170     (0.0238)
c18              1.134986     (0.2125)     0.751712     (0.4212)
c19                     0          (.)            0          (.)
c20              5.818973     (0.0000)     5.699504     (0.0000)
c21              2.195499     (0.0000)     3.299393     (0.0000)
c22              2.447803     (0.0001)     2.091996     (0.0087)
c23              2.825962     (0.0008)     2.887885     (0.0002)
c24              1.111925     (0.2138)     0.280997     (0.7413)
c25            -0.0940288     (0.9077)    -0.380468     (0.6239)
c26              1.674807     (0.1678)     1.617413     (0.0489)
c27              0.754964     (0.1604)     0.203944     (0.7610)
c28                     0          (.)            0          (.)
c29              4.327485     (0.0000)     4.297511     (0.0000)
c30             -0.731344     (0.1508)     0.304459     (0.5360)
c31              1.531652     (0.0025)     1.612693     (0.0084)
c32              1.879268     (0.0039)     2.121875     (0.0261)
c33              5.428882     (0.0000)     5.559036     (0.0000)
c34              5.324043     (0.0000)     4.817909     (0.0000)
c35                     0          (.)            0          (.)
c36              0.461167     (0.3703)     0.884815     (0.0949)
c37                     0          (.)            0          (.)
c38             -1.782650     (0.0000)    -1.941583     (0.0000)
c39             -0.412980     (0.4299)    -1.123080     (0.0628)
c40             -0.783579     (0.1420)    -0.902094     (0.1305)
c41              13.35341     (0.0000)     13.21955     (0.0000)
c42              0.161459     (0.6899)     0.367475     (0.4252)
c43                     0          (.)            0          (.)
c44             -2.434931     (0.0000)    -2.235848     (0.0001)
y2                      0          (.)            0          (.)
y3                      0          (.)            0          (.)
y4                      0          (.)            0          (.)
y5                      0          (.)            0          (.)
y6                      0          (.)            0          (.)
y7                      0          (.)            0          (.)
y8                      0          (.)            0          (.)
y9                      0          (.)            0          (.)
y10                     0          (.)            0          (.)
y11                     0          (.)            0          (.)
y12                     0          (.)            0          (.)
y13                     0          (.)            0          (.)
y14                     0          (.)            0          (.)
y15                     0          (.)            0          (.)
y16                     0          (.)            0          (.)
y17                     0          (.)            0          (.)
y18                     0          (.)            0          (.)
y19                     0          (.)            0          (.)
y20                     0          (.)            0          (.)
y21                     0          (.)            0          (.)
y22                     0          (.)            0          (.)
y23                     0          (.)            0          (.)
y24                     0          (.)            0          (.)
y25                     0          (.)            0          (.)
y26                     0          (.)            0          (.)
y27                     0          (.)            0          (.)
y28                     0          (.)            0          (.)
y29                     0          (.)            0          (.)
y30                     0          (.)     9.872355     (0.0000)
y31                     0          (.)            0          (.)
y32                     0          (.)     3.521632     (0.0337)
y33              5.495328     (0.0000)     8.696895     (0.0000)
y34                     0          (.)            0          (.)
y35              5.229724     (0.0000)     8.883205     (0.0000)
y36              5.204666     (0.0000)     8.877848     (0.0000)
y37                     0          (.)            0          (.)
y38              3.238019     (0.0001)     6.491674     (0.0000)
y39              4.182392     (0.0000)     7.145487     (0.0000)
y40              5.187703     (0.0000)     8.580082     (0.0000)
y41              6.112320     (0.0000)     9.810321     (0.0000)
y42              6.024467     (0.0000)     9.918861     (0.0000)
y43              5.378184     (0.0000)     9.119073     (0.0000)
y44              4.037520     (0.0000)     8.688178     (0.0000)
y45              4.453111     (0.0000)     8.574417     (0.0000)
y46              4.222877     (0.0000)     8.089865     (0.0000)
y47              3.878802     (0.0000)     7.893766     (0.0000)
y48              5.384490     (0.0000)     9.625262     (0.0000)
y49              4.963124     (0.0000)     8.945463     (0.0000)
y50              4.691543     (0.0000)     8.741044     (0.0000)
y51              5.408024     (0.0000)     9.626319     (0.0000)
y52              5.494554     (0.0000)     9.521976     (0.0000)
y53              5.105413     (0.0000)     8.975583     (0.0000)
y54              5.774039     (0.0000)     9.975893     (0.0000)
y55              5.480935     (0.0000)     9.604426     (0.0000)
y56              3.396388     (0.0007)     7.697543     (0.0000)
y57              3.627327     (0.0000)     7.735873     (0.0000)
y58              5.074985     (0.0000)     9.160864     (0.0000)
y59              6.318105     (0.0000)     10.27094     (0.0000)
y60              5.251790     (0.0000)     9.530608     (0.0000)
y61                     0          (.)            0          (.)
y62                     0          (.)            0          (.)
debtservic~s    0.0365881     (0.0013)    0.0572551     (0.0000)
gdpgrowth        14.45301     (0.4587)     19.17874     (0.3846)
standardde~h    0.0267652     (0.0876)    0.0431271     (0.0497)
ratioofsho~t    0.0150557     (0.4061)    0.0366656     (0.0658)
reservessh~t -1.45866e-05     (0.9961)   0.00252120     (0.4123)
ratioofdom~p  -0.00126265     (0.4249)  -0.00411209     (0.0134)
ratioofres~s  -0.00144012     (0.7176)  -0.00410354     (0.3438)
debtresche~r    -0.236424     (0.5248)   -0.0841835     (0.8195)
ratioofres~p   0.00453533     (0.6398)    0.0102547     (0.3616)
standardde~2 -0.000148784     (0.3896)  1.57185e-05     (0.9686)
_cons           -3.994384     (0.0000)    -9.086007     (0.0000)
----------------------------------------------------------------
N                     766                       773             
R-sq               0.3602                    0.3182             
----------------------------------------------------------------
p-values in parentheses

. 
. *La principal conclusión esque a pesar de que estamos acarreando los mismos pr
> oblemas de los modelos pasados, ahora estamos aprovechando que las nuevas vari
> ables "varían". Esto es muy importante en la regresión pues lo que trata de ha
> cer es explicar la varianza de Y con base en la varianza de mis variables. Est
> o tiene consecuencias en que el primer modelo aumentó su r^2 hasta .3602 y el 
> segundo hasta .3182. 
. 
. 
. *VII
. eststo clear

. probit rep_ibc_top2 lnamt years highrate2 hh_index_ib num_lawyers2 y2-y62

note: y15 != 0 predicts success perfectly
      y15 dropped and 1 obs not used

note: y16 != 0 predicts failure perfectly
      y16 dropped and 1 obs not used

note: y19 != 0 predicts success perfectly
      y19 dropped and 1 obs not used

note: y23 != 0 predicts failure perfectly
      y23 dropped and 1 obs not used

note: y26 != 0 predicts failure perfectly
      y26 dropped and 2 obs not used

note: y28 != 0 predicts failure perfectly
      y28 dropped and 3 obs not used

note: y30 != 0 predicts failure perfectly
      y30 dropped and 1 obs not used

note: y32 != 0 predicts failure perfectly
      y32 dropped and 1 obs not used

note: y33 != 0 predicts failure perfectly
      y33 dropped and 1 obs not used

note: y34 != 0 predicts failure perfectly
      y34 dropped and 2 obs not used

note: y38 != 0 predicts failure perfectly
      y38 dropped and 3 obs not used

note: y39 != 0 predicts failure perfectly
      y39 dropped and 9 obs not used

note: y42 != 0 predicts failure perfectly
      y42 dropped and 22 obs not used

note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y18 omitted because of collinearity
note: y20 omitted because of collinearity
note: y21 omitted because of collinearity
note: y22 omitted because of collinearity
note: y24 omitted because of collinearity
note: y25 omitted because of collinearity
note: y27 omitted because of collinearity
note: y29 omitted because of collinearity
note: y31 omitted because of collinearity
note: y62 omitted because of collinearity
Iteration 0:   log likelihood = -584.82002  
Iteration 1:   log likelihood = -551.81852  
Iteration 2:   log likelihood = -551.48823  
Iteration 3:   log likelihood = -551.48704  
Iteration 4:   log likelihood = -551.48704  

Probit regression                               Number of obs     =        894
                                                LR chi2(30)       =      66.67
                                                Prob > chi2       =     0.0001
Log likelihood = -551.48704                     Pseudo R2         =     0.0570

------------------------------------------------------------------------------
rep_ibc_top2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnamt |   .0539573   .0349878     1.54   0.123    -.0146176    .1225322
       years |   .0126105   .0063001     2.00   0.045     .0002626    .0249585
   highrate2 |  -.3720035   .1129713    -3.29   0.001    -.5934232   -.1505837
 hh_index_ib |   .2091489   1.491266     0.14   0.888    -2.713678    3.131976
num_lawyers2 |  -.3558145   .1151061    -3.09   0.002    -.5814183   -.1302107
          y2 |          0  (omitted)
          y3 |          0  (omitted)
          y4 |          0  (omitted)
          y5 |          0  (omitted)
          y6 |          0  (omitted)
          y7 |          0  (omitted)
          y8 |          0  (omitted)
          y9 |          0  (omitted)
         y10 |          0  (omitted)
         y11 |          0  (omitted)
         y12 |          0  (omitted)
         y13 |          0  (omitted)
         y14 |          0  (omitted)
         y15 |          0  (omitted)
         y16 |          0  (omitted)
         y17 |  -.2075798   1.263203    -0.16   0.869    -2.683411    2.268252
         y18 |          0  (omitted)
         y19 |          0  (omitted)
         y20 |          0  (omitted)
         y21 |          0  (omitted)
         y22 |          0  (omitted)
         y23 |          0  (omitted)
         y24 |          0  (omitted)
         y25 |          0  (omitted)
         y26 |          0  (omitted)
         y27 |          0  (omitted)
         y28 |          0  (omitted)
         y29 |          0  (omitted)
         y30 |          0  (omitted)
         y31 |          0  (omitted)
         y32 |          0  (omitted)
         y33 |          0  (omitted)
         y34 |          0  (omitted)
         y35 |  -1.016861   1.007912    -1.01   0.313    -2.992332    .9586094
         y36 |  -.7973283   .9651164    -0.83   0.409    -2.688922    1.094265
         y37 |  -.9286759   1.029867    -0.90   0.367    -2.947178    1.089826
         y38 |          0  (omitted)
         y39 |          0  (omitted)
         y40 |  -.9589064   1.009559    -0.95   0.342    -2.937607    1.019794
         y41 |  -1.897831   1.008208    -1.88   0.060    -3.873882    .0782201
         y42 |          0  (omitted)
         y43 |  -1.435217   .9484671    -1.51   0.130    -3.294178    .4237445
         y44 |  -1.086999   .9231201    -1.18   0.239    -2.896281    .7222827
         y45 |  -.9489087   .9235906    -1.03   0.304    -2.759113    .8612956
         y46 |  -.8391618   .9234094    -0.91   0.363    -2.649011    .9706873
         y47 |  -.7171105   .9130143    -0.79   0.432    -2.506586    1.072365
         y48 |  -1.056926     .92377    -1.14   0.253    -2.867482    .7536302
         y49 |  -.5845701   .9095904    -0.64   0.520    -2.367335    1.198194
         y50 |  -.9030084   .9065411    -1.00   0.319    -2.679796    .8737795
         y51 |  -.5184569   .9041624    -0.57   0.566    -2.290583    1.253669
         y52 |  -.5950006    .906288    -0.66   0.511    -2.371292    1.181291
         y53 |  -.5370135   .9009236    -0.60   0.551    -2.302791    1.228764
         y54 |  -.4322404   .9008215    -0.48   0.631    -2.197818    1.333337
         y55 |  -.1828408   .9036965    -0.20   0.840    -1.954054    1.588372
         y56 |  -.6154444   .9125433    -0.67   0.500    -2.403997    1.173108
         y57 |  -.6888206    .910544    -0.76   0.449    -2.473454    1.095813
         y58 |  -1.009146   .9146839    -1.10   0.270    -2.801894    .7836012
         y59 |   -.245095   .8966658    -0.27   0.785    -2.002528    1.512338
         y60 |  -.5317964   .8966253    -0.59   0.553     -2.28915    1.225557
         y61 |  -.3472537   .9160135    -0.38   0.705    -2.142607      1.4481
         y62 |          0  (omitted)
       _cons |   .5886484   .9682201     0.61   0.543    -1.309028    2.486325
------------------------------------------------------------------------------

. eststo p1

. 
. *(a)
. predict PROBITXB, xb
(468 missing values generated)

. gen lambda = normalden(PROBITXB)/normal(PROBITXB)
(468 missing values generated)

. probit rep_ibc_top2 lnamt years highrate2 hh_index_ib num_lawyers2 y2-y62 lamb
> da

note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y16 omitted because of collinearity
note: y18 omitted because of collinearity
note: y19 omitted because of collinearity
note: y20 omitted because of collinearity
note: y21 omitted because of collinearity
note: y22 omitted because of collinearity
note: y23 omitted because of collinearity
note: y24 omitted because of collinearity
note: y25 omitted because of collinearity
note: y26 omitted because of collinearity
note: y27 omitted because of collinearity
note: y28 omitted because of collinearity
note: y29 omitted because of collinearity
note: y30 omitted because of collinearity
note: y31 omitted because of collinearity
note: y32 omitted because of collinearity
note: y33 omitted because of collinearity
note: y34 omitted because of collinearity
note: y38 omitted because of collinearity
note: y39 omitted because of collinearity
note: y42 omitted because of collinearity
note: y62 omitted because of collinearity
Iteration 0:   log likelihood = -584.82002  
Iteration 1:   log likelihood =  -551.6524  
Iteration 2:   log likelihood = -551.30408  
Iteration 3:   log likelihood = -551.30291  
Iteration 4:   log likelihood = -551.30291  

Probit regression                               Number of obs     =        894
                                                LR chi2(31)       =      67.03
                                                Prob > chi2       =     0.0002
Log likelihood = -551.30291                     Pseudo R2         =     0.0573

------------------------------------------------------------------------------
rep_ibc_top2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       lnamt |   .1668298   .1891236     0.88   0.378    -.2038457    .5375054
       years |   .0374816   .0414286     0.90   0.366     -.043717    .1186802
   highrate2 |  -1.118142   1.234169    -0.91   0.365    -3.537068    1.300784
 hh_index_ib |   .5487556   1.593984     0.34   0.731    -2.575396    3.672907
num_lawyers2 |  -1.070388   1.182678    -0.91   0.365    -3.388395    1.247619
          y2 |          0  (omitted)
          y3 |          0  (omitted)
          y4 |          0  (omitted)
          y5 |          0  (omitted)
          y6 |          0  (omitted)
          y7 |          0  (omitted)
          y8 |          0  (omitted)
          y9 |          0  (omitted)
         y10 |          0  (omitted)
         y11 |          0  (omitted)
         y12 |          0  (omitted)
         y13 |          0  (omitted)
         y14 |          0  (omitted)
         y15 |          0  (omitted)
         y16 |          0  (omitted)
         y17 |  -.6072162   1.422711    -0.43   0.670    -3.395678    2.181245
         y18 |          0  (omitted)
         y19 |          0  (omitted)
         y20 |          0  (omitted)
         y21 |          0  (omitted)
         y22 |          0  (omitted)
         y23 |          0  (omitted)
         y24 |          0  (omitted)
         y25 |          0  (omitted)
         y26 |          0  (omitted)
         y27 |          0  (omitted)
         y28 |          0  (omitted)
         y29 |          0  (omitted)
         y30 |          0  (omitted)
         y31 |          0  (omitted)
         y32 |          0  (omitted)
         y33 |          0  (omitted)
         y34 |          0  (omitted)
         y35 |  -3.063578   3.517317    -0.87   0.384    -9.957393    3.830238
         y36 |  -2.377082   2.773961    -0.86   0.391    -7.813945    3.059782
         y37 |  -2.783725   3.222864    -0.86   0.388    -9.100422    3.532973
         y38 |          0  (omitted)
         y39 |          0  (omitted)
         y40 |  -2.898217   3.348825    -0.87   0.387    -9.461793     3.66536
         y41 |  -6.018514   6.861782    -0.88   0.380    -19.46736    7.430333
         y42 |          0  (omitted)
         y43 |  -4.445362   5.047066    -0.88   0.378    -14.33743    5.446705
         y44 |  -3.294537   3.750038    -0.88   0.380    -10.64448    4.055402
         y45 |  -2.857594   3.275397    -0.87   0.383    -9.277254    3.562066
         y46 |  -2.521398   2.919707    -0.86   0.388    -8.243919    3.201122
         y47 |  -2.142302   2.517827    -0.85   0.395    -7.077151    2.792548
         y48 |  -3.199697   3.647637    -0.88   0.380    -10.34893     3.94954
         y49 |   -1.73699   2.103883    -0.83   0.409    -5.860524    2.386545
         y50 |  -2.716843    3.12101    -0.87   0.384     -8.83391    3.400223
         y51 |  -1.539271   1.908137    -0.81   0.420     -5.27915    2.200609
         y52 |  -1.768459   2.133861    -0.83   0.407     -5.95075    2.413832
         y53 |  -1.595451   1.961428    -0.81   0.416     -5.43978    2.248877
         y54 |  -1.287616   1.671499    -0.77   0.441    -4.563695    1.988462
         y55 |  -.5939001   1.128161    -0.53   0.599    -2.805055    1.617255
         y56 |  -1.827543   2.194259    -0.83   0.405    -6.128212    2.473126
         y57 |  -2.051116   2.420583    -0.85   0.397    -6.795373     2.69314
         y58 |  -3.047864   3.479013    -0.88   0.381    -9.866604    3.770877
         y59 |  -.7401188   1.211111    -0.61   0.541    -3.113853    1.633616
         y60 |  -1.589172    1.95789    -0.81   0.417    -5.426566    2.248223
         y61 |  -1.031115   1.450891    -0.71   0.477    -3.874809     1.81258
         y62 |          0  (omitted)
      lambda |   2.871786   4.727663     0.61   0.544    -6.394264    12.13784
       _cons |  -.5441715   2.099248    -0.26   0.795    -4.658622    3.570279
------------------------------------------------------------------------------

. eststo p2

. 
. esttab, b(a6) p(4) r2(4) nostar wide

----------------------------------------------------------------
                      (1)                       (2)             
             rep_ibc_top2              rep_ibc_top2             
----------------------------------------------------------------
rep_ibc_top2                                                    
lnamt           0.0539573     (0.1230)     0.166830     (0.3777)
years           0.0126105     (0.0453)    0.0374816     (0.3656)
highrate2       -0.372003     (0.0010)    -1.118142     (0.3649)
hh_index_ib      0.209149     (0.8885)     0.548756     (0.7306)
num_lawyers2    -0.355814     (0.0020)    -1.070388     (0.3654)
y2                      0          (.)            0          (.)
y3                      0          (.)            0          (.)
y4                      0          (.)            0          (.)
y5                      0          (.)            0          (.)
y6                      0          (.)            0          (.)
y7                      0          (.)            0          (.)
y8                      0          (.)            0          (.)
y9                      0          (.)            0          (.)
y10                     0          (.)            0          (.)
y11                     0          (.)            0          (.)
y12                     0          (.)            0          (.)
y13                     0          (.)            0          (.)
y14                     0          (.)            0          (.)
y15                     0          (.)            0          (.)
y16                     0          (.)            0          (.)
y17             -0.207580     (0.8695)    -0.607216     (0.6695)
y18                     0          (.)            0          (.)
y19                     0          (.)            0          (.)
y20                     0          (.)            0          (.)
y21                     0          (.)            0          (.)
y22                     0          (.)            0          (.)
y23                     0          (.)            0          (.)
y24                     0          (.)            0          (.)
y25                     0          (.)            0          (.)
y26                     0          (.)            0          (.)
y27                     0          (.)            0          (.)
y28                     0          (.)            0          (.)
y29                     0          (.)            0          (.)
y30                     0          (.)            0          (.)
y31                     0          (.)            0          (.)
y32                     0          (.)            0          (.)
y33                     0          (.)            0          (.)
y34                     0          (.)            0          (.)
y35             -1.016861     (0.3130)    -3.063578     (0.3838)
y36             -0.797328     (0.4087)    -2.377082     (0.3915)
y37             -0.928676     (0.3672)    -2.783725     (0.3877)
y38                     0          (.)            0          (.)
y39                     0          (.)            0          (.)
y40             -0.958906     (0.3422)    -2.898217     (0.3868)
y41             -1.897831     (0.0598)    -6.018514     (0.3804)
y42                     0          (.)            0          (.)
y43             -1.435217     (0.1302)    -4.445362     (0.3784)
y44             -1.086999     (0.2390)    -3.294537     (0.3797)
y45             -0.948909     (0.3042)    -2.857594     (0.3830)
y46             -0.839162     (0.3635)    -2.521398     (0.3878)
y47             -0.717110     (0.4322)    -2.142302     (0.3949)
y48             -1.056926     (0.2526)    -3.199697     (0.3804)
y49             -0.584570     (0.5204)    -1.736990     (0.4090)
y50             -0.903008     (0.3192)    -2.716843     (0.3840)
y51             -0.518457     (0.5664)    -1.539271     (0.4198)
y52             -0.595001     (0.5115)    -1.768459     (0.4072)
y53             -0.537014     (0.5511)    -1.595451     (0.4160)
y54             -0.432240     (0.6313)    -1.287616     (0.4411)
y55             -0.182841     (0.8397)    -0.593900     (0.5986)
y56             -0.615444     (0.5000)    -1.827543     (0.4049)
y57             -0.688821     (0.4494)    -2.051116     (0.3968)
y58             -1.009146     (0.2699)    -3.047864     (0.3810)
y59             -0.245095     (0.7846)    -0.740119     (0.5411)
y60             -0.531796     (0.5531)    -1.589172     (0.4170)
y61             -0.347254     (0.7046)    -1.031115     (0.4773)
y62                     0          (.)            0          (.)
lambda                                     2.871786     (0.5436)
_cons            0.588648     (0.5432)    -0.544172     (0.7955)
----------------------------------------------------------------
N                     894                       894             
R-sq                                                            
----------------------------------------------------------------
p-values in parentheses

. *Lambda se refiere al "Mills ratio", en este caso a la probabilidad de la ocur
> rencia de rep_ibc_top2 entre toda su probabilidad acumulada. Se usa para contr
> olar la endogenidad en el modelo, es decir al riesgo de que la muestra haya si
> do elegida (total o parcialmente) con base en algún valor de nuestra variables
>  dependiente. Por ejemplo, pensemos en los algoritmos que calculan la probabil
> idad de que una persona imputada tenga derecho a prisión domicial o no en EEUU
>  y como pueden tener un sesgo de selección en contra de las personas negros.
. *Solo para dimensionar
. predict f_hat
(option pr assumed; Pr(rep_ibc_top2))
(468 missing values generated)

. tw line f_hat lambda, sort

. 
. 
. *(b)
. *Ahora replico 5a pero con lambda
. *Comenzamos un análisis  con la regresión que contempla al rating.
. *Si lambda es cero no hay sesgo de selecicón, por  lo que podemos hacer una pr
> ueba de significancia T.
. 
. *MODEL7A
. eststo clear

. regress spread lambda aaa aa a bb b num_lawyers_2 num_lawyers_0 c2-c44 y2-y62,
>  robust
note: c12 omitted because of collinearity
note: c16 omitted because of collinearity
note: c21 omitted because of collinearity
note: c28 omitted because of collinearity
note: c37 omitted because of collinearity
note: c43 omitted because of collinearity
note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y16 omitted because of collinearity
note: y17 omitted because of collinearity
note: y18 omitted because of collinearity
note: y19 omitted because of collinearity
note: y20 omitted because of collinearity
note: y21 omitted because of collinearity
note: y22 omitted because of collinearity
note: y23 omitted because of collinearity
note: y24 omitted because of collinearity
note: y25 omitted because of collinearity
note: y26 omitted because of collinearity
note: y27 omitted because of collinearity
note: y28 omitted because of collinearity
note: y29 omitted because of collinearity
note: y30 omitted because of collinearity
note: y31 omitted because of collinearity
note: y32 omitted because of collinearity
note: y33 omitted because of collinearity
note: y34 omitted because of collinearity
note: y38 omitted because of collinearity
note: y39 omitted because of collinearity
note: y42 omitted because of collinearity

Linear regression                               Number of obs     =        900
                                                F(53, 829)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3509
                                                Root MSE          =     2.7317

-------------------------------------------------------------------------------
              |               Robust
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       lambda |   1.270419   1.101866     1.15   0.249    -.8923567    3.433195
          aaa |  -1.596417   .3342517    -4.78   0.000    -2.252496   -.9403376
           aa |  -1.417513   .2175955    -6.51   0.000    -1.844616   -.9904103
            a |  -.7600405   .2190502    -3.47   0.001    -1.189999   -.3300822
           bb |   2.209925   .6893443     3.21   0.001     .8568591     3.56299
            b |   2.869045   .4273245     6.71   0.000      2.03028    3.707811
num_lawyers_2 |  -.2522939   .6104633    -0.41   0.680     -1.45053    .9459416
num_lawyers_0 |  -.3124073   .3874975    -0.81   0.420    -1.072999    .4481843
           c2 |   1.892777   .6912055     2.74   0.006     .5360583    3.249496
           c3 |  -1.941065   .3508482    -5.53   0.000     -2.62972    -1.25241
           c4 |   .1120877    .373683     0.30   0.764    -.6213885    .8455639
           c5 |  -2.043657   .3777626    -5.41   0.000    -2.785141   -1.302174
           c6 |    1.04037   .4674129     2.23   0.026     .1229185    1.957822
           c7 |   1.747706   .4560453     3.83   0.000     .8525664    2.642845
           c8 |  -.2168781   .8253344    -0.26   0.793    -1.836869    1.403113
           c9 |   .4012914    .370599     1.08   0.279    -.3261314    1.128714
          c10 |   2.438778     .56157     4.34   0.000     1.336511    3.541044
          c11 |   .1365979   .5802236     0.24   0.814    -1.002282    1.275478
          c12 |          0  (omitted)
          c13 |    .854847   .2091138     4.09   0.000     .4443923    1.265302
          c14 |   1.034316   .3037303     3.41   0.001     .4381453    1.630487
          c15 |   .3134025   .5908571     0.53   0.596    -.8463494    1.473154
          c16 |          0  (omitted)
          c17 |   1.022141   .4174568     2.45   0.015     .2027441    1.841537
          c18 |   1.675247   .5382456     3.11   0.002     .6187628    2.731732
          c19 |  -1.099732   .9235982    -1.19   0.234    -2.912598    .7131339
          c20 |   5.278006   .4706986    11.21   0.000     4.354105    6.201907
          c21 |          0  (omitted)
          c22 |   3.180808   .4626915     6.87   0.000     2.272623    4.088992
          c23 |   2.831796   .9517008     2.98   0.003     .9637698    4.699823
          c24 |   1.080229   .7955183     1.36   0.175    -.4812381    2.641696
          c25 |   .1222137   .7446256     0.16   0.870     -1.33936    1.583787
          c26 |   1.525164   1.284787     1.19   0.236    -.9966535    4.046981
          c27 |   1.146395   .4801593     2.39   0.017      .203924    2.088866
          c28 |          0  (omitted)
          c29 |   4.456649   .9730585     4.58   0.000     2.546701    6.366597
          c30 |   -1.08711   .4142507    -2.62   0.009    -1.900214   -.2740064
          c31 |   1.550793   .4620547     3.36   0.001     .6438584    2.457728
          c32 |   1.970818   .8777938     2.25   0.025     .2478587    3.693778
          c33 |   5.029162   .4963529    10.13   0.000     4.054905    6.003418
          c34 |   5.247342   .5749769     9.13   0.000      4.11876    6.375923
          c35 |   3.105575   .5829352     5.33   0.000     1.961373    4.249778
          c36 |   .3545242   .5036903     0.70   0.482     -.634134    1.343182
          c37 |          0  (omitted)
          c38 |   -1.90561   .2050496    -9.29   0.000    -2.308088   -1.503133
          c39 |    .203434   .5011474     0.41   0.685    -.7802329    1.187101
          c40 |  -1.081843   .5392315    -2.01   0.045    -2.140263   -.0234238
          c41 |   13.08326   .4535681    28.85   0.000     12.19298    13.97354
          c42 |   .4128264   .3399072     1.21   0.225    -.2543536    1.080006
          c43 |          0  (omitted)
          c44 |  -2.039779   .4813168    -4.24   0.000    -2.984522   -1.095036
           y2 |          0  (omitted)
           y3 |          0  (omitted)
           y4 |          0  (omitted)
           y5 |          0  (omitted)
           y6 |          0  (omitted)
           y7 |          0  (omitted)
           y8 |          0  (omitted)
           y9 |          0  (omitted)
          y10 |          0  (omitted)
          y11 |          0  (omitted)
          y12 |          0  (omitted)
          y13 |          0  (omitted)
          y14 |          0  (omitted)
          y15 |          0  (omitted)
          y16 |          0  (omitted)
          y17 |          0  (omitted)
          y18 |          0  (omitted)
          y19 |          0  (omitted)
          y20 |          0  (omitted)
          y21 |          0  (omitted)
          y22 |          0  (omitted)
          y23 |          0  (omitted)
          y24 |          0  (omitted)
          y25 |          0  (omitted)
          y26 |          0  (omitted)
          y27 |          0  (omitted)
          y28 |          0  (omitted)
          y29 |          0  (omitted)
          y30 |          0  (omitted)
          y31 |          0  (omitted)
          y32 |          0  (omitted)
          y33 |          0  (omitted)
          y34 |          0  (omitted)
          y35 |  -3.580363    .861246    -4.16   0.000    -5.270842   -1.889884
          y36 |  -1.890938   .6610853    -2.86   0.004    -3.188535   -.5933398
          y37 |  -1.717035   .8083004    -2.12   0.034    -3.303591   -.1304787
          y38 |          0  (omitted)
          y39 |          0  (omitted)
          y40 |  -.8532108   .7767741    -1.10   0.272    -2.377886    .6714645
          y41 |   -1.89484   1.440743    -1.32   0.189    -4.722773    .9330931
          y42 |          0  (omitted)
          y43 |  -1.836257   1.110002    -1.65   0.098    -4.015002    .3424884
          y44 |  -2.579416   .9275975    -2.78   0.006    -4.400132   -.7587006
          y45 |  -1.955556   .8882425    -2.20   0.028    -3.699025   -.2120877
          y46 |   -1.88451   .7331703    -2.57   0.010    -3.323599   -.4454219
          y47 |  -2.702249   .6214049    -4.35   0.000    -3.921961   -1.482537
          y48 |  -1.559809   .8812717    -1.77   0.077    -3.289596    .1699769
          y49 |  -1.147973   .7014673    -1.64   0.102    -2.524834    .2288882
          y50 |  -1.671113   .7927374    -2.11   0.035    -3.227122   -.1151046
          y51 |  -.9548095   .5450569    -1.75   0.080    -2.024663    .1150443
          y52 |   -.841941   .6126784    -1.37   0.170    -2.044524    .3606423
          y53 |  -1.337452   .5466463    -2.45   0.015    -2.410426   -.2644787
          y54 |  -.5966651   .8426872    -0.71   0.479    -2.250717    1.057386
          y55 |  -.8887578   1.093482    -0.81   0.417    -3.035077    1.257562
          y56 |  -2.391664   .6050353    -3.95   0.000    -3.579246   -1.204083
          y57 |  -2.541178   .6228341    -4.08   0.000    -3.763695    -1.31866
          y58 |  -1.635391   .7771211    -2.10   0.036    -3.160747   -.1100346
          y59 |   .1683144   .5306344     0.32   0.751    -.8732306    1.209859
          y60 |   -1.18256   .5573309    -2.12   0.034    -2.276506    -.088614
          y61 |  -.5717818   .5315377    -1.08   0.282      -1.6151    .4715362
          y62 |    1.64457    .740921     2.22   0.027      .190268    3.098871
        _cons |   1.541069   1.012316     1.52   0.128    -.4459339    3.528072
-------------------------------------------------------------------------------

. eststo MODEL7A

. 
. ttest lambda ==0

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
  lambda |   1,019    1.051783    .0088624    .2829021    1.034392    1.069173
------------------------------------------------------------------------------
    mean = mean(lambda)                                           t = 118.6798
Ho: mean = 0                                     degrees of freedom =     1018

    Ha: mean < 0                 Ha: mean != 0                 Ha: mean > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. *El valor t es de 118, claramente indicando que lambda es mayor a 0. Hay sesgo
>  de selección. 
. 
. *Ahora realizamos el análisis con la regresión sin los ratings
. 
. *MODEL7B
. regress spread lambda num_lawyers_2 num_lawyers_0 c2-c44 y2-y62 , robust
note: c12 omitted because of collinearity
note: c16 omitted because of collinearity
note: c21 omitted because of collinearity
note: c28 omitted because of collinearity
note: c37 omitted because of collinearity
note: c43 omitted because of collinearity
note: y2 omitted because of collinearity
note: y3 omitted because of collinearity
note: y4 omitted because of collinearity
note: y5 omitted because of collinearity
note: y6 omitted because of collinearity
note: y7 omitted because of collinearity
note: y8 omitted because of collinearity
note: y9 omitted because of collinearity
note: y10 omitted because of collinearity
note: y11 omitted because of collinearity
note: y12 omitted because of collinearity
note: y13 omitted because of collinearity
note: y14 omitted because of collinearity
note: y15 omitted because of collinearity
note: y16 omitted because of collinearity
note: y17 omitted because of collinearity
note: y18 omitted because of collinearity
note: y19 omitted because of collinearity
note: y20 omitted because of collinearity
note: y21 omitted because of collinearity
note: y22 omitted because of collinearity
note: y23 omitted because of collinearity
note: y24 omitted because of collinearity
note: y25 omitted because of collinearity
note: y26 omitted because of collinearity
note: y27 omitted because of collinearity
note: y28 omitted because of collinearity
note: y29 omitted because of collinearity
note: y30 omitted because of collinearity
note: y31 omitted because of collinearity
note: y32 omitted because of collinearity
note: y33 omitted because of collinearity
note: y34 omitted because of collinearity
note: y38 omitted because of collinearity
note: y39 omitted because of collinearity
note: y42 omitted because of collinearity

Linear regression                               Number of obs     =        900
                                                F(48, 834)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2872
                                                Root MSE          =      2.854

-------------------------------------------------------------------------------
              |               Robust
       spread |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
       lambda |  -6.606195   .9708911    -6.80   0.000    -8.511872   -4.700518
num_lawyers_2 |   2.412948   .1615985    14.93   0.000     2.095761    2.730136
num_lawyers_0 |  -2.054309   .6174391    -3.33   0.001    -3.266226   -.8423917
           c2 |   1.653543   .7889126     2.10   0.036     .1050555     3.20203
           c3 |  -1.860589   .3350393    -5.55   0.000    -2.518208   -1.202969
           c4 |   .8550193   .3415547     2.50   0.012     .1846114    1.525427
           c5 |  -2.926129   .4720351    -6.20   0.000    -3.852646   -1.999613
           c6 |  -.0641657   .4337155    -0.15   0.882    -.9154679    .7871364
           c7 |   1.466273   .3730339     3.93   0.000     .7340773    2.198469
           c8 |  -1.731698   .5272289    -3.28   0.001    -2.766549   -.6968461
           c9 |   .3807001   .3438648     1.11   0.269     -.294242    1.055642
          c10 |   .8441147   .5492262     1.54   0.125    -.2339133    1.922143
          c11 |  -.3112369   .6398231    -0.49   0.627     -1.56709    .9446159
          c12 |          0  (omitted)
          c13 |   .3284927   .1558749     2.11   0.035     .0225396    .6344459
          c14 |   .3915449   .3557186     1.10   0.271    -.3066639    1.089754
          c15 |    .409192   .5425015     0.75   0.451    -.6556367    1.474021
          c16 |          0  (omitted)
          c17 |   -.751364   .4087961    -1.84   0.066    -1.553754     .051026
          c18 |   .9084741   .5299556     1.71   0.087    -.1317294    1.948678
          c19 |  -.6900243    .866886    -0.80   0.426    -2.391559     1.01151
          c20 |   5.889725   .4331049    13.60   0.000     5.039622    6.739829
          c21 |          0  (omitted)
          c22 |    4.61279   .4486925    10.28   0.000     3.732091     5.49349
          c23 |    1.33814   1.097868     1.22   0.223    -.8167702     3.49305
          c24 |  -.7887041    .617687    -1.28   0.202    -2.001108    .4236998
          c25 |  -.3676049   .3936495    -0.93   0.351    -1.140265    .4050553
          c26 |   1.200509   .8626923     1.39   0.164    -.4927945    2.893812
          c27 |   .3289831   .4359949     0.75   0.451    -.5267931    1.184759
          c28 |          0  (omitted)
          c29 |   3.294812   .4411843     7.47   0.000      2.42885    4.160774
          c30 |  -2.061701   .4279185    -4.82   0.000    -2.901625   -1.221778
          c31 |   1.533484   .5617772     2.73   0.006     .4308212    2.636148
          c32 |   1.471651   1.393958     1.06   0.291    -1.264427    4.207729
          c33 |   6.454345   .5135795    12.57   0.000     5.446284    7.462405
          c34 |   4.638764   .4334223    10.70   0.000     3.788037    5.489491
          c35 |   2.046596    .434272     4.71   0.000     1.194202    2.898991
          c36 |  -.2537447   .4613859    -0.55   0.582    -1.159359    .6518693
          c37 |          0  (omitted)
          c38 |   -2.36713   .1565882   -15.12   0.000    -2.674483   -2.059777
          c39 |  -.8365331   .4343972    -1.93   0.054    -1.689173    .0161072
          c40 |  -1.334559   .5088458    -2.62   0.009    -2.333328   -.3357905
          c41 |    13.7591   .4887599    28.15   0.000     12.79976    14.71845
          c42 |   .3030918    .319814     0.95   0.344     -.324643    .9308267
          c43 |          0  (omitted)
          c44 |   -3.81405   .4836477    -7.89   0.000    -4.763359    -2.86474
           y2 |          0  (omitted)
           y3 |          0  (omitted)
           y4 |          0  (omitted)
           y5 |          0  (omitted)
           y6 |          0  (omitted)
           y7 |          0  (omitted)
           y8 |          0  (omitted)
           y9 |          0  (omitted)
          y10 |          0  (omitted)
          y11 |          0  (omitted)
          y12 |          0  (omitted)
          y13 |          0  (omitted)
          y14 |          0  (omitted)
          y15 |          0  (omitted)
          y16 |          0  (omitted)
          y17 |          0  (omitted)
          y18 |          0  (omitted)
          y19 |          0  (omitted)
          y20 |          0  (omitted)
          y21 |          0  (omitted)
          y22 |          0  (omitted)
          y23 |          0  (omitted)
          y24 |          0  (omitted)
          y25 |          0  (omitted)
          y26 |          0  (omitted)
          y27 |          0  (omitted)
          y28 |          0  (omitted)
          y29 |          0  (omitted)
          y30 |          0  (omitted)
          y31 |          0  (omitted)
          y32 |          0  (omitted)
          y33 |          0  (omitted)
          y34 |          0  (omitted)
          y35 |  -.0248288   .9180936    -0.03   0.978    -1.826874    1.777217
          y36 |   .2272704   .6840223     0.33   0.740    -1.115337    1.569878
          y37 |   1.647723   .7905175     2.08   0.037     .0960856    3.199361
          y38 |          0  (omitted)
          y39 |          0  (omitted)
          y40 |   2.938463   .7673349     3.83   0.000     1.432329    4.444598
          y41 |   7.699477   1.327567     5.80   0.000     5.093712    10.30524
          y42 |          0  (omitted)
          y43 |   5.106373   1.003523     5.09   0.000     3.136646      7.0761
          y44 |   2.525474   .7717438     3.27   0.001     1.010686    4.040262
          y45 |   2.393274    .693764     3.45   0.001     1.031545    3.755002
          y46 |   1.570091   .6375468     2.46   0.014     .3187062    2.821476
          y47 |  -.0427141   .5699597    -0.07   0.940    -1.161438     1.07601
          y48 |   3.239327   .7753142     4.18   0.000      1.71753    4.761123
          y49 |   1.193801   .5123131     2.33   0.020     .1882261    2.199375
          y50 |   1.963807   .6006888     3.27   0.001     .7847677    3.142847
          y51 |   .5076725   .4970732     1.02   0.307    -.4679891    1.483334
          y52 |   1.073519   .5145921     2.09   0.037     .0634709    2.083566
          y53 |  -.0042885   .4792382    -0.01   0.993    -.9449433    .9363664
          y54 |   .3403612   .9443846     0.36   0.719    -1.513289    2.194011
          y55 |  -1.414079   1.038057    -1.36   0.173    -3.451591    .6234326
          y56 |  -.5409532   .5174302    -1.05   0.296    -1.556572    .4746653
          y57 |  -.4655643   .5052749    -0.92   0.357    -1.457324    .5261955
          y58 |   2.205527   .6461112     3.41   0.001     .9373318    3.473722
          y59 |  -.3826501   .5096202    -0.75   0.453    -1.382939    .6176389
          y60 |   .0123559   .4968497     0.02   0.980     -.962867    .9875787
          y61 |  -.2843393   .5118099    -0.56   0.579    -1.288926    .7202476
          y62 |  -.2254658   .6277448    -0.36   0.720    -1.457611     1.00668
        _cons |   6.761453   .9587958     7.05   0.000     4.879516    8.643389
-------------------------------------------------------------------------------

. eststo MODEL7B

. ttest lambda ==0

One-sample t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
  lambda |   1,019    1.051783    .0088624    .2829021    1.034392    1.069173
------------------------------------------------------------------------------
    mean = mean(lambda)                                           t = 118.6798
Ho: mean = 0                                     degrees of freedom =     1018

    Ha: mean < 0                 Ha: mean != 0                 Ha: mean > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. *El valor t es de 118 también, claramente indicando que lambda es mayor a 0. H
> ay sesgo de selección. 
. 
. esttab, b(a6) p(4) r2(4) nostar wide

----------------------------------------------------------------
                      (1)                       (2)             
                   spread                    spread             
----------------------------------------------------------------
lambda           1.270419     (0.2493)    -6.606195     (0.0000)
aaa             -1.596417     (0.0000)                          
aa              -1.417513     (0.0000)                          
a               -0.760040     (0.0005)                          
bb               2.209925     (0.0014)                          
b                2.869045     (0.0000)                          
num_lawye~_2    -0.252294     (0.6795)     2.412948     (0.0000)
num_lawyer~0    -0.312407     (0.4203)    -2.054309     (0.0009)
c2               1.892777     (0.0063)     1.653543     (0.0364)
c3              -1.941065     (0.0000)    -1.860589     (0.0000)
c4               0.112088     (0.7643)     0.855019     (0.0125)
c5              -2.043657     (0.0000)    -2.926129     (0.0000)
c6               1.040370     (0.0263)   -0.0641657     (0.8824)
c7               1.747706     (0.0001)     1.466273     (0.0001)
c8              -0.216878     (0.7928)    -1.731698     (0.0011)
c9               0.401291     (0.2792)     0.380700     (0.2686)
c10              2.438778     (0.0000)     0.844115     (0.1247)
c11              0.136598     (0.8139)    -0.311237     (0.6268)
c12                     0          (.)            0          (.)
c13              0.854847     (0.0000)     0.328493     (0.0354)
c14              1.034316     (0.0007)     0.391545     (0.2713)
c15              0.313402     (0.5960)     0.409192     (0.4509)
c16                     0          (.)            0          (.)
c17              1.022141     (0.0146)    -0.751364     (0.0664)
c18              1.675247     (0.0019)     0.908474     (0.0869)
c19             -1.099732     (0.2341)    -0.690024     (0.4263)
c20              5.278006     (0.0000)     5.889725     (0.0000)
c21                     0          (.)            0          (.)
c22              3.180808     (0.0000)     4.612790     (0.0000)
c23              2.831796     (0.0030)     1.338140     (0.2232)
c24              1.080229     (0.1749)    -0.788704     (0.2020)
c25              0.122214     (0.8697)    -0.367605     (0.3507)
c26              1.525164     (0.2355)     1.200509     (0.1644)
c27              1.146395     (0.0172)     0.328983     (0.4507)
c28                     0          (.)            0          (.)
c29              4.456649     (0.0000)     3.294812     (0.0000)
c30             -1.087110     (0.0088)    -2.061701     (0.0000)
c31              1.550793     (0.0008)     1.533484     (0.0065)
c32              1.970818     (0.0250)     1.471651     (0.2914)
c33              5.029162     (0.0000)     6.454345     (0.0000)
c34              5.247342     (0.0000)     4.638764     (0.0000)
c35              3.105575     (0.0000)     2.046596     (0.0000)
c36              0.354524     (0.4817)    -0.253745     (0.5825)
c37                     0          (.)            0          (.)
c38             -1.905610     (0.0000)    -2.367130     (0.0000)
c39              0.203434     (0.6849)    -0.836533     (0.0545)
c40             -1.081843     (0.0452)    -1.334559     (0.0089)
c41              13.08326     (0.0000)     13.75910     (0.0000)
c42              0.412826     (0.2249)     0.303092     (0.3436)
c43                     0          (.)            0          (.)
c44             -2.039779     (0.0000)    -3.814050     (0.0000)
y2                      0          (.)            0          (.)
y3                      0          (.)            0          (.)
y4                      0          (.)            0          (.)
y5                      0          (.)            0          (.)
y6                      0          (.)            0          (.)
y7                      0          (.)            0          (.)
y8                      0          (.)            0          (.)
y9                      0          (.)            0          (.)
y10                     0          (.)            0          (.)
y11                     0          (.)            0          (.)
y12                     0          (.)            0          (.)
y13                     0          (.)            0          (.)
y14                     0          (.)            0          (.)
y15                     0          (.)            0          (.)
y16                     0          (.)            0          (.)
y17                     0          (.)            0          (.)
y18                     0          (.)            0          (.)
y19                     0          (.)            0          (.)
y20                     0          (.)            0          (.)
y21                     0          (.)            0          (.)
y22                     0          (.)            0          (.)
y23                     0          (.)            0          (.)
y24                     0          (.)            0          (.)
y25                     0          (.)            0          (.)
y26                     0          (.)            0          (.)
y27                     0          (.)            0          (.)
y28                     0          (.)            0          (.)
y29                     0          (.)            0          (.)
y30                     0          (.)            0          (.)
y31                     0          (.)            0          (.)
y32                     0          (.)            0          (.)
y33                     0          (.)            0          (.)
y34                     0          (.)            0          (.)
y35             -3.580363     (0.0000)   -0.0248288     (0.9784)
y36             -1.890938     (0.0043)     0.227270     (0.7398)
y37             -1.717035     (0.0339)     1.647723     (0.0374)
y38                     0          (.)            0          (.)
y39                     0          (.)            0          (.)
y40             -0.853211     (0.2723)     2.938463     (0.0001)
y41             -1.894840     (0.1888)     7.699477     (0.0000)
y42                     0          (.)            0          (.)
y43             -1.836257     (0.0984)     5.106373     (0.0000)
y44             -2.579416     (0.0055)     2.525474     (0.0011)
y45             -1.955556     (0.0280)     2.393274     (0.0006)
y46             -1.884510     (0.0103)     1.570091     (0.0140)
y47             -2.702249     (0.0000)   -0.0427141     (0.9403)
y48             -1.559809     (0.0771)     3.239327     (0.0000)
y49             -1.147973     (0.1021)     1.193801     (0.0200)
y50             -1.671113     (0.0353)     1.963807     (0.0011)
y51             -0.954809     (0.0802)     0.507672     (0.3074)
y52             -0.841941     (0.1698)     1.073519     (0.0373)
y53             -1.337452     (0.0146)  -0.00428845     (0.9929)
y54             -0.596665     (0.4791)     0.340361     (0.7186)
y55             -0.888758     (0.4166)    -1.414079     (0.1735)
y56             -2.391664     (0.0001)    -0.540953     (0.2961)
y57             -2.541178     (0.0000)    -0.465564     (0.3571)
y58             -1.635391     (0.0356)     2.205527     (0.0007)
y59              0.168314     (0.7512)    -0.382650     (0.4530)
y60             -1.182560     (0.0341)    0.0123559     (0.9802)
y61             -0.571782     (0.2824)    -0.284339     (0.5787)
y62              1.644570     (0.0267)    -0.225466     (0.7196)
_cons            1.541069     (0.1283)     6.761453     (0.0000)
----------------------------------------------------------------
N                     900                       900             
R-sq               0.3509                    0.2872             
----------------------------------------------------------------
p-values in parentheses

. 
. *Agregar la lambda sirve para corregir los modelos, en este sentido el r^2 de 
> los modelos fue de .3509 y .284, menor al de los modelos del ejercicio 6. 
. 
. *Conclusión de la tarea: Cada método de estimación tiene su proposito y de acu
> erdo a ese, una estructura particular. En el caso de la regresión líneal su ob
> jetivo es lograr obtener parámetros con poder explicativo, por lo cual se comp
> lica el analisis cuando metemos n variables dummy y en general con una gran ca
> ntidad variables. En cambio, otros métodos están más enfocados en predecir, en
>  este sentido, un modelo probit puede aprovechar nuestra gran cantidad de vari
> ables dummies para generar una buena predicción. Asimismo, hay que considerar 
> el riesgo de que nuestros modelos tengan sesgos como los de selección, especif
> icación, multicolinealidad, heterocedasticidad, y para detectarlos y corregirl
> os (en la medida de lo posible) debemos aprovechar todas las herramientas que 
> tengamos disponibles.
. 
. log close _all
      name:  <unnamed>
       log:  /Users/marcoyel21/Desktop/STATA/MarcoRamos_142244_Tarea1RES.log
  log type:  text
 closed on:   2 Sep 2020, 15:14:35
--------------------------------------------------------------------------------
